{"translate":"","paragraphs":[{"sentences":[{"text":"Bankers have been blaming themselves for their troubles in public.","explainMd":"1. **翻译**：结合全文的整体意思，这句话可以翻译为：在公众面前，银行家们一直在为自己的困境自责。\n\n2. **词汇和短语**：\n    - Bankers：银行家\n    - blaming themselves：自我指责\n    - their troubles：他们的困境\n    - in public：在公众面前\n\n3. **句子结构**：这是一个简单的主动句，主语是“Bankers”，谓语是“have been blaming”，宾语是“themselves”，\"for their troubles\"是介词短语作宾语补足语，表示银行家们自责的原因，\"in public\"是副词短语，表示这个动作发生的地点。\n\n4. **语法**：这句话使用了现在完成进行时态（Present Perfect Continuous Tense），表示从过去某一时刻开始，一直延续到现在的动作或状态，可能会继续下去。\n\n5. **知识点总结**：\n    - 现在完成进行时态表示从过去开始，一直持续到现在的动作或状态，可能还会继续下去。\n    - 介词短语可以作为宾语补足语，详细说明宾语的特点或状态。\n    - 副词短语可以表示动作发生的地点、时间、方式、原因等。\n\n6. **练习相似句子**（英文加中文翻译，一句）：\n    - \"Scientists have been criticizing themselves for their mistakes in the experiment.\"\n    - 翻译：在实验中，科学家们一直在为自己的错误自责。"},{"text":"Behind the scenes, they have been taking aim at someone else the accounting standard-setters.","explainMd":"1. **翻译**：结合全文的整体意思，这句话可以翻译为：幕后，他们一直在把矛头对准别人——会计准则制定者。\n\n2. **词汇和短语**：\n    - Behind the scenes：幕后\n    - taking aim at：把矛头对准\n    - someone else：别人\n    - the accounting standard-setters：会计准则制定者\n\n3. **句子结构**：这是一个简单的主动句，主语是\"they\"，谓语是\"have been taking aim at\"，宾语是\"someone else the accounting standard-setters\"。这里，\"Behind the scenes\"是副词短语，说明动作发生的环境。\n\n4. **语法**：这句话使用了现在完成进行时态（Present Perfect Continuous Tense），表示从过去某一时刻开始，一直延续到现在的动作或状态，可能会继续下去。\n\n5. **知识点总结**：\n    - 现在完成进行时态表示从过去某一时刻开始，一直延续到现在的动作或状态，可能会继续下去。\n    - \"take aim at\"是一个常用的短语，表示把矛头对准，针对某人或某事。\n    - \"behind the scenes\"是一个常用的短语，表示在幕后，即在公众视线之外的地方。\n\n6. **练习相似句子**（英文加中文翻译，一句）：\n    - \"Behind the scenes, they have been criticizing the government's policies.\"\n    - 翻译：在幕后，他们一直在批评政府的政策。"},{"text":"Their rules, moan the banks, have forced them to report enormous losses, and it’s just not fair.","explainMd":"1. **翻译**：结合全文的整体意思，这句话可以翻译为：银行抱怨说，这些规则迫使他们报告巨大的损失，这简直不公平。\n\n2. **词汇和短语**：\n    - Their rules：他们的规则\n    - moan the banks：银行抱怨\n    - have forced them：迫使他们\n    - to report enormous losses：报告巨大的损失\n    - it’s just not fair：这简直不公平\n\n3. **句子结构**：这是一个复杂句，主句是\"their rules have forced them to report enormous losses\"，并列句是\"it’s just not fair\"。\"moan the banks\"作为插入语放在主句中。\n\n4. **语法**：这句话的特点是把\"moan the banks\"作为插入语放在了句子中。插入语是插入在句子中间的，对句子主体部分进行补充说明或者修饰的语句或短语。\n\n5. **知识点总结**：\n    - 插入语是插入在句子中间的，对句子主体部分进行补充说明或者修饰的语句或短语。\n    - \"moan\"作为动词，常用来表示抱怨。\n\n6. **练习相似句子**（英文加中文翻译，一句）：\n    - \"Their policies, complain the citizens, have caused a lot of inconvenience, and it’s just not fair.\"\n    - 翻译：公民们抱怨说，他们的政策导致了许多不便，这简直不公平。"},{"text":"These rules say they must value some assets at the price a third party would pay, not the price managers and regulators would like them to fetch.","explainMd":"1. **翻译**：结合全文的整体意思，这句话可以翻译为：这些规定要求他们必须按第三方愿意支付的价格来估值一些资产，而不是管理人员和监管者希望它们能够达到的价格。\n\n2. **词汇和短语**：\n    - These rules：这些规定\n    - say：要求\n    - they must value some assets：他们必须估值一些资产\n    - at the price a third party would pay：按照第三方愿意支付的价格\n    - not the price managers and regulators would like them to fetch：而不是管理人员和监管者希望它们能够达到的价格\n\n3. **句子结构**：这是一个复杂句，主句是\"These rules say they must value some assets at the price a third party would pay\"，并列句是\"not the price managers and regulators would like them to fetch\"。\n\n4. **语法**：这句话主要使用了否定结构\"not...but...\"，表示强调。\n\n5. **知识点总结**：\n    - \"not...but...\"是一种常用的否定结构，用于强调。\n    - \"fetch\"一词在这里是\"达到\"的意思，常用于表示价格、数量等达到某个水平。\n\n6. **练习相似句子**（英文加中文翻译，一句）：\n    - \"The law says you must drive on the right side of the road, not the side you would prefer.\"\n    - 翻译：法律规定你必须在右侧行驶，而不是你更喜欢的那一侧。"}]},{"sentences":[{"text":"Unfortunately, banks’ lobbying now seems to be working.","explainMd":"1. **翻译**：结合全文的整体意思，这句话可以翻译为：不幸的是，银行的游说现在似乎起作用了。\n\n2. **词汇和短语**：\n    - Unfortunately：不幸的是\n    - banks’ lobbying：银行的游说\n    - now：现在\n    - seems to be：似乎是\n    - working：起作用\n\n3. **句子结构**：这是一个简单句，主语是\"banks’ lobbying\"，谓语是\"seems to be working\"，\"Unfortunately\"是副词，用于修饰整个句子。\n\n4. **语法**：此句使用了现在进行时的被动语态。\"seems to be working\"表示银行的游说似乎正在起作用，\"seems to be\"在此处用来表达一种尚未确认的可能性或看法。\n\n5. **知识点总结**：\n    - \"seems to be\"用于表示尚未确认的可能性或看法。\n    - \"lobbying\"是一个名词，表示游说或说服的行为。\n    - \"Unfortunately\"是副词，用于修饰整个句子，表示对某种状况的不满或遗憾。\n\n6. **练习相似句子**（英文加中文翻译，一句）：\n    - \"Unfortunately, the company's efforts to improve its reputation now seem to be failing.\"\n    - 翻译：不幸的是，公司提升其声誉的努力现在似乎失败了。"},{"text":"The details may be unknowable, but the independence of standard-setters, essential to the proper functioning of capital markets, is being compromised.","explainMd":"1. **翻译**：结合全文的整体意思，这句话可以翻译为：具体的细节可能无法知晓，但是对资本市场正常运作至关重要的制定标准者的独立性正在受到损害。\n\n2. **词汇和短语**：\n    - The details：具体的细节\n    - may be unknowable：可能无法知晓\n    - but：但是\n    - the independence of standard-setters：制定标准者的独立性\n    - essential to：对...至关重要\n    - the proper functioning of capital markets：资本市场的正常运作\n    - is being compromised：正在受到损害\n\n3. **句子结构**：这是一个复合句，主句是\"The details may be unknowable\"，并列句是\"but the independence of standard-setters ... is being compromised\"，\"essential to the proper functioning of capital markets\"是修饰\"the independence of standard-setters\"的定语从句。\n\n4. **语法**：这句话主要使用了被动语态，\"is being compromised\"表示制定标准者的独立性正在被侵犯。此外，\"may be\"用于表达可能性。\n\n5. **知识点总结**：\n    - \"may be\"用于表示可能性。\n    - \"essential to\"表示\"对...至关重要\"。\n    - \"is being compromised\"是被动语态，表示正在被侵犯。\n\n6. **练习相似句子**（英文加中文翻译，一句）：\n    - \"The process may be complex, but the integrity of the research, essential to the credibility of the findings, is being questioned.\"\n    - 翻译：虽然过程可能复杂，但对研究结果可信度至关重要的研究完整性正在受到质疑。"},{"text":"And, unless banks carry toxic assets at prices that attract buyers, reviving the banking system will be difficult.","explainMd":"1. **翻译**：结合全文的整体意思，这句话可以翻译为：除非银行能以吸引买家的价格持有有毒资产，否则复苏银行系统将会困难。\n\n2. **词汇和短语**：\n    - And：而且\n    - unless：除非\n    - banks：银行\n    - carry：持有，承担\n    - toxic assets：有毒资产，亦称不良资产、损失资产\n    - at prices that attract buyers：以吸引买家的价格\n    - reviving：复苏，恢复\n    - the banking system：银行系统\n    - will be difficult：将会困难\n\n3. **句子结构**：这是一个复合句，主句是\"reviving the banking system will be difficult\"，条件状语从句是\"unless banks carry toxic assets at prices that attract buyers\"。\n\n4. **语法**：这句话使用了unless引导的条件状语从句，表示\"除非...否则...\"的意思。同时，\"will be difficult\"用于表达未来的可能情况。\n\n5. **知识点总结**：\n    - \"unless\"引导的条件状语从句表示\"除非...否则...\"的意思。\n    - \"will be\"用于表示未来的可能情况。\n    - \"toxic assets\"是金融术语，指的是可能导致金融机构损失的资产。\n\n6. **练习相似句子**（英文加中文翻译，一句）：\n    - \"And, unless companies invest in green technologies, tackling climate change will be challenging.\"\n    - 翻译：而且，除非公司投资于绿色技术，否则应对气候变化将会充满挑战。"},{"text":"After a bruising encounter with Congress, America’s Financial Accounting Standards Board (FASB) rushed through rule changes.","explainMd":"1. **翻译**：结合全文的整体意思，这句话可以翻译为：在与国会的一场激烈交锋后，美国的金融会计准则委员会（FASB）匆忙通过了规则变更。\n\n2. **词汇和短语**：\n    - After：在...之后\n    - a bruising encounter：一场激烈的交锋\n    - with Congress：与国会\n    - America's Financial Accounting Standards Board (FASB)：美国的金融会计准则委员会\n    - rushed through：匆忙通过\n    - rule changes：规则变更\n\n3. **句子结构**：这是一个简单句，主要由主语（America's Financial Accounting Standards Board (FASB)）和谓语（rushed through rule changes）组成，句首的\"After a bruising encounter with Congress\"是时间状语从句，用于修饰主句的发生时间。\n\n4. **语法**：这句话使用了时间状语从句\"after a bruising encounter with Congress\"来修饰主句，表示主句中的动作是在时间状语从句描述的事件之后发生的。\n\n5. **知识点总结**：\n    - \"after\"引导的时间状语从句用于表示主句中的动作是在时间状语从句描述的事件之后发生的。\n    - \"rushed through\"是一个短语，表示\"匆忙地完成\"的意思。\n\n6. **练习相似句子**（英文加中文翻译，一句）：\n    - \"After a heated debate with the board, the CEO swiftly implemented policy changes.\"\n    - 翻译：在与董事会的一场激烈辩论后，首席执行官迅速实施了政策变更。"},{"text":"These gave banks more freedom to use models to value illiquid assets and more flexibility in recognizing losses on long-term assets in their income statements.","explainMd":"1. **翻译**：结合全文的整体意思，这句话可以翻译为：这些变更赋予了银行更大的自由，以使用模型对非流动资产进行估值，并在其收入报表中更灵活地确认长期资产的损失。\n\n2. **词汇和短语**：\n    - These：这些\n    - gave banks more freedom：给了银行更大的自由\n    - to use models：使用模型\n    - to value illiquid assets：对非流动资产进行估值\n    - and more flexibility：并且更灵活\n    - in recognizing losses：在确认损失方面\n    - on long-term assets：对于长期资产\n    - in their income statements：在他们的收入报表中\n\n3. **句子结构**：这是一个复合句，由两个并列的主要从句组成：\"These gave banks more freedom to use models to value illiquid assets\"和\"more flexibility in recognizing losses on long-term assets in their income statements\"，这两个从句之间用并列连词\"and\"连接。\n\n4. **语法**：这句话主要使用了并列句的结构，两个并列的主要从句都是以动词的形式（\"gave\"和\"recognizing\"）开始的，表示两个并列的动作或状态。\n\n5. **知识点总结**：\n    - 并列句的结构可以用来连接两个或者更多的从句，表示并列的动作或者状态。\n    - \"to use models to\"是一个结构，表示\"使用模型来……\"的意思，后面通常跟动词原形。\n\n6. **练习相似句子**（英文加中文翻译，一句）：\n    - \"This policy provides companies with more opportunities to invest in green technology and greater flexibility in managing their environmental impact.\"\n    - 翻译：这项政策为公司提供了更多投资绿色技术的机会，并在管理其环境影响方面提供了更大的灵活性。"},{"text":"Bob Herz, the FASB’s chairman, cried out against those who question our motives.","explainMd":"1. **翻译**：结合全文的整体意思，这句话可以翻译为：美国财务会计标准委员会（FASB）的主席鲍勃·赫兹，强烈反对那些质疑我们动机的人。\n\n2. **词汇和短语**：\n    - Bob Herz：鲍勃·赫兹（人名）\n    - the FASB’s chairman：美国财务会计标准委员会的主席\n    - cried out against：强烈反对\n    - those who：那些\n    - question our motives：质疑我们的动机\n\n3. **句子结构**：这是一个简单句，包含一个主语（Bob Herz, the FASB’s chairman）、一个谓词（cried out against）和一个宾语（those who question our motives）。\n\n4. **语法**：这句话的语法结构非常直接，主要使用了动词短语\"cry out against\"来表示强烈反对某人或某事，而\"those who question our motives\"是使用了定语从句来修饰那些人。\n\n5. **知识点总结**：\n    - \"cry out against\"是一个动词短语，表示强烈反对某人或某事。\n    - \"those who\"后面可以接定语从句，用来修饰\"those\"这个代词。\n\n6. **练习相似句子**（英文加中文翻译，一句）：\n    - \"The mayor, John Smith, spoke out against those who doubt the city's efforts to combat climate change.\"\n    - 翻译：市长约翰·史密斯对那些质疑城市应对气候变化努力的人发表了强烈的反对意见。"},{"text":"Yet bank shares rose and the changes enhance what one lobby group politely calls the use of judgment by management.","explainMd":"1. **翻译**：结合全文的整体意思，这句话可以翻译为：然而，银行股票却上涨了，而且这些改变增强了一个游说团体礼貌地称之为管理人员使用判断的行为。\n\n2. **词汇和短语**：\n    - Yet：然而\n    - bank shares：银行股票\n    - rose：上涨\n    - the changes：这些改变\n    - enhance：增强\n    - what one lobby group politely calls：一个游说团体礼貌地称之为\n    - the use of judgment by management：管理人员使用判断的行为\n\n3. **句子结构**：这是一个复合句。主句是\"Yet bank shares rose and the changes enhance...\"，宾语从句是\"what one lobby group politely calls the use of judgment by management\"。\n\n4. **语法**：这句话的语法结构主要使用了\"what\"引导的宾语从句。在这里，\"what\"作为连接词同时在从句中充当主语，引导了宾语从句\"what one lobby group politely calls the use of judgment by management\"。\n\n5. **知识点总结**：\n    - \"Yet\"用作副词，表示转折，通常用于引出与之前情况不同或出乎意料的事实。\n    - \"what\"可以用作连接词，引导宾语从句，并在从句中充当主语。\n\n6. **练习相似句子**（英文加中文翻译，一句）：\n    - \"Despite the controversy, the film's box office soared and the plot sparked what some critics politely referred to as a thought-provoking discussion.\"\n    - 翻译：尽管存在争议，但电影的票房却飙升，而且剧情引发了一些评论家礼貌地称之为引人深思的讨论。"}]},{"sentences":[{"text":"European ministers instantly demanded that the International Accounting Standards Board (IASB) do likewise.","explainMd":"1. **翻译**：结合全文的整体意思，这句话可以翻译为：欧洲的部长们立即要求国际会计准则委员会（IASB）也做同样的事情。\n\n2. **词汇和短语**：\n    - European ministers：欧洲的部长们\n    - instantly：立即\n    - demanded：要求\n    - that：引导的宾语从句连接词\n    - the International Accounting Standards Board (IASB)：国际会计准则委员会\n    - do likewise：做同样的事情\n\n3. **句子结构**：这是一个简单句，主语是\"European ministers\"，谓语是\"demanded\"，宾语是\"that the International Accounting Standards Board (IASB) do likewise\"。\n\n4. **语法**：这句话的语法结构主要使用了\"that\"引导的宾语从句。在这里，\"that\"作为连接词引导出宾语从句\"the International Accounting Standards Board (IASB) do likewise\"。\n\n5. **知识点总结**：\n    - \"demand that\"后面常常接一个宾语从句，表示\"要求……做……\"，在这个宾语从句中，常常使用虚拟语态，即：demand that + 主语 + (should) do……\n    - \"do likewise\"是一个常用的短语，表示\"做同样的事情\"。\n\n6. **练习相似句子**（英文加中文翻译，一句）：\n    - \"The teacher immediately demanded that the students stop chatting and focus on their studies.\"\n    - 翻译：老师立即要求学生们停止聊天，集中注意力学习。"},{"text":"The IASB says it does not want to act without overall planning, but the pressure to fold when it completes it reconstruction of rules later this year is strong.","explainMd":"1. **翻译**：结合全文的整体意思，这句话可以翻译为：国际会计准则委员会（IASB）表示，它不希望在没有全面规划的情况下行动，但在今年晚些时候完成规则重构时，屈服的压力非常强烈。\n\n2. **词汇和短语**：\n    - The IASB：国际会计准则委员会\n    - says：表示\n    - it does not want to act：它不希望行动\n    - without overall planning：没有全面规划\n    - but：但是\n    - the pressure to fold：屈服的压力\n    - when it completes its reconstruction of rules：当它完成规则的重构\n    - later this year：在今年晚些时候\n    - is strong：非常强烈\n\n3. **句子结构**：这是一个复合句，主句是\"The IASB says it does not want to act without overall planning\"，然后通过转折连词\"but\"连接了从句\"the pressure to fold when it completes it reconstruction of rules later this year is strong\"。\n\n4. **语法**：\n    - \"The IASB says\"是一个直接引语结构，\"it does not want to act without overall planning\"是直接引语。\n    - \"the pressure to fold when it completes its reconstruction of rules later this year\"是一个时间状语从句，其中\"when it completes its reconstruction of rules later this year\"是一个时间状语从句，修饰压力何时产生。\n\n5. **知识点总结**：\n    - \"want to do something\"是一个常用结构，表示\"想要做某事\"。\n    - \"without\"是一个介词，表示\"没有……\"。\n    - \"when\"引导的时间状语从句，表示\"当……时候\"。\n    - \"pressure to do something\"表示\"做某事的压力\"。\n\n6. **练习相似句子**（英文加中文翻译，一句）：\n    - \"The team says it does not want to play without a comprehensive strategy, but the pressure to participate in the game next month is strong.\"\n    - 翻译：团队表示，它们不希望在没有全面策略的情况下参赛，但下个月参加比赛的压力非常大。"},{"text":"Charlie McCreevy, a European commissioner, warned the IASB that it did not live in a political vacuum but in the real world and the Europe could yet develop different rules.","explainMd":"1. **翻译**：结合全文的整体意思，这句话可以翻译为：欧洲委员会的委员查理·麦克里维警告国际会计准则委员会（IASB），它并非生活在政治真空中，而是在现实世界中，而且欧洲可能会制定出不同的规则。\n\n2. **词汇和短语**：\n    - Charlie McCreevy：查理·麦克里维（人名）\n    - a European commissioner：欧洲委员会的委员\n    - warned：警告\n    - the IASB：国际会计准则委员会\n    - that it did not live in a political vacuum：它并非生活在政治真空中\n    - but in the real world：而是在现实世界中\n    - and the Europe could yet develop different rules：而且欧洲可能会制定出不同的规则\n\n3. **句子结构**：这是一个复合句，主句是\"Charlie McCreevy, a European commissioner, warned the IASB\"，然后通过引导词\"that\"连接了从句\"it did not live in a political vacuum but in the real world and the Europe could yet develop different rules\"。\n\n4. **语法**：\n    - \"Charlie McCreevy, a European commissioner, warned the IASB\"是一个直接引语结构，\"that it did not live in a political vacuum but in the real world and the Europe could yet develop different rules\"是宾语从句。\n    - \"but\"是一个转折连词，用来连接两个对立的概念，\"in a political vacuum\"和\"in the real world\"。\n\n5. **知识点总结**：\n    - \"warn somebody that\"是一个常用结构，表示\"警告某人……\"。\n    - \"live in\"是一个常用短语，表示\"生活在……\"。\n    - \"but\"是一个转折连词，用来连接两个对立的概念。\n\n6. **练习相似句子**（英文加中文翻译，一句）：\n    - \"The teacher, Mrs. Smith, warned the students that they did not live in an ideal world but in the real world and they should face reality.\"\n    - 翻译：教师史密斯女士警告学生们，他们并非生活在理想世界中，而是在现实世界中，他们应该面对现实。"}]},{"sentences":[{"text":"It was banks that were on the wrong planet, with accounts that vastly overvalued assets.","explainMd":"1. **翻译**：结合全文的整体意思，这句话可以翻译为：错误的是银行，他们的账目大大高估了资产价值。\n\n2. **词汇和短语**：\n    - It was banks：错误的是银行\n    - that were on the wrong planet：在错误的星球上（这里是比喻，意思是银行的行为或者思维方式与现实情况严重不符）\n    - with accounts：账目\n    - that vastly overvalued assets：大大高估了资产价值\n\n3. **句子结构**：这是一个包含了两个定语从句的复合句。主句是\"It was banks\"，接着是一个强调句型的定语从句\"that were on the wrong planet\"，然后是另一个定语从句\"that vastly overvalued assets\"。\n\n4. **语法**：\n    - \"It was banks that\"是一个强调句型，强调的是\"banks\"。\n    - \"that were on the wrong planet\"和\"that vastly overvalued assets\"都是定语从句，分别修饰\"banks\"和\"accounts\"。\n\n5. **知识点总结**：\n    - 强调句型\"It was...that...\"用于强调句子中的某个部分。\n    - \"with\"可以用来引导附加的信息。\n    - \"that\"可以引导定语从句，修饰先行词。\n\n6. **练习相似句子**（英文加中文翻译，一句）：\n    - \"It was the government that was on the wrong path, with policies that vastly underestimated the impact of the economic downturn.\"\n    - 翻译：错误的是政府，他们的政策大大低估了经济衰退的影响。"},{"text":"Today they argue that market prices overstate losses, because they largely reflect the temporary illiquidity of markets, not the likely extent of bad debts.","explainMd":"1. **翻译**：结合全文的整体意思，这句话可以翻译为：“如今，他们争论市场价格高估了损失，因为这更大程度上反映的是市场的暂时性流动性不足，而非坏账的可能规模。”\n\n2. **词汇和短语**：\n    - Today they argue：如今，他们争论\n    - that market prices overstate losses：市场价格高估了损失\n    - because they largely reflect the temporary illiquidity of markets：因为这更大程度上反映的是市场的暂时性流动性不足\n    - not the likely extent of bad debts：而非坏账的可能规模\n\n3. **句子结构**：这是一个复杂句。主句是\"Today they argue that market prices overstate losses\"，接着是一个因果状语从句\"because they largely reflect the temporary illiquidity of markets\"，并且这个从句中还包含一个并列结构\"not the likely extent of bad debts\"。\n\n4. **语法**：\n    - \"Today they argue that\"是一个宾语从句，\"that\"引导的是争论的内容。\n    - \"because\"引导的是原因状语从句，说明为什么市场价格高估了损失。\n    - \"not\"是对前面信息的否定，并列结构中的否定形式。\n\n5. **知识点总结**：\n    - \"argue that\"用于引导宾语从句，表示争论或者主张的内容。\n    - \"because\"引导原因状语从句，用于解释原因或者理由。\n    - 并列结构中的否定形式用于展示对比或者区别。\n\n6. **练习相似句子**（英文加中文翻译，一句）：\n    - \"Now they insist that the policy exaggerates the crisis, because it primarily reflects the temporary panic of the public, not the actual severity of the situation.\"\n    - 翻译：现在他们坚持认为这个政策夸大了危机，因为它主要反映的是公众的暂时性恐慌，而非实际情况的严重程度。"},{"text":"The truth will not be known for years.","explainMd":"1. **翻译**：结合全文的整体意思，这句话可以翻译为：“真相可能要过很多年才能揭晓。”\n\n2. **词汇和短语**：\n    - The truth：真相\n    - will not be known：不会被知道，不会揭晓\n    - for years：很多年\n\n3. **句子结构**：这是一个简单句，包含一个主语（The truth）和一个谓语（will not be known）以及一个时间状语（for years）。\n\n4. **语法**：\n    - \"will not be known\" 是一个简单的将来时被动语态。\"will\" 表示未来，\"be known\" 是被动语态，表示“被知道”或“被揭晓”。\n    - \"for years\" 是一个时间状语表达，表示某个动作的持续时间。\n\n5. **知识点总结**：\n    - 将来时被动语态用于表示在未来某个动作将被执行，强调行动的接受者。\n    - \"for + 时间\" 用于表示动作的持续时间。\n\n6. **练习相似句子**（英文加中文翻译，一句）：\n    - \"The results will not be seen for months.\"\n    - 翻译：结果可能要过好几个月才能看到。"},{"text":"But banks’ shares trade below their book value, suggesting that investors are skeptical.","explainMd":"1. **翻译**：结合全文的整体意思，这句话可以翻译为：“然而，银行的股票交易价格低于其账面价值，这表明投资者对此持怀疑态度。”\n\n2. **词汇和短语**：\n    - Banks' shares：银行的股票\n    - Trade below：交易价格低于\n    - Their book value：他们的账面价值\n    - Suggesting：暗示，表明\n    - That investors are skeptical：投资者持怀疑态度\n\n3. **句子结构**：这是一个复合句，主句是\"But banks' shares trade below their book value\"，它有一个从句\"suggesting that investors are skeptical\"，从句作为状语修饰主句。\n\n4. **语法**：\n    - \"Banks' shares trade below their book value\" 是一个简单的一般现在时句子，表示银行股票的交易价格低于其账面价值。\n    - \"suggesting\" 作为一个现在分词形式，用于引导状语从句，表示结果或原因。\n    - \"that investors are skeptical\" 是一个宾语从句，\"that\" 引导，表达投资者的怀疑态度。\n\n5. **知识点总结**：\n    - 一般现在时用于表达事实或常态。\n    - 现在分词可以用于引导状语从句，表达结果或原因。\n    - \"that\" 可以引导宾语从句，表示具体的内容或观点。\n\n6. **练习相似句子**（英文加中文翻译，一句）：\n    - \"The product's sales dip below expectations, indicating that customers are not satisfied.\"\n    - 翻译：该产品的销售额低于预期，这表明客户并不满意。"},{"text":"And dead markets partly reflect the paralysis of banks which will not sell assets for fear of booking losses, yet are reluctant to buy all those supposed bargains.","explainMd":"1. **翻译**：结合全文的整体意思，这句话可以翻译为：“并且，死寂的市场部分反映了银行的瘫痪状态，他们因为害怕确认损失而不愿出售资产，同时也不愿购买那些所谓的便宜货。”\n\n2. **词汇和短语**：\n    - Dead markets：死寂的市场\n    - Partly reflect：部分反映\n    - The paralysis of banks：银行的瘫痪状态\n    - Which will not sell assets：不愿出售资产\n    - For fear of booking losses：出于害怕确认损失的原因\n    - Yet are reluctant to buy：却又不愿购买\n    - All those supposed bargains：所有那些所谓的便宜货\n\n3. **句子结构**：这是一个复杂句。主句是 \"And dead markets partly reflect the paralysis of banks\"，它包含两个由\"which\"引导的定语从句，分别是\"which will not sell assets for fear of booking losses\"和\"which are reluctant to buy all those supposed bargains\"。\n\n4. **语法**：\n    - \"Dead markets partly reflect the paralysis of banks\" 是一个简单句，使用了一般现在时态。\n    - \"Which\" 在此处作为关系代词引导定语从句，修饰\"banks\"。\n    - \"For fear of\" 是一个固定短语，表示\"因为害怕……\"。\n\n5. **知识点总结**：\n    - 一般现在时用于表达事实或常态。\n    - \"Which\" 可以作为关系代词引导定语从句，修饰先行词。\n    - \"For fear of\" 是一个固定短语，表示\"因为害怕……\"。\n\n6. **练习相似句子**（英文加中文翻译，一句）：\n    - \"And the declining customer satisfaction partly shows the company's problems, which has not improved its products for fear of change, yet is hesitant to lower prices.\"\n    - 翻译：而下降的客户满意度部分反映了公司的问题，它因为害怕变革而没有改进其产品，却又不愿降低价格。"}]},{"sentences":[{"text":"To get the system working again, losses must be recognized and dealt with.","explainMd":"1. **翻译**：结合全文的整体意思，这句话可以翻译为：“要想使系统再次运转起来，必须认可和处理损失。”\n\n2. **词汇和短语**：\n    - To get the system working again：使系统再次运转起来\n    - Losses：损失\n    - Must be recognized：必须被认可\n    - And dealt with：并且处理\n\n3. **句子结构**：这是一个简单句，主语是\"losses\"，谓语动词是\"must be recognized and dealt with\"。\n\n4. **语法**：\n    - 这个句子使用了被动语态，表明\"损失\"必须被其他人或事物认可和处理。\n    - 在这里，\"and\" 连接了两个并列的动词短语\"recognized\" 和 \"dealt with\"。\n\n5. **知识点总结**：\n    - 被动语态用于强调动作的受体或者当动作的执行者不明确或不重要时。\n    - \"And\" 可以用来连接两个并列的词、短语或句子。\n\n6. **练习相似句子**（英文加中文翻译，一句）：\n    - \"To achieve the project goal, risks must be identified and mitigated.\"\n    - 翻译：为了实现项目目标，风险必须被识别和减轻。"},{"text":"America’s new plan to buy up toxic assets will not work unless banks mark assets to levels which buyers find attractive.","explainMd":"1. **翻译**：结合全文的整体意思，这句话可以翻译为：“除非银行将资产标记至买家觉得吸引的水平，否则美国购买有毒资产的新计划将无法生效。”\n\n2. **词汇和短语**：\n    - America's new plan：美国的新计划\n    - To buy up toxic assets：购买有毒资产\n    - Will not work：无法生效\n    - Unless：除非\n    - Banks mark assets：银行标记资产\n    - To levels which buyers find attractive：至买家觉得吸引的水平\n\n3. **句子结构**：这是一个复合句，主句是\"America's new plan to buy up toxic assets will not work\"，条件状语从句是\"unless banks mark assets to levels which buyers find attractive\"。\n\n4. **语法**：\n    - 在这个句子中，\"unless\" 引导的是一个条件状语从句，表示“除非……否则……”的意思。\n    - \"which\" 在这里是一个关系代词，引导了一个定语从句，用于修饰\"levels\"。\n\n5. **知识点总结**：\n    - \"Unless\" 可以用于引导条件状语从句，表示“除非……否则……”的意思。\n    - 关系代词 \"which\" 可以引导定语从句，用于修饰先行词。\n\n6. **练习相似句子**（英文加中文翻译，一句）：\n    - \"The project will not succeed unless team members cooperate to a degree that all stakeholders find satisfactory.\"\n    - 翻译：除非团队成员达到所有利益相关者都认为满意的协作程度，否则这个项目将无法成功。"},{"text":"Successful markets require independent and even combative standard-setters.","explainMd":"1. **翻译**：结合全文的整体意思，这句话可以翻译为：“成功的市场需要独立甚至有时需要与众不同的标准设定者。”\n\n2. **词汇和短语**：\n    - Successful markets：成功的市场\n    - Require：需要\n    - Independent：独立的\n    - And even combative：甚至有时需要与众不同的\n    - Standard-setters：标准设定者\n\n3. **句子结构**：这是一个简单句，主语是\"successful markets\"，谓语动词是\"require\"，宾语是\"independent and even combative standard-setters\"。\n\n4. **语法**：\n    - 这个句子中，\"even\" 是一个副词，用来强调\"combative\"，表示即使在一些情况下，可能需要标准设定者与众不同。\n    - \"And\" 在这里是一个并列连词，连接了两个形容词\"independent\" 和 \"combative\"。\n\n5. **知识点总结**：\n    - \"Even\" 作为副词，可以用来强调紧跟其后的词或短语。\n    - \"And\" 作为并列连词，可以连接两个或多个同类的单词或短语。\n\n6. **练习相似句子**（英文加中文翻译，一句）：\n    - \"Effective teams require independent and even innovative members.\"\n    - 翻译：有效的团队需要独立甚至有时需要创新的成员。"},{"text":"The FASB and IASB have been exactly that, cleaning up rules on stock options and pensions, for example, against hostility interests.","explainMd":"1. **翻译**：结合全文的整体意思，这句话可以翻译为：“FASB和IASB就是这样，例如，他们在面对对立的利益时，清理了股票期权和养老金的规则。”\n\n2. **词汇和短语**：\n    - The FASB and IASB：美国财务会计准则委员会和国际会计准则委员会\n    - Have been exactly that：就是这样\n    - Cleaning up：清理\n    - Rules：规则\n    - On stock options and pensions：关于股票期权和养老金\n    - For example：例如\n    - Against：对抗\n    - Hostility interests：对立的利益\n\n3. **句子结构**：这是一个复杂句，主句是\"The FASB and IASB have been exactly that\"，然后是两个由\"cleaning up\"和\"against\"引导的短语，分别作为谓语的补足语和状语。\n\n4. **语法**：\n    - \"Have been\" 是现在完成进行时的谓语，表示过去开始的动作一直持续到现在，并可能继续下去。\n    - \"Against\" 在这里是介词，引导介词短语\"against hostility interests\"，作为状语表示动作的对立方。\n    - \"For example\" 是插入语，用来引出例子。\n\n5. **知识点总结**：\n    - 现在完成进行时表示过去开始的动作一直持续到现在，并可能继续下去。\n    - 介词 \"against\" 可引导介词短语，表示对立或反对。\n    - \"For example\" 是插入语，常用来引出例子。\n\n6. **练习相似句子**（英文加中文翻译，一句）：\n    - \"The team has been doing just that, for example, working on project improvements against numerous challenges.\"\n    - 翻译：团队就是这样，例如，在面临众多挑战"},{"text":"But by giving in to critics now they are inviting pressure to make more concessions.","explainMd":"1. **翻译**：结合全文的整体意思，这句话可以翻译为：“但是现在向批评者妥协，他们正引发更多的压力以做出更多的让步。”\n\n2. **词汇和短语**：\n    - But：但是\n    - By giving in to：向……妥协\n    - Critics：批评者\n    - Now：现在\n    - They：他们（指的是FASB和IASB）\n    - Are inviting：正引发\n    - Pressure：压力\n    - To make：做出\n    - More concessions：更多的让步\n\n3. **句子结构**：这是一个简单句，主语是\"They\"，谓语是\"are inviting pressure\"，然后\"to make more concessions\"是短语，作为压力的目的描述。\n\n4. **语法**：\n    - \"By giving in to\" 是一个介词短语，表示原因。\n    - \"Are inviting\" 是现在进行时，表示正在发生的动作。\n    - \"To make\" 是不定式，用来表示目的。\n\n5. **知识点总结**：\n    - \"By doing\" 结构用来表示动作的原因。\n    - 现在进行时表示正在进行的动作。\n    - 不定式 \"to do\" 可以用来表示目的。\n\n6. **练习相似句子**（英文加中文翻译，一句）：\n    - \"By agreeing to the demands now, they are inviting more challenges in the future.\"\n    - 翻译：通过现在同意这些要求，他们在未来引发了更多的挑战。"}]}],"title":""}