{"translate":"","paragraphs":[{"sentences":[{"text":"Many Americans regard the jury system as a concrete expression of crucial democratic values, including the principles that all citizens who meet minimal qualifications of age and literacy are equally competent to serve on juries; that jurors should be selected randomly from a representative cross section of the community; that no citizen should be denied the right to serve on a jury on account of race, religion, sex, or national origin; that defendants are entitled to trial by their peers; and that verdicts should represent the conscience of the community and not just the letter of the law.","explainMd":"**1. 翻译**\n\n许多美国人认为，陪审团制度是重要的民主价值观的具体体现，这些价值观包括以下原则：所有满足最低年龄和识字资格的公民都有同样的能力担任陪审团成员；陪审员应随机从社区的代表性横截面中选出；任何公民都不应因种族、宗教、性别或国籍而被剥夺在陪审团服务的权利；被告有权由其同胞审判；判决应代表社区的良心，而不仅仅是法律的字面意义。\n\n**2. 词汇和短语**\n\n- Many Americans: 许多美国人\n- Regard as: 把...视为\n- Jury system: 陪审团制度\n- Concrete expression: 具体体现\n- Crucial democratic values: 重要的民主价值观\n- Minimal qualifications: 最低资格\n- Serve on juries: 服务于陪审团\n- Selected randomly: 随机选取\n- Representative cross section: 代表性横截面\n- Denied the right: 被剥夺权利\n- Trial by their peers: 由其同胞审判\n- Verdicts: 判决\n- Conscience of the community: 社区的良心\n- The letter of the law: 法律的字面意义\n\n**3. 句子结构**\n\n这是一个复杂句，其结构为：主句 + 并列句。具体分析如下：\n\n- 主句：Many Americans regard the jury system as a concrete expression of crucial democratic values，这是句子的主要部分，表达的是许多美国人将陪审团制度视为重要的民主价值的具体体现这一观点。\n- 并列句：This includes the principles that...，这部分并列于主句，进一步列出了一些具体的原则，如所有满足最低年龄和识字资格的公民都有同样的能力服务于陪审团，陪审员应随机从社区的代表性横截面中选出等。\n\n**4. 语法分析**\n\n这个句子使用了比较复杂的句型，包括主从复合句和并列句。\"that\"引导的是宾语从句，后面的一系列并列句则是进一步解释和补充这个宾语从句的内容。\n\n**5. 知识点总结**\n\n1. **并列句的使用**：在这个句子中，\"that\"引导的一系列并列句是用来解释和补充上文提到的\"crucial democratic values\"的具体内容。并列句可以帮助我们更详细、更清晰地表达一个观点或描述一个情况。\n2. **宾语从句的使用**：在这个句子中，\"that\"引导的是宾语从句，用来解释和说明主句中的对象——\"crucial democratic values\"。宾语从句是一个非常重要的句型，它让我们的句子更复杂，表达的内容也更丰富。\n\n**6. 练习相似句子**\n\nMany scholars view the free dissemination of knowledge as a fundamental value of education, which includes: all individuals meeting the minimum age and cultural standards have the same right to education; educational resources should be equally distributed among all members of the community; no one should be denied the right to education because of their race, religion, sex, or nationality; everyone has the right to learn in an equal and fair environment; the goal of education should be to elevate the overall quality of the community, not just to pursue academic scores.\n\n许多学者将知识的自由传播视为教育的基本价值，这包括：所有满足最低年龄和文化水平的人都有同样的权利接受教育；教育资源应从社区的全体成员中平等分配；任何人都不应因其种族、宗教、性别或国籍而被剥夺接受教育的权利；每个人都有权在平等、公正的环境中学习；教育的目标应该是提升社区的整体素质，而不仅仅是追求学术成绩。"},{"text":"The jury is also said to be the best surviving example of direct rather than representative orient.","explainMd":"**1. 翻译（直接翻译中文）**：\n\n\"陪审团也被认为是直接民主而非代表性民主的最佳存续示例。\"\n\n**2. 词汇和短语:**\n\n- Jury: 陪审团\n- Said: 被认为\n- Best surviving example: 最佳存续示例\n- Direct: 直接的\n- Representative: 代表性的\n- Orient: 方向，取向\n\n**3. 句子结构分析：**\n\n这是一个简单句，其主谓宾结构如下：\n\n- 主语 (Subject): The jury (陪审团)\n- 谓语 (Verb): is said to be (被认为是)\n- 宾语 (Object): the best surviving example of direct rather than representative orient (直接民主而非代表性民主的最佳存续示例)\n\n**4. 语法分析：**\n\n这个句子主要使用了被动语态，\"is said to be\" 表示“被认为是”。被动语态在英语中常用于强调动作的接受者(这里是陪审团)，而不是动作的执行者。\n\n**5. 知识点总结：**\n\n1. **被动语态的使用**：在这句话中，采用了被动语态 \"is said to be\"，把焦点放在了动作的接收者——陪审团上，而不是动作的执行者。被动语态通常在我们更关心动作的对象，而不是动作的执行者时使用。例如：\"The book was written by Mark Twain.\"（这本书是马克·吐温写的）。\n\n2. **形容词和副词的比较级使用**：“best”是“good”的最高级形式，用于三个或更多的事物之间进行比较。例如：\"She is the best student in the class.\"（她是班级中最好的学生）。\n\n3. **\"rather than\" 的使用**：\"rather than\" 是一个并列连词，用于表示对比或替代。在这句话中，\"direct rather than representative\" 描述了两种不同的民主类型——直接民主和代表性民主，并通过 \"rather than\" 表达了对这两者的对比。\n\n**6. 练习相似句子**：\n\n\"The town meeting is considered the purest form of direct democracy, where citizens participate in decision-making directly rather than through elected representatives.\"\n（镇会议被认为是最纯粹的直接民主形式，公民直接参与决策，而不是通过选举代表来进行。）"},{"text":"In a direct democracy, citizens take turns governing themselves, rather than electing representatives to govern for them.","explainMd":"**1. 翻译（直接翻译中文）**：\n\n\"在直接民主制度下，公民轮流自我治理，而不是选举代表为他们治理。\"\n\n**2. 词汇和短语:**\n\n- Direct democracy: 直接民主\n- Citizens: 公民\n- Take turns: 轮流\n- Governing: 治理\n- Themselves: 自己\n- Rather than: 而不是\n- Electing: 选举\n- Representatives: 代表\n\n**3. 句子结构分析：**\n\n这是一个复合句，其结构为：主句 + 并列句。具体分析如下：\n\n主句：In a direct democracy, citizens take turns governing themselves，这是句子的主要部分，表达的是在直接民主制度下，公民轮流自我治理这一观点。\n\n并列句：rather than electing representatives to govern for them，这部分并列于主句，进一步提出了公民不是选举代表为他们治理这一观点。\n\n主语 (Subject): Citizens (公民)\n谓语 (Verb): Take turns governing (轮流治理)\n宾语 (Object): Themselves (自己)\n\n**4. 语法分析：**\n\n这个句子主要使用了现在时态，\"take turns\" 表示“轮流”。此外，\"rather than\" 用于表示对比或替代，强调在直接民主制度下，公民选择自我治理，而不是选择选举代表。\n\n**5. 知识点总结：**\n\n1. **现在时态的使用**：在这句话中，采用了现在时态 \"take turns\"，描述了一个常态或习惯性的行为——公民在直接民主制度下轮流治理自己。现在时态通常用于表达现在的状态，事实，习惯或常规行为。例如：\"I usually get up at 7 a.m.\"（我通常早上7点起床）。\n\n2. **\"rather than\" 的使用**：\"rather than\" 是一个并列连词，用于表示对比或替代。在这句话中，\"governing themselves rather than electing representatives\" 描述了公民在直接民主制度下的两种可能选择——自我治理和选举代表，并通过 \"rather than\" 表达了对这两者的对比。\n\n3. **\"take turns\" 的使用**：\"take turns\" 是一个常用的短语，用于表达两个或更多的人或事物交替进行某种活动。例如：\"We take turns cooking dinner.\"（我们轮流煮晚餐）。\n\n**6. 练习相似句子(英文加中文翻译，一句)**：\n\n\"In a cooperative system, members take turns leading themselves, rather than selecting a permanent leader to guide them.\"（在合作制度中，成员轮流领导自己，而不是选择一个永久的领导来指导他们。）"}]},{"sentences":[{"text":"But as recently as in 1968, jury selection procedures conflicted with these democratic ideals.","explainMd":"**1. 翻译：**\n\n\"但就在1968年，陪审团选拔程序与这些民主理想相冲突。\"\n\n**2. 词汇和短语：**\n\n- But: 但是\n- As recently as: 就在...时间\n- In 1968: 在1968年\n- Jury selection: 陪审团选拔\n- Procedures: 程序\n- Conflicted with: 与...冲突\n- Democratic ideals: 民主理想\n\n**3. 句子结构：**\n\n这是一个简单句，其结构为：主语 + 谓语 + 宾语。具体分析如下：\n\n主语：Jury selection procedures （陪审团选拔程序）\n谓语：Conflicted with （与...冲突）\n宾语：Democratic ideals （民主理想）\n\n**4. 语法分析：**\n\n这个句子使用了过去时态 \"conflicted\" 来描述在过去某个时间点发生的事件。\"As recently as\" 是一个常用的短语，用于表示某件事情发生的时间距离现在非常近。在这个句子中，\"As recently as in 1968\" 指的是在不远的过去，也就是1968年。\n\n**5. 知识点总结：**\n\n1. **过去时态的使用**：这句话使用了过去时态 \"conflicted\" 来描述在1968年发生的事情。过去时态通常用于描述在过去某一时间点发生的动作或状态。例如：\"I visited the museum last week.\"（我上周去参观了博物馆）。\n\n2. **\"As recently as\" 的使用**：\"As recently as\" 是一个常用的表达方式，用于强调某件事情发生的时间距离现在非常近。例如：\"As recently as last year, he was still working.\"（就在去年，他还在工作）。\n\n**6. 练习相似句子：**\n\n\"But as recently as in 2000, the education policies conflicted with these modern teaching methods.\"（但就在2000年，教育政策与这些现代教学方法相冲突。）"},{"text":"In some states, for example, jury duty was limited to persons of supposedly superior intelligence, education, and moral character.","explainMd":"**1. 翻译：**\n\n\"在一些州，例如，陪审团的职责仅限于那些被认为具有优越智力，教育和道德品质的人。\"\n\n**2. 词汇和短语：**\n\n- In some states: 在一些州\n- For example: 例如\n- Jury duty: 陪审团的职责\n- Was limited to: 仅限于\n- Persons: 人\n- Of supposedly: 被认为\n- Superior intelligence: 优越智力\n- Education: 教育\n- And moral character: 和道德品质\n\n**3. 句子结构：**\n\n这是一个简单句子，其结构为：主语 + 谓语 + 宾语。具体分析如下：\n\n- 主语：Jury duty (陪审团的职责)\n- 谓语：Was limited to (仅限于)\n- 宾语：Persons of supposedly superior intelligence, education, and moral character (被认为具有优越智力，教育和道德品质的人)\n\n**4. 语法分析：**\n\n这个句子使用了被动语态 \"Was limited to\" 来描述陪审团的职责在某些州是如何被限制的。在被动语态中，行动的接受者（陪审团的职责）成为句子的主语。\n\n**5. 知识点总结：**\n\n1. **被动语态的使用**：在这个句子中，\"Was limited to\" 是被动语态的形式，用来强调行动的接受者而不是行动的发起者。被动语态常常用在行动的发起者不重要或者不明确的情况下。例如：\"The cake was eaten.\"（蛋糕被吃了）。\n\n2. **\"Of\" 的使用**：在这个句子中，\"of\" 用来表示属于关系，连接主词和其属性。例如：\"A man of courage\"（一个有勇气的人）。\n\n**6. 练习相似句子：**\n\n\"In some schools, for example, the right to vote was limited to persons of supposedly superior academic performance and social behavior.\"（在一些学校，例如，投票权仅限于那些被认为具有优越学术表现和社会行为的人。）"},{"text":"Although the Supreme Court of the United States had prohibited intentional racial discrimination in jury selection as early as the 1880 case of Strauder v. West Virginia, the practice of selecting so-called elite or blue-ribbon juries provided a convenient way around this and other anti-discrimination laws.","explainMd":"**1. 翻译：**\n\n\"尽管美国最高法院在1880年的Strauder诉西弗吉尼亚州案件中就已禁止在陪审团选拔中故意进行种族歧视，但选择所谓的精英或蓝丝带陪审团的做法却为绕过这项和其他反歧视法律提供了便利。\"\n\n**2. 词汇和短语：**\n\n- Although: 尽管\n- The Supreme Court of the United States: 美国最高法院\n- Had prohibited: 已经禁止\n- Intentional racial discrimination: 故意的种族歧视\n- Jury selection: 陪审团选拔\n- As early as: 早在\n- Case: 案件\n- The practice of selecting: 选择的做法\n- So-called: 所谓的\n- Elite or blue-ribbon juries: 精英或蓝丝带陪审团\n\n**3. 句子结构：**\n\n这是一个复杂句，其结构为：主句 + 从句。具体分析如下：\n\n主句：The practice of selecting so-called elite or blue-ribbon juries provided a convenient way around this and other anti-discrimination laws（选择所谓的精英或蓝丝带陪审团的做法为绕过这项和其他反歧视法律提供了便利）。\n\n从句：Although the Supreme Court of the United States had prohibited intentional racial discrimination in jury selection as early as the 1880 case of Strauder v. West Virginia（尽管美国最高法院在1880年的Strauder诉西弗吉尼亚州案件中就已禁止在陪审团选拔中故意进行种族歧视）。从句用来表达虽然有某种情况，但是主句的情况仍然存在。\n\n**4. 语法分析：**\n\n这个句子使用了虽然……但是……的结构（Although...，...），表达的是一种让步关系。在这个句子中，\"Although\" 引导的从句是让步状语从句，表示的是尽管有某种情况或事实，但是主句的情况仍然存在。\n\n**5. 知识点总结：**\n\n1. **虽然……但是……的结构**：这种结构用来表达一个让步关系，即尽管有某种事实或情况存在，但是主句的情况仍然存在。例如：\"Although it was raining, they decided to go for a walk.\"（虽然在下雨，但他们决定去散步）。\n\n2. **The Supreme Court of the United States**：这是美国的最高法院，具有解释和裁决美国联邦法律的最终权力。在这个句子中，最高法院在1880年的Strauder诉西弗吉尼亚州案件中禁止了在陪审团选拔中故意进行种族歧视。\n\n3. **Elite or blue-ribbon juries**：这是一种特殊的陪审团，通常由被认为具有高于一般公众的智力，教育或专业水平的人组成。在这个句子中，这种陪审团的选择为绕过反歧视法提供了便利。\n\n**6. 练习相似句子：**\n\n\"Although the law had prohibited discrimination in employment as early as the 1964 case of Jones v. Mayer, the practice of hiring so-called elite employees provided a convenient way around this and other anti-discrimination laws.\"（尽管法律在1964年的Jones诉Mayer案件中就已禁止就业中的歧视，但雇佣所谓的精英员工的做法却为绕过这项和其他反歧视法律提供了便利。）"}]},{"sentences":[{"text":"The system also failed to regularly include women on juries until the mid-20th century.","explainMd":"**1. 翻译：**\n\n\"这个系统直到20世纪中期之前，都未能定期地在陪审团中包括女性。\"\n\n**2. 词汇和短语：**\n\n- The system: 这个系统\n- Failed to: 未能\n- Regularly: 定期地\n- Include: 包括\n- On juries: 在陪审团中\n- The mid-20th century: 20世纪中期\n\n**3. 句子结构：**\n\n这是一个简单句，其结构为：主语 + 谓语 + 宾语。具体分析如下：\n\n- 主语：The system（这个系统）\n- 谓语：Failed to regularly include（未能定期地包括）\n- 宾语：Women on juries（在陪审团中的女性）\n- 时间状语：Until the mid-20th century（直到20世纪中期）\n\n**4. 语法分析：**\n\n这个句子使用了\"failed to\"这个短语来表达\"未能\"的意思，同时使用了时间状语\"until\"来表达这种状况持续到何时为止。\n\n**5. 知识点总结：**\n\n1. **\"Failed to\"的使用**：这个短语用来表达\"未能\"或\"没有做到\"的意思。在这个句子中，\"The system failed to regularly include women on juries\"（这个系统未能定期地在陪审团中包括女性），表达的是这个系统没有成功地做到定期地在陪审团中包括女性。\n\n2. **时间状语的使用**：在句子中，时间状语用来表达动作或状态发生的时间。在这个句子中，\"until the mid-20th century\"（直到20世纪中期）用来表达这种状况持续到20世纪中期为止。\n\n**6. 练习相似句子：**\n\n\"The company failed to regularly include women in leadership positions until the early 21st century.\"（这个公司直到21世纪初才开始定期在领导岗位上包括女性。）"},{"text":"Although women first served on state juries in Utah in 1898, it was not until the 1940s that a majority of states made women eligible for jury duty.","explainMd":"**1. 翻译：**\n\n\"尽管女性最早在1898年的犹他州开始在州陪审团中服役，但直到20世纪40年代，大多数州才让女性有资格担任陪审员。\"\n\n**2. 词汇和短语：**\n\n- First served: 最早开始服役\n- On state juries: 在州陪审团中\n- Utah: 犹他州\n- It was not until: 直到......才\n- The 1940s: 20世纪40年代\n- That a majority of states: 大多数州\n- Made women eligible: 让女性有资格\n- For jury duty: 担任陪审员\n\n**3. 句子结构：**\n\n这是一个复杂句，其结构为：从句 + 主句。具体分析如下：\n\n- 从句: \"Although women first served on state juries in Utah in 1898\"（尽管女性最早在1898年的犹他州开始在州陪审团中服役）\n- 主句: \"It was not until the 1940s that a majority of states made women eligible for jury duty\"（直到20世纪40年代，大多数州才让女性有资格担任陪审员）\n\n**4. 语法分析：**\n\n本句使用了\"Although\"引导的让步状语从句，表达尽管有某种情况，但还存在另一种情况。\"It was not until...\"的结构用来强调某件事情发生的时间较晚。\n\n**5. 知识点总结：**\n\n1. **\"Although\"的使用**：这个连词用来引导让步状语从句，表达尽管存在某种情况，但主句所述的情况仍然存在或发生。例如：\"Although it was raining, they decided to go out.\"（尽管下雨，他们还是决定出去。）\n\n2. **\"It was not until...\"的使用**：这个结构用来强调某件事情发生的时间较晚。例如：\"It was not until 10pm that he arrived home.\"（他直到晚上十点才到家。）\n\n**6. 练习相似句子：**\n\n\"Although women first got the right to vote in New Zealand in 1893, it was not until the early 20th century that a majority of countries granted women suffrage.\"（尽管女性最早在1893年的新西兰获得了投票权，但直到20世纪初，大多数国家才给予女性选举权。）"},{"text":"Even then several states automatically exempted women from jury duty unless they personally asked to have their names included on the jury list.","explainMd":"**1. 翻译：**\n\n\"即使如此，有几个州会自动让女性免除陪审团的职责，除非她们主动要求将她们的名字加入陪审团名单。\"\n\n**2. 词汇和短语：**\n\n- Even then: 即使如此\n- Several states: 几个州\n- Automatically exempted: 自动免除\n- Women: 女性\n- From jury duty: 陪审团的职责\n- Unless: 除非\n- They personally: 她们主动\n- Asked to: 要求\n- Have their names included: 将她们的名字加入\n- On the jury list: 陪审团名单\n\n**3. 句子结构：**\n\n这是一个复杂句，其结构为：主句 + 条件状语从句。具体分析如下：\n\n- 主句: \"Even then several states automatically exempted women from jury duty\"（即使如此，有几个州会自动让女性免除陪审团的职责）\n- 条件状语从句: \"unless they personally asked to have their names included on the jury list\"（除非她们主动要求将她们的名字加入陪审团名单）\n\n**4. 语法分析：**\n\n本句使用了\"unless\"引导的条件状语从句，表达如果不满足某种条件，那么主句所述的情况就会发生。\"Even then\"在这里用于强调即使在特定的情况下，主句所述的情况仍然存在。\n\n**5. 知识点总结：**\n\n1. **\"Unless\"的使用**：这个连词用来引导条件状语从句，表达如果不满足某种条件，那么主句所述的情况就会发生。例如：\"You will fail the exam unless you study hard.\"（除非你努力学习，否则你会考试不及格。）\n\n2. **\"Even then\"的使用**：这个短语用于强调即使在特定的情况下，主句所述的情况仍然存在。例如：\"Even then, he refused to admit his mistake.\"（即使在那种情况下，他仍然拒绝承认他的错误。）\n\n**6. 练习相似句子：**\n\n\"Even then, many companies would not hire women for certain positions, unless they had specific qualifications or experiences.\"（即使如此，很多公司仍然不会聘请女性担任某些职位，除非她们具有特定的资格或经验。）"},{"text":"This practice was justified by the claim that women were needed at home, and it kept juries unrepresentative of women through the 1960s.","explainMd":"**1. 翻译：**\n\n\"这种做法是通过声称女性在家中需要，这使得陪审团在20世纪60年代前一直未能代表女性的观点来进行辩护的。\"\n\n**2. 词汇和短语：**\n\n- Justified: 辩护\n- Claim: 声称\n- Women: 女性\n- Needed at home: 在家中需要\n- Kept: 保持\n- Juries: 陪审团\n- Unrepresentative: 未能代表\n- Through: 到，直到\n\n**3. 句子结构：**\n\n这是一个复杂句，其结构为：主句 + 宾语从句。具体分析如下：\n\n- 主句： \"This practice was justified\"（这种做法被辩护）\n- 宾语从句： \"by the claim that women were needed at home, and it kept juries unrepresentative of women through the 1960s.\"（通过声称女性在家中需要，并且这使得陪审团在20世纪60年代前一直未能代表女性的观点）\n\n**4. 语法分析：**\n\n本句使用了\"by\"引导的宾语从句，表达这种做法是如何被辩护的。\"and\"连接两个并列的子句，第二个子句\"it kept juries unrepresentative of women through the 1960s\"进一步描述了这种做法的影响。\n\n**5. 知识点总结：**\n\n1. **\"Justified\"的使用**：这个单词用来表达一种行为或做法是如何被辩护或被说明为合理的。例如：\"His actions were justified by the circumstances.\"（他的行为由情况所辩护。）\n\n2. **\"Claim\"的使用**：这个单词用来表达一种主张或声称。例如：\"She made a claim that she had seen the incident.\"（她声称她看见了那次事件。）\n\n3. **\"Keep ... unrepresentative\"的使用**：这个短语用来表达一种状态的持续，即使得某物或某人未能代表某种观点或群体。例如：\"The policy kept the government unrepresentative of the population's diversity.\"（这项政策使政府不能代表人口的多样性。）\n\n**6. 练习相似句子：**\n\n\"This practice was justified by the belief that children were better off at home, and it kept schools unrepresentative of the entire age group until the late 19th century.\"（这种做法是通过信仰辩护的，即孩子们在家中会更好，并且这使得学校在19世纪晚期前一直未能代表整个年龄组。）"}]},{"sentences":[{"text":"In 1968, the Congress of the United States passed the Jury Selection and Service Act, ushering in a new era of democratic reforms for the jury.","explainMd":"**1. 翻译：**\n\n\"1968年，美国国会通过了《陪审团选拔与服务法》，为陪审团制度引入了新的民主改革时代。\"\n\n**2. 词汇和短语：**\n\n- Usher in: 开启，引领\n- Era: 时代\n- Democratic reforms: 民主改革\n- Jury: 陪审团\n- Congress of the United States: 美国国会\n- Jury Selection and Service Act: 陪审团选拔与服务法\n\n**3. 句子结构：**\n\n这是一个简单句，其结构为：主语 + 谓语 + 宾语。具体分析如下：\n\n- 主语： \"The Congress of the United States\"（美国国会）\n- 谓语： \"passed the Jury Selection and Service Act, ushering in a new era of democratic reforms for the jury\"（通过了《陪审团选拔与服务法》，为陪审团制度引入了新的民主改革时代）\n- 宾语： 无\n\n**4. 语法分析：**\n\n这个句子使用了动词\"passed\"来表达美国国会通过了某项法案的动作，\"ushering in\"是现在分词的形式，用来描述这项法案的影响，即引入了新的民主改革时代。\n\n**5. 知识点总结：**\n\n1. **“Usher in”的使用**：这个短语用来表示开启或引领某一新的时期、阶段或者状态。例如：\"The invention of the internet ushered in a new era of information.\"（互联网的发明开启了信息的新时代。）\n\n2. **“Congress of the United States”的知识点**：美国的国会是立法机构，由两个议院组成：参议院和众议院。国会的职责包括制定法律、批准预算、确认总统的任命以及行使其他政府职能。\n\n3. **“Jury Selection and Service Act”的知识点**：此法案在1968年被美国国会通过，其主要目标是确保所有公民都有公平的机会被选为陪审员，并且陪审团的组成能够代表社区的广泛交叉部分。\n\n**6. 练习相似句子：**\n\n\"In 2015, the government passed the Climate Change Act, ushering in a new era of environmental reforms for the country.\"（2015年，政府通过了《气候变化法》，为该国引入了环保改革的新时代。）"},{"text":"This law abolished special educational requirements for federal jurors and required them to be selected at random from a cross section of the entire community.","explainMd":"**1. 翻译：**\n\n\"这个法律取消了联邦陪审员的特殊教育要求，并要求他们从社区的广泛交叉部分中随机选取。\"\n\n**2. 词汇和短语：**\n\n- Abolish: 废除\n- Special educational requirements: 特殊教育要求\n- Federal jurors: 联邦陪审员\n- Selected at random: 随机选取\n- Cross section: 交叉部分\n\n**3. 句子结构：**\n\n这是一个复合句，其结构为：主句 + 并列句。具体分析如下：\n\n- 主句： \"This law abolished special educational requirements for federal jurors\"，这是句子的主要部分，表达的是这部法律废除了联邦陪审员的特殊教育要求。\n- 并列句： \"and required them to be selected at random from a cross section of the entire community\"，这部分并列于主句，进一步提出了他们需要从社区的广泛交叉部分中随机选取。\n\n**4. 语法分析：**\n\n这个句子使用了动词\"abolished\"来表达这部法律废除了特殊教育要求的动作，并使用了\"required\"来表达这部法律要求陪审员需要从社区的广泛交叉部分中随机选取的规定。这两个动词都是这个句子的主要动词。\n\n**5. 知识点总结：**\n\n1. **“Abolish”的使用**：这个词用来表示废除或者取消某一法律、规则或者制度。例如：\"The new government vowed to abolish the death penalty.\"（新政府誓言要废除死刑。）\n\n2. **“Federal jurors”的知识点**：在美国的法律系统中，联邦陪审员是在联邦法院中被选出来的陪审员。他们的职责是听取证据并决定被告是否有罪。\n\n3. **“Selected at random”的知识点**：这个短语用来表示随机选择。在这个上下文中，它指的是陪审员需要从社区的广泛交叉部分中随机选取，而不是根据他们的教育、种族、性别等特质来选择。\n\n**6. 练习相似句子：**\n\n\"The new policy abolished special quotas for university admission, and required students to be selected at random from the entire applicant pool.\"（新政策取消了大学录取的特殊配额，并要求从所有申请者中随机选择学生。）"},{"text":"In the landmark 1975 decision Taylor v. Louisiana, the Supreme Court extended the requirement that juries be representative of all parts of the community to the state level.","explainMd":"**1. 翻译：**\n\n\"在1975年具有里程碑意义的Taylor v. Louisiana案件判决中，最高法院将陪审团应代表社区所有群体的要求扩展到了州一级。\"\n\n**2. 词汇和短语：**\n\n- Landmark: 里程碑式的，具有重要意义的\n- Decision: 决定，判决\n- Supreme Court: 最高法院\n- Extend: 扩展，推广\n- Requirement: 要求，规定\n- Representative: 代表性的\n- Community: 社区\n- State level: 州一级\n\n**3. 句子结构：**\n\n这是一个简单句，其结构为：主语 + 谓语 + 宾语。具体分析如下：\n\n- 主语： \"The Supreme Court\"，这是句子的主要部分，表达的是最高法院这一实体。\n- 谓语： \"extended the requirement\"，这部分是句子的动作部分，表达的是最高法院扩展了某项要求的动作。\n- 宾语： \"that juries be representative of all parts of the community to the state level\"，这部分是句子的对象部分，表达的是被扩展的要求的具体内容。\n\n**4. 语法分析：**\n\n这个句子使用了动词\"extended\"来表达最高法院扩展了某项要求的动作，并使用了\"that juries be representative of all parts of the community\"来表达被扩展的要求的具体内容。这个句子的结构非常清晰，主语、谓语和宾语都非常明显。\n\n**5. 知识点总结：**\n\n1. **“Landmark”的使用**：这个词用来表示某件事情非常重要，具有历史意义，是一个转折点或者里程碑。例如：\"The Supreme Court made a landmark decision on same-sex marriage in 2015.\"（最高法院在2015年就同性婚姻作出了具有里程碑意义的决定。）\n\n2. **“Supreme Court”的知识点**：在美国的法律系统中，最高法院是最高的法院，有权对所有州和联邦案件进行审查。最高法院的判决具有最终解释权和约束力。\n\n3. **“Extend”的知识点**：这个词用来表示扩展、推广或者延长某件事物。在这个上下文中，它指的是最高法院将某项要求扩展到了州一级。\n\n**6. 练习相似句子：**\n\n\"In the landmark decision of Brown v. Board of Education, the Supreme Court declared that segregation in public schools was unconstitutional, extending the principle of equal protection to all citizens.\"（在具有里程碑意义的布朗诉教育局案件判决中，最高法院宣布公立学校中的种族隔离是违宪的，将平等保护的原则扩展到了所有公民。）"},{"text":"The Taylor decision also declared sex discrimination in jury selection to be unconstitutional and ordered states to use the same procedures for selecting male and female jurors.","explainMd":"**1. 翻译：**\n\n\"Taylor v. Louisiana案件的判决也宣布，在陪审团选拔过程中的性别歧视是违宪的，并命令各州对男性和女性陪审员的选拔使用相同的程序。\"\n\n**2. 词汇和短语：**\n\n- Declare: 宣布，声明\n- Sex discrimination: 性别歧视\n- Jury selection: 陪审团选拔\n- Unconstitutional: 违宪的\n- Same procedures: 相同的程序\n- Male and female jurors: 男性和女性陪审员\n\n**3. 句子结构：**\n\n这是一个复杂句，其结构为：主句 + 并列句。具体分析如下：\n\n- 主句： \"The Taylor decision also declared sex discrimination in jury selection to be unconstitutional\"，这是句子的主要部分，表达的是Taylor v. Louisiana案件的判决宣布在陪审团选拔过程中的性别歧视是违宪的这一观点。\n- 并列句： \"and ordered states to use the same procedures for selecting male and female jurors\"，这部分并列于主句，进一步提出了该判决命令各州对男性和女性陪审员的选拔使用相同的程序这一观点。\n\n**4. 语法分析：**\n\n这个句子使用了动词\"declared\"来表达Taylor v. Louisiana案件的判决对性别歧视的宣布，并使用了\"unconstitutional\"来表示这种性别歧视是违宪的。另外，该句子使用了并列连词\"and\"来连接两个并列的观点，即性别歧视是违宪的，以及各州应对男性和女性陪审员的选拔使用相同的程序。\n\n**5. 知识点总结：**\n\n1. **“Declare”的使用**：这个词用来表示正式宣布或声明某件事情。例如：\"The government declared a state of emergency.\" (政府宣布进入紧急状态。)\n\n2. **“Unconstitutional”的知识点**：这个词用来表示某项行为或政策等违反宪法，一般用在法律或政治的语境中。例如：\"The law was ruled unconstitutional by the Supreme Court.\" (最高法院判定该法律违宪。)\n\n3. **“Same procedures”的知识点**：这个词组表示相同的程序或方式，强调无差别、公平的对待。例如：\"All employees are evaluated using the same procedures.\" (所有员工都采用相同的程序进行评估。)\n\n**6. 练习相似句子：**\n\n\"In the landmark decision of Roe v. Wade, the Supreme Court declared that restrictions on abortion were unconstitutional and ordered states to provide the same healthcare options for all women.\" (在具有里程碑意义的Roe v. Wade案件判决中，最高法院宣布限制堕胎是违宪的，并命令各州为所有女性提供相同的医疗保健选项。)"}]}],"title":""}