{
    "translate": "",
    "paragraphs": [
        {
            "sentences": [
                {
                    "text": "Over the past decade, thousands of patents have been granted for what are called business methods.",
                    "explainMd": "**1. 翻译**\n\n在过去的十年里，已经授予了数以千计的所谓商业方法专利。\n\n**2. 词汇和短语**\n\n- **Over the past decade**: 在过去的十年里\n- **Thousands of patents**: 数以千计的专利\n- **Have been granted**: 已经授予了\n- **For what are called business methods**: 对所谓的商业方法\n\n**3. 句子结构**\n\n这是一个复杂句，主句是\"Thousands of patents have been granted\"，\"Over the past decade\"是时间状语，\"for what are called business methods\"是原因状语。\n\n**4. 语法**\n\n- **现在完成时**：\"have been granted\"是现在完成时，表示过去发生的事情对现在产生的影响。\n- **被动语态**：\"have been granted\"是被动语态，表示主语\"Thousands of patents\"是动作的承受者。\n\n**5. 知识点总结**\n\n- \"Over the past decade\"是一个常用的时间状语，表示在过去十年的时间里发生的事情。\n- 现在完成时表示过去发生的事情对现在产生的影响。\n- 被动语态表示主语是动作的承受者。\n\n**6. 练习相似句子**\n\n- Over the past year, numerous awards have been given for what are considered groundbreaking researches.\n- Throughout the last century, countless inventions have been recognized for what are termed revolutionary technologies."
                },
                {
                    "text": "Amazon.com received one for its “one-click” online payment system.",
                    "explainMd": "**1. 翻译**\n\n亚马逊公司因其“一键”在线支付系统获得了一个专利。\n\n**2. 词汇和短语**\n\n- **Amazon.com**: 亚马逊公司\n- **Received one**: 获得了一个\n- **For its “one-click” online payment system**: 因其“一键”在线支付系统\n\n**3. 句子结构**\n\n这是一个简单句，主语是\"Amazon.com\"，谓语是\"received one\"，\"for its “one-click” online payment system\"是原因状语。\n\n**4. 语法**\n\n- **一般过去时**：\"received\"是一般过去时态，表示过去发生的动作或状态。\n\n**5. 知识点总结**\n\n- \"Received one\" 在此用一般过去时表示过去某一时间点发生的事件。\n- \"For its “one-click” online payment system\" 是一个表示原因的短语。\n\n**6. 练习相似句子**\n\n- Google Inc. received one for its \"PageRank\" algorithm.\n- Tesla Inc. was granted one for its \"Autopilot\" driving system."
                },
                {
                    "text": "Merrill Lynch got legal protection for an asset allocation strategy.",
                    "explainMd": "**1. 翻译**\n\n美林证券为其资产配置策略获得了法律保护。\n\n**2. 词汇和短语**\n\n- **Merrill Lynch**: 美林证券\n- **Got legal protection**: 获得了法律保护\n- **For an asset allocation strategy**: 为其资产配置策略\n\n**3. 句子结构**\n\n这是一个简单句，主语是\"Merrill Lynch\"，谓语是\"got legal protection\"，\"for an asset allocation strategy\"是原因状语。\n\n**4. 语法**\n\n- **一般过去时**：\"got\"是一般过去时，表示过去发生的动作或状态。\n\n**5. 知识点总结**\n\n- \"Got legal protection\" 在此用一般过去时表示过去某一时间点发生的事件。\n- \"For an asset allocation strategy\" 是一个表示原因的短语。\n\n**6. 练习相似句子**\n\n- Microsoft received legal protection for its operating system.\n- Facebook was awarded legal protection for its newsfeed algorithm."
                },
                {
                    "text": "One inventor patented a technique for lifting a box.",
                    "explainMd": "**1. 翻译**\n\n一位发明者为提箱技术申请了专利。\n\n**2. 词汇和短语**\n\n- **One inventor**: 一位发明者\n- **Patented**: 申请了专利\n- **A technique for lifting a box**: 提箱技术\n\n**3. 句子结构**\n\n这是一个简单句，主语是\"One inventor\"，谓语是\"patented\"，\"a technique for lifting a box\"是宾语。\n\n**4. 语法**\n\n- **一般过去时**：\"patented\"是一般过去时态，表示过去发生的动作或状态。\n\n**5. 知识点总结**\n\n- \"Patented\" 在此句中用一般过去时表示过去某一时间点发生的事件。\n- \"A technique for lifting a box\" 是表示具体事物的名词短语。\n\n**6. 练习相似句子**\n\n- One scientist published a method for testing water quality.\n- One engineer registered a design for a new bridge."
                }
            ]
        },
        {
            "sentences": [
                {
                    "text": "Now the nation’s top patent court appears completely ready to scale back on business-method patents, which have been controversial ever since they were first authorized 10 years ago.",
                    "explainMd": "**1. 翻译**\n\n现在，全国最高的专利法院似乎完全准备好对商业方法专利进行削减，这些专利自从十年前首次被授权以来一直存在争议。\n\n**2. 词汇和短语**\n\n- **Now**: 现在\n- **The nation’s top patent court**: 全国最高的专利法院\n- **Appears completely ready**: 似乎完全准备好\n- **To scale back on**: 对...进行削减\n- **Business-method patents**: 商业方法专利\n- **Which have been controversial**: 这些一直存在争议\n- **Ever since they were first authorized**: 自从它们首次被授权以来\n- **10 years ago**: 十年前\n\n**3. 句子结构**\n\n这个句子由一个主句和一个定语从句组成。主句是 \"Now the nation’s top patent court appears completely ready to scale back on business-method patents\"，定语从句是 \"which have been controversial ever since they were first authorized 10 years ago\"，这个从句修饰 \"business-method patents\"，说明这些专利自从首次被授权以来一直存在争议。\n\n**4. 语法**\n\n- **现在时态**：这句话使用了现在时态 \"appears\"，表明专利法院现在的状态是准备好了削减商业方法专利。\n- **定语从句**： \"which have been controversial ever since they were first authorized 10 years ago\" 是一个定语从句，修饰 \"business-method patents\"。\n\n**5. 知识点总结**\n\n- **现在时态**：现在时态通常用来表示现在正在进行或存在的动作或状态，或者表示一般事实和常态。\n- **定语从句**：定语从句是修饰某个词或词组的从句，通常出现在被修饰词的后面，起到限制或说明的作用。\n\n**6. 练习相似句子**\n\n  - Now, the nation's top environmental court appears completely ready to adjust the emission standards, which have been controversial ever since they were first implemented 10 years ago.\n- 现在，全国最高的环保法院似乎已经完全准备好对排放标准进行调整，这些标准自从十年前首次实施以来一直存在争议。\n\n  "
                },
                {
                    "text": "In a move that has intellectual-property lawyers abuzz, the U.S. Court of Appeals for the Federal Circuit said it would use a particular case to conduct a broad review of business-method patents.",
                    "explainMd": "**1. 翻译**\n\n在一个引起知识产权律师们议论纷纷的行动中，美国联邦巡回上诉法院表示，它将利用一个特定的案例来对商业方法专利进行广泛的审查。\n\n**2. 词汇和短语**\n\n- **In a move that**: 在一个…的行动中\n- **Has intellectual-property lawyers abuzz**: 使知识产权律师议论纷纷\n- **The U.S. Court of Appeals for the Federal Circuit**: 美国联邦巡回上诉法院\n- **Said it would use**: 表示它将使用\n- **A particular case**: 一个特定的案例\n- **Conduct a broad review**: 进行广泛审查\n- **Business-method patents**: 商业方法专利\n\n**3. 句子结构**\n\n这个句子是一个复杂句，主句是\"The U.S. Court of Appeals for the Federal Circuit said it would use a particular case to conduct a broad review of business-method patents\"，而\"In a move that has intellectual-property lawyers abuzz\" 是一个定语从句，修饰整个主句，表示这个行动引起了知识产权律师的广泛关注。\n\n**4. 语法**\n\n- **动词时态**：主句中的 \"said\" 是过去式，表示过去发生的事情；\"would use\" 是将来时，表示未来的打算或决定。\n- **定语从句**： \"In a move that has intellectual-property lawyers abuzz\" 是一个定语从句，修饰整个主句，表示这个行动引起了知识产权律师的广泛关注。\n\n**5. 知识点总结**\n\n- **动词时态**：英语中的动词时态主要用来表示动作或状态发生的时间，如过去、现在和未来。\n- **定语从句**：定语从句是修饰某个词或词组的从句，通常跟在被修饰词的后面，起到限制或说明的作用。\n\n**6. 练习相似句子**\n\n  - In a move that has environmental activists abuzz, the United Nations Environment Programme said it would use a particular study to conduct a broad review of global warming.\n- 在一次让环保活动家议论纷纷的行动中，联合国环境署表示，它将利用一项特殊的研究来对全球变暖进行广泛的审查。\n\n  "
                },
                {
                    "text": "In re Bilski, as the case is known, is “a very big deal,” says Dennis D. Crouch of the University of Missouri School of Law.",
                    "explainMd": "**1. 翻译**\n\n这个案子被称为 \"In re Bilski\"，密苏里大学法学院的Dennis D. Crouch说，这是“一个非常重要的事件”。\n\n**2. 词汇和短语**\n\n- **In re Bilski**: In re Bilski（这是一个法律案件的名字）\n- **As the case is known**: 这个案子被称为\n- **Is “a very big deal”**: 是一个非常重要的事件\n- **Says**: 说\n- **Dennis D. Crouch of the University of Missouri School of Law**: 密苏里大学法学院的Dennis D. Crouch\n\n**3. 句子结构**\n\n这句话是一个简单句，以引述为主，主语是 \"In re Bilski, as the case is known\"，谓语是 \"is\"，宾语是 \"“a very big deal”\"。\"says Dennis D. Crouch of the University of Missouri School of Law\" 是一个断句式引语。\n\n**4. 语法**\n\n- **引述**：这句话是一个引述句型，\"says Dennis D. Crouch of the University of Missouri School of Law\" 是引述部分，标明了发言人。\n- **断句式引语**：断句式引语是把引述部分插入到被引述内容的中间，使句子更具有表现力。\n\n**5. 知识点总结**\n\n- **引述**：引述句型在英文中常用于引用某人的原话或观点。\n- **断句式引语**：断句式引语可以增加句子的表现力，使读者更能理解和感受到被引述人的情感和态度。\n\n**6. 练习相似句子**\n\n- 这个项目被称为 \"Project X\"，哈佛大学商学院的John Smith说，这是“一个具有里程碑意义的项目”。\n  - \"Project X\", as the project is known, is \"a milestone project\", says John Smith of Harvard Business School."
                },
                {
                    "text": "It “has the potential to eliminate an entire class of patents.”",
                    "explainMd": "**1. 翻译**\n\n它“有可能消除一整类的专利”。\n\n**2. 词汇和短语**\n\n- **It**: 它\n- **“Has the potential to eliminate”**: 有可能消除\n- **An entire class of patents**: 一整类的专利。\n\n**3. 句子结构**\n\n这是一个简单句，主语是 \"It\"，谓语是 \"has the potential to eliminate\"，宾语是 \"an entire class of patents\"。\n\n**4. 语法**\n\n- **现在时态**：这个句子用的是现在时态 \"has\"，表示现在的状态或情况。\n- **不定式作目的状语**：这句话中的 \"to eliminate\" 是不定式作目的状语，表示可能的结果或目标。\n\n**5. 知识点总结**\n\n- **现在时态**：现在时态通常用来表示现在正在进行或存在的动作或状态，或者表示一般事实和常态。\n- **不定式作目的状语**：不定式可以用来表示目的或结果，通常置于动词之后。\n\n**6. 练习相似句子**\n\n- 它“有可能改变一整个行业的发展方向”。\n  - It \"has the potential to change the development direction of an entire industry\"."
                }
            ]
        },
        {
            "sentences": [
                {
                    "text": "Curbs on business-method claims would be a dramatic about-face, because it was the Federal Circuit itself that introduced such patents with its 1998 decision in the so-called State Street Bank case, approving a patent on a way of pooling mutual-fund assets.",
                    "explainMd": "**1. 翻译**\n\n对商业方法专利的限制将是一个戏剧性的大转弯，因为正是联邦巡回法院在1998年所谓的State Street Bank案件的判决中首次引入了这类专利，批准了一种汇集共同基金资产的方式的专利。\n\n**2. 词汇和短语**\n\n- **Curbs on**: 对...的限制\n- **Business-method claims**: 商业方法专利（申请）\n- **Would be a dramatic about-face**: 将是一个戏剧性的大转弯\n- **Because**: 因为\n- **It was the Federal Circuit itself that**: 正是联邦巡回法院自身\n- **Introduced such patents with its 1998 decision**: 在1998年的判决中首次引入了这类专利\n- **In the so-called State Street Bank case**: 在所谓的State Street Bank案件中\n- **Approving a patent on a way of pooling mutual-fund assets**: 批准了一种汇集共同基金资产的方式的专利\n\n**3. 句子结构**\n\n这是一个复杂句，包含一个主句和两个定语从句。主句是 \"Curbs on business-method claims would be a dramatic about-face\"，第一个定语从句是 \"that introduced such patents with its 1998 decision in the so-called State Street Bank case\"，修饰 \"the Federal Circuit\"，第二个定语从句是 \"approving a patent on a way of pooling mutual-fund assets\"，修饰 \"decision\"。\n\n**4. 语法**\n\n- **将来时态**：这句话使用了将来时态 \"would be\"，表示可能发生的事件。\n- **定语从句**：用 \"that\" 引导的定语从句 \"that introduced such patents with its 1998 decision in the so-called State Street Bank case\" 修饰 \"the Federal Circuit\"，\"approving a patent on a way of pooling mutual-fund assets\" 是现在分词短语作定语，修饰 \"decision\"。\n\n**5. 知识点总结**\n\n- **将来时态**：将来时态用来表示将来可能发生的动作或存在的状态，或者表示将来一定会发生的事情。\n- **定语从句**：定语从句是一个修饰某个名词或代词的从句，通常跟在被修饰的名词或代词之后。\n\n**6. 练习相似句子**\n\n- 对环保政策的调整将是一个戏剧性的大转弯，因为正是联邦环保局在1998年的一项决定中首次引入了这类政策，批准了一种新的减排方法。\n  - Adjustments to environmental policies would be a dramatic about-face, because it was the Federal Environmental Protection Agency itself that introduced such policies with its 1998 decision, approving a new method of emission reduction."
                },
                {
                    "text": "That ruling produced an explosion in business-method patent filings, initially by emerging Internet companies trying to stake out exclusive rights to specific types of online transactions.",
                    "explainMd": "**1. 翻译**\n\n那个裁决导致了商业方法专利申请的爆炸式增长，最初是由试图独占特定类型在线交易权利的新兴互联网公司所推动的。\n\n**2. 词汇和短语**\n\n- **That ruling**: 那个裁决\n- **Produced an explosion in**: 导致了...的爆炸式增长\n- **Business-method patent filings**: 商业方法专利申请\n- **Initially by**: 最初由\n- **Emerging Internet companies**: 新兴互联网公司\n- **Trying to stake out exclusive rights to**: 试图独占...的权利\n- **Specific types of online transactions**: 特定类型的在线交易\n\n**3. 句子结构**\n\n这是一个复合句。主句是 \"That ruling produced an explosion in business-method patent filings\"，其中 \"That ruling\" 是主语，\"produced an explosion in\" 是谓语，\"business-method patent filings\" 是宾语。\"initially by emerging Internet companies trying to stake out exclusive rights to specific types of online transactions\" 是一个由介词 \"by\" 引导的介词短语，用来修饰 \"an explosion\"，说明这个爆炸式增长是由谁引起的。\n\n**4. 语法**\n\n- **过去时态**：这句话使用了过去时态 \"produced\"，表示过去发生的动作。\n- **介词短语**：介词 \"by\" 引导的介词短语 \"by emerging Internet companies trying to stake out exclusive rights to specific types of online transactions\"，用来修饰 \"an explosion\"，表示这个爆炸式增长是由谁引起的。\n\n**5. 知识点总结**\n\n- **过去时态**：过去时态用来表示在过去某个时刻发生的动作或存在的状态，或者表示过去经常发生的动作。\n- **介词短语**：介词短语是由介词和它的宾语（可以是名词、代词、动名词或从句）组成的结构，用来修饰句中的名词、动词或整个句子。\n\n**6. 练习相似句子**\n\n- 那个决策导致了生态旅游的爆炸式增长，最初是由试图独占特定地区旅游权利的新兴旅游公司所推动的。\n  - That decision produced an explosion in eco-tourism, initially by emerging travel companies trying to stake out exclusive rights to specific regions."
                },
                {
                    "text": "Later, more established companies raced to add such patents to their files, if only as a defensive move against rivals that might beat them to the punch.",
                    "explainMd": "**1. 翻译**\n\n后来，更为成熟的公司争相将这类专利加入他们的文件中，即使这只是为了防御可能抢先一步的竞争对手所采取的防守性举措。\n\n**2. 词汇和短语**\n\n- **Later**: 后来\n- **More established companies**: 更为成熟的公司\n- **Raced to add**: 争相添加\n- **Such patents to their files**: 这类专利到他们的文件中\n- **If only as a defensive move**: 即使只是作为一种防守性举措\n- **Against rivals that might beat them to the punch**: 防止竞争对手可能抢先一步\n\n**3. 句子结构**\n\n这是一个复合句。主句是 \"More established companies raced to add such patents to their files\"，其中 \"More established companies\" 是主语，\"raced to add\" 是谓语，\"such patents to their files\" 是宾语。\"if only as a defensive move against rivals that might beat them to the punch\" 是一个条件状语从句，用来修饰主句，说明他们添加专利的原因。\n\n**4. 语法**\n\n- **过去时态**：这句话使用了过去时态 \"raced\"，表示过去发生的动作。\n- **条件状语从句**：由 \"if\" 引导的条件状语从句 \"if only as a defensive move against rivals that might beat them to the punch\"，用来修饰主句，说明他们添加专利的原因。\n\n**5. 知识点总结**\n\n- **过去时态**：过去时态用来表示在过去某个时刻发生的动作或存在的状态，或者表示过去经常发生的动作。\n- **条件状语从句**：条件状语从句用来表示动作或状态发生的条件或假设，常由 \"if\"、\"unless\" 等引导。\n\n**6. 练习相似句子**\n\n- 后来，更为成熟的学者争相将这类研究加入他们的论文中，即使只是为了防御可能抢先一步的竞争对手所采取的防守性举措。\n  - Later, more established scholars raced to add such studies to their papers, if only as a defensive move against rivals that might beat them to the punch."
                },
                {
                    "text": "In 2005, IBM noted in a court filing that it had been issued more than 300 business-method patents, despite the fact that it questioned the legal basis for granting them.",
                    "explainMd": "**1. 翻译**\n\n在2005年，IBM在一份法院文件中指出，尽管它对授予这些专利的法律依据有所质疑，但它已经被授予了300多项商业方法专利。\n\n**2. 词汇和短语**\n\n- **In 2005**: 在2005年\n- **IBM noted in a court filing**: IBM在一份法院文件中指出\n- **It had been issued**: 它已经被授予了\n- **More than 300 business-method patents**: 300多项商业方法专利\n- **Despite the fact that**: 尽管\n- **It questioned the legal basis for granting them**: 它对授予这些专利的法律依据有所质疑\n\n**3. 句子结构**\n\n这是一个复杂的句子。主句是 \"IBM noted in a court filing that it had been issued more than 300 business-method patents\"，其中 \"IBM\" 是主语，\"noted\" 是谓语，\"in a court filing that it had been issued more than 300 business-method patents\" 是宾语，其中 \"that it had been issued more than 300 business-method patents\" 是一个宾语从句。\"Despite the fact that it questioned the legal basis for granting them\" 是一个让步状语从句，用来修饰主句。\n\n**4. 语法**\n\n- **过去完成时**：这句话使用了过去完成时 \"had been issued\"，表示在过去某个时间点之前已经完成的动作。\n- **让步状语从句**：由 \"despite the fact that\" 引导的让步状语从句 \"despite the fact that it questioned the legal basis for granting them\"，用来修饰主句，表示尽管有某种情况，但主句的动作仍然发生。\n\n**5. 知识点总结**\n\n- **过去完成时**：过去完成时用来表示在过去某个时间点之前已经完成的动作，常常与过去时间状语连用。\n- **让步状语从句**：让步状语从句用来表示尽管有某种情况，但主句的动作仍然发生。常由 \"although\"、\"though\"、\"despite the fact that\" 等引导。\n\n**6. 练习相似句子**\n\n- 在2015年，Google在一份法院文件中指出，尽管它对授予这些许可的法律依据有所质疑，但它已经被授予了200多项数据分析许可。\n  - In 2015, Google noted in a court filing that it had been issued more than 200 data analysis licenses, despite the fact that it questioned the legal basis for granting them."
                },
                {
                    "text": "Similarly, some Wall Street investment firms armed themselves with patents for financial products, even as they took positions in court cases opposing the practice.",
                    "explainMd": "## 1. 翻译\n\n\"同样地，一些华尔街的投资公司为自己获取了金融产品的专利，即使他们在法院案件中反对这种做法。\"\n\n## 2. 词汇和短语\n\n- Similarly: 同样地，表示情况或行为的相似性。\n- Wall Street: 华尔街，美国纽约的一条街道，是美国和全球金融中心的象征。\n- Investment firms: 投资公司，指的是主要通过投资来获利的公司。\n- Armed themselves with: 用...武装自己，这里比喻为自己获取了某些东西作为保护或优势。\n- Patents: 专利，是政府给予发明者对其发明的独家权利。\n- Financial products: 金融产品，如股票、债券、基金、期权等。\n- Took positions: 采取立场，表示了在某个问题或情况上的观点或态度。\n- Opposing: 反对，表示不同意或反对某种观点、行动或决定。\n- Practice: 做法，指的是常规的或特定情况下的行动或行为。\n\n## 3. 句子结构\n\n这是一个复合句，主句为\"Some Wall Street investment firms armed themselves with patents for financial products\"，而从句为\"even as they took positions in court cases opposing the practice\"。主句和从句之间用\"even as\"连接，表示\"就在...的时候\"或\"虽然...但是\"的含义。\n\n## 4. 语法\n\n这个句子的语法结构主要包括了一些动词短语（如\"armed themselves with\", \"took positions\"）和一些名词短语（如\"Wall Street investment firms\", \"patents for financial products\"）。其中，\"even as\"用作连接词，连接了主句和从句。\n\n## 5. 知识点总结\n\n这句话主要反映了一种矛盾的现象，即一些华尔街的投资公司在为自己获取金融产品的专利，以此为自己获得优势的同时，他们在法庭上却反对这种做法。这可能暗示他们对这种做法的双重标准，或者他们的实际行动与他们在公众场合表达的观点不一致。\n\n## 6. 练习相似句子\n\n\"Interestingly, some tech companies have been lobbying for stricter data privacy laws, even as they accumulate vast amounts of user data.\"\n\n\"有趣的是，一些科技公司一边积累大量用户数据，一边又在游说更严格的数据隐私法律。\""
                }
            ]
        },
        {
            "sentences": [
                {
                    "text": "The Bilski case involves a claimed patent on a method for hedging risk in the energy market.",
                    "explainMd": "## 1. 翻译\n\n\"Bilski案件涉及的是一个关于能源市场风险对冲方法的专利申请。\"\n\n## 2. 词汇和短语\n\n- The Bilski case: Bilski案件，这是一个专利法案的名称。\n- Involves: 涉及，表示某事或某人与另一件事或人有关。\n- Claimed patent: 申请的专利，\"claimed\" 在这里指的是申请或声称的意思。\n- Method: 方法，是完成某事的特定方式或过程。\n- Hedging risk: 风险对冲，是一种金融策略，用于减少并管理由于不可预见事件而产生的潜在财务风险。\n- Energy market: 能源市场，指的是买卖能源（如石油、天然气、电力等）的市场。\n\n## 3. 句子结构\n\n这是一个简单句，主语是\"The Bilski case\"，谓语是\"involves\"，宾语是\"a claimed patent on a method for hedging risk in the energy market\"。\n\n## 4. 语法\n\n这个句子的语法结构相对简单，主要包括了一个主谓宾结构。在这里，\"on\" 是一个介词，用于连接 \"claimed patent\" 和后面的 \"a method for hedging risk in the energy market\"。\n\n## 5. 知识点总结\n\n这句话主要讲述了Bilski案件的主要内容，即涉及到一个关于能源市场风险对冲方法的专利申请。这个案件可能涉及到专利法的问题，例如什么样的方法可以被授予专利，或者这样的专利申请是否有效等。\n\n## 6. 练习相似句子（英文加中文翻译，一句）\n\n\"The Smith case involves a disputed trademark for a new type of software.\"\n\n\"Smith案件涉及的是一个关于新型软件的争议商标。\""
                },
                {
                    "text": "The Federal Circuit issued an unusual order stating that the case would be heard by all 12 of the court’s judges, rather than a typical panel of three, and that one issue it wants to evaluate is whether it should “reconsider” its State Street Bank ruling.",
                    "explainMd": "## 1. 翻译\n\n联邦巡回法院发布了一项不寻常的命令，声明这个案件将由法院所有的12位法官，而不是通常的三人小组，进行听证，并且它希望评估的一个问题是是否应该“重新考虑”其对于State Street Bank的裁决。\n\n## 2. 词汇和短语\n\n- The Federal Circuit: 联邦巡回法院，美国的一个联邦上诉法院，专门负责听取包括专利和版权在内的各种案件。\n- Issued: 发布，公开宣布或发表。\n- Unusual order: 不寻常的命令，指的是不常见或非典型的命令或决定。\n- Stating: 声明，表明或说明。\n- Would be heard by: 将由...听证，指的是由某人或某组织审理或听取案件或争议。\n- Panel: 小组，这里指的是由几位法官组成的审判小组。\n- Evaluate: 评估，考虑或评价某件事情。\n- Reconsider: 重新考虑，再次思考或重新评估。\n- Ruling: 裁决，法院或法官对案件的正式决定。\n\n## 3. 句子结构\n\n这是一个复杂的复合句，主句为\"The Federal Circuit issued an unusual order\"，然后有两个并列的从句，分别是\"the case would be heard by all 12 of the court’s judges, rather than a typical panel of three\"和\"one issue it wants to evaluate is whether it should “reconsider” its State Street Bank ruling\"。这些从句都由\"that\"引导。\n\n## 4. 语法\n\n这个句子的语法结构包括了一些动词短语（如\"issued an unusual order\", \"would be heard by\", \"wants to evaluate\"）和名词短语（如\"the Federal Circuit\", \"an unusual order\", \"one issue\"）。\"That\"在这里作为连接词，引导从句。\n\n## 5. 知识点总结\n\n这句话主要讲述了联邦巡回法院对某个案件的处理方式和考虑的问题。它展示了法院在处理重要或复杂案件时可能采取的不常见做法，如由所有的法官而不是典型的三人小组听证，以及对先前裁决的重新考虑。\n\n## 6. 练习相似句子\n\n\"The Supreme Court issued a rare statement noting that the appeal will be reviewed by all nine Justices, and that it is considering whether to 'revisit' its previous decision.\"\n\n\"最高法院发布了一项罕见的声明，指出上诉将由所有九位法官审查，并且它正在考虑是否要'重新审视'其先前的决定。\""
                }
            ]
        },
        {
            "sentences": [
                {
                    "text": "The Federal Circuit’s action comes in the wake of a series of recent decisions by the Supreme Court that has narrowed the scope of protections for patent holders.",
                    "explainMd": "## 1. 翻译\n\n\"联邦巡回法院的行动是在最高法院一系列最近的决定之后采取的，这些决定已经缩小了专利持有人的保护范围。\"\n\n## 2. 词汇和短语\n\n- The Federal Circuit’s action: 联邦巡回法院的行动，指的是这个法院在某个问题或案件上采取的决定或行动。\n- Comes in the wake of: 在...之后，表示某件事发生在另一件事之后，有因果关系的含义。\n- A series of: 一系列的，指的是连续的或一系列的事件或事物。\n- Recent decisions: 最近的决定，指的是最近的或新近的决定或裁决。\n- The Supreme Court: 最高法院，指的是美国的最高司法机构。\n- Has narrowed the scope: 已经缩小了范围，指的是减少、缩小或限制了某件事物或某种情况的范围或影响。\n- Protections for patent holders: 对专利持有人的保护，指的是对拥有专利的人或组织的法律保护或权利。\n\n## 3. 句子结构\n\n这是一个简单句，主语是\"The Federal Circuit’s action\"，谓语是\"comes\"，宾语是\"in the wake of a series of recent decisions by the Supreme Court that has narrowed the scope of protections for patent holders\"。\n\n## 4. 语法\n\n这个句子的语法结构相对简单，主要包括了一个主谓宾结构。在这里，\"in the wake of\" 是一个介词短语，用于连接 \"comes\" 和后面的 \"a series of recent decisions by the Supreme Court that has narrowed the scope of protections for patent holders\"。\n\n## 5. 知识点总结\n\n这句话主要讲述了联邦巡回法院的行动是在最高法院一系列裁决之后采取的，这些裁决已经缩小了专利持有人的保护范围。这可能意味着联邦巡回法院的这个行动可能是为了应对或适应最高法院的这些裁决。\n\n## 6. 练习相似句子（英文加中文翻译，一句）\n\n\"The company's response comes in the wake of a series of scandals that has damaged its reputation.\"\n\n\"该公司的反应是在一系列损害其声誉的丑闻之后采取的。\""
                },
                {
                    "text": "Last April, for example, the justices signaled that too many patents were being upheld for “inventions” that are obvious.",
                    "explainMd": "## 1. 翻译\n\n例如，去年四月，法官们表示，对于“显而易见”的“发明”，有太多的专利被认定为有效。\n\n## 2. 词汇和短语\n\n- Last April: 去年四月，指的是在去年的四月份。\n- The justices: 法官们，指的是法院的法官。\n- Signaled: 表示，表示了一个意见或立场。\n- Too many: 太多，表示数量过多。\n- Patents: 专利，是政府给予发明者对其发明的独家权利。\n- Were being upheld: 被认定为有效，\"upheld\"在这里是过去分词，表示被支持或被认可。\n- Inventions: 发明，指的是新的设备、方法或过程。\n- That are obvious: 那些显而易见的，\"obvious\"在这里表示的是简单、明显或容易理解的。\n\n## 3. 句子结构\n\n这是一个复合句，主句为\"the justices signaled that too many patents were being upheld for “inventions”\"，其中的定语从句是\"that are obvious\"。\n\n## 4. 语法\n\n这个句子的语法结构主要包括了一些动词短语（如\"signaled\", \"were being upheld\"）和名词短语（如\"the justices\", \"too many patents\", \"inventions\"）。其中，\"for\"和\"that\"都是连接词，分别引导了介词短语和定语从句。\n\n## 5. 知识点总结\n\n这句话主要讲述了法官们对于专利问题的看法，即他们认为有太多的专利被认定为有效，而这些专利的发明其实是很明显或容易理解的。这可能意味着他们认为专利的标准应该更加严格，不应该轻易地给予显而易见的发明专利。\n\n## 6. 练习相似句子（英文加中文翻译，一句）\n\n\"Last month, for instance, the experts suggested that too many resources were being wasted on 'innovations' that are trivial.\"\n\n\"例如，上个月，专家们建议，太多的资源被浪费在了那些微不足道的 '创新'上。\""
                },
                {
                    "text": "The judges on the Federal Circuit are “reacting to the anti-patent trend at the Supreme Court,” says Harold C. Wegner, a patent attorney and professor at George Washington University Law School.",
                    "explainMd": "## 1. 翻译\n\n乔治·华盛顿大学法学院的专利律师兼教授哈罗德·C·韦格纳说，联邦巡回法院的法官们正在“对最高法院的反专利趋势做出反应”。\n\n## 2. 词汇和短语\n\n- The judges on the Federal Circuit: 联邦巡回法院的法官们，指的是在联邦巡回法院工作的法官。\n- Are reacting to: 正在对...做出反应，表示对某种情况或事件的反应或回应。\n- The anti-patent trend: 反专利趋势，指的是反对或限制专利的趋势或情况。\n- At the Supreme Court: 在最高法院，指的是在最高法院的情况或事件。\n- Says: 说，表示某人表达或陈述的意见。\n- A patent attorney: 专利律师，指的是专门处理专利事务的律师。\n- Professor: 教授，表示在大学或学院工作的高级教师或学者。\n- George Washington University Law School: 乔治·华盛顿大学法学院，是美国一个著名的法学院。\n\n## 3. 句子结构\n\n这是一个简单句，主语是\"The judges on the Federal Circuit\"，谓语是\"are reacting to the anti-patent trend at the Supreme Court\"，宾语是\"Harold C. Wegner, a patent attorney and professor at George Washington University Law School\"。\n\n## 4. 语法\n\n这个句子的语法结构相对简单，主要包括了一个主谓宾结构。在这里，\"to\" 是一个介词，用于连接 \"are reacting\" 和 \"the anti-patent trend at the Supreme Court\"。\n\n## 5. 知识点总结\n\n这句话主要讲述了联邦巡回法院的法官们正在对最高法院的反专利趋势做出反应。这可能意味着他们对最高法院的这种趋势有所关注，也可能在他们的决定或行动中反映出这种关注。\n\n## 6. 练习相似句子（英文加中文翻译，一句）\n\n\"The researchers at the institute are 'responding to the trend of climate change,' says Dr. Johnson, a climatologist and professor at Stanford University.\"\n\n\"斯坦福大学的气候学家和教授约翰逊博士说，研究所的研究人员正在'对气候变化的趋势做出回应'。\""
                }
            ]
        }
    ],
    "title": ""
}