{
    "translate": "",
    "paragraphs": [
        {
            "sentences": [
                {
                    "text": "Of all the changes that have taken place in English-language newspapers during the past quarter-century, perhaps the most far-reaching has been the inexorable decline in the scope and seriousness of their arts coverage.",
                    "explainMd": "**1. 翻译**\n\n\"在过去的二十五年里，英语报纸发生的所有变化中，也许最深远的变化是他们对艺术报道的范围和严肃性的不可阻挡的衰退。\"\n\n**2. 词汇和短语**\n\n- **Changes**: 这个词在这里意味着\"变化\"，指的是过去25年来英语报纸发生的情况。\n\n- **English-language newspapers**: 这是一个复合名词，指的是使用英语作为主要语言的报纸。\n\n- **Quarter-century**: 这个短语意味着\"25年\"，\"quarter\"意为四分之一，因此\"quarter-century\"指的是一个世纪的四分之一，即25年。\n\n- **Far-reaching**: 这个词在这里用作形容词，意味着\"深远的\"或\"有广泛影响的\"，描述的是变化的重要性。\n\n- **Inexorable decline**: \"Inexorable\"是一个形容词，意为\"不可阻挡的\"或\"无法改变的\"，\"decline\"意为\"衰退\"。一起使用，这个短语描述的是一个无法阻止的衰退过程。\n\n- **Scope and seriousness of their arts coverage**: 这个短语描述的是报纸的艺术报道的\"范围\"和\"严肃性\"。\"Scope\"指的是报道的广度，\"seriousness\"指的是报道的深度和专业程度。\n\n**3. 句子结构**\n\n这是一个复合句。主句是 \"perhaps the most far-reaching has been the inexorable decline in the scope and seriousness of their arts coverage\"，其中的主语是 \"the most far-reaching\"，谓语是 \"has been\"，宾语是 \"the inexorable decline in the scope and seriousness of their arts coverage\"。这个主句的前面有一个长时间状语从句 \"Of all the changes that have taken place in English-language newspapers during the past quarter-century\"，用来描述主句所描述的变化发生的时间和背景。\n\n**4. 语法**\n\n这个句子使用了一种叫做\"倒装\"的语法结构，即把谓语动词或助动词放在主语前面。在这个句子中，\"has been\"就被放在了\"the most far-reaching\"前面，这样做是为了强调\"the most far-reaching\"。\n\n**5. 知识点总结**\n\n这个句子的主要知识点包括：\n\n- **复合名词的使用**：如\"English-language newspapers\"。\n\n- **形容词和名词短语的使用**：如\"far-reaching\"和\"inexorable decline\"。\n\n- **倒装句的使用**：这是一个强调句型，把谓语动词或助动词放在主语前面。\n\n- **时间状语从句的使用**：如\"Of all the changes that have taken place in English-language newspapers during the past quarter-century\"。\n\n**6. 练习相似句子**\n\n1. \"Of all the advancements in technology in the past decade, perhaps the most significant has been the rapid development of artificial intelligence.\"\n\n   \"在过去的十年里，技术的所有进步中，也许最重要的是人工智能的快速发展。\"\n\n2. \"Among the shifts that have occurred in the education system over the last fifty years, the most impactful might be the transition towards online learning.\"\n\n   \"在过去的五十年里，教育系统发生的各种转变中，可能最具影响力的是向在线学习的转变。\""
                }
            ]
        },
        {
            "sentences": [
                {
                    "text": "It is difficult to the point of impossibility for the average reader under the age of forty to imagine a time when high-quality arts criticism could be found in most big-city newspapers.",
                    "explainMd": "**1. 翻译**\n\n\"对于四十岁以下的普通读者来说，很难想象曾经有一段时间，大多数大城市的报纸都可以找到高质量的艺术评论。\"\n\n**2. 词汇和短语**\n\n- **Difficult to the point of impossibility**: 这个短语表达了极强的困难程度，即到了几乎不可能的地步。\n\n- **Average reader**: 这个短语指的是普通的、一般的读者，不特指某个专业或特定领域的读者。\n\n- **Under the age of forty**: 这个短语是对年龄的限定，指的是40岁以下的人。\n\n- **Imagine a time**: 这个短语的意思是\"想象一个时间\"或\"回想起一个时期\"。\n\n- **High-quality arts criticism**: 这个短语指的是高质量的艺术评论，描述的是评论的内容和质量。\n\n- **Big-city newspapers**: 这个短语指的是大城市的报纸，描述的是新闻媒体的类型和地理位置。\n\n**3. 句子结构**\n\n这是一个简单句。主句是\"It is difficult to the point of impossibility for the average reader under the age of forty to imagine a time when high-quality arts criticism could be found in most big-city newspapers\"，其中主语是\"It\"，谓语是\"is\"，宾语是\"difficult to the point of impossibility for the average reader under the age of forty to imagine a time when high-quality arts criticism could be found in most big-city newspapers\"。这个宾语中又包含了一个时间状语从句\"when high-quality arts criticism could be found in most big-city newspapers\"。\n\n**4. 语法**\n\n这个句子主要使用了一种叫做\"it...for...to...\"的结构，这是英语中常用的一种虚拟主语结构。在这个结构中，\"it\"是虚拟主语，真正的主语是后面的不定式短语\"for the average reader under the age of forty to imagine a time when high-quality arts criticism could be found in most big-city newspapers\"。\n\n**5. 知识点总结**\n\n这个句子的主要知识点包括：\n\n- **\"it...for...to...\"结构的使用**：这是一种虚拟主语结构，用于强调不定式短语的内容。\n\n- **时间状语从句的使用**：如\"when high-quality arts criticism could be found in most big-city newspapers\"。\n\n- **形容词和名词短语的使用**：如\"difficult to the point of impossibility\"和\"high-quality arts criticism\"。\n\n**6. 练习相似句子**\n\n1. \"It is hard to the point of impossibility for the average student to understand advanced quantum physics without proper guidance.\"\n\n   \"对于普通学生来说，如果没有适当的指导，他们很难理解高级量子物理学。\"\n\n2. \"It's challenging for most people under the age of 30 to imagine a time when the internet didn't exist.\"\n\n   \"对于大多数30岁以下的人来说，他们很难想象没有互联网的时代。\""
                },
                {
                    "text": "Yet a considerable number of the most significant collections of criticism published in the 20th century consisted in large part of newspaper reviews.",
                    "explainMd": "**1. 翻译**\n\n\"然而，在20世纪出版的最重要的评论集中，相当多的部分主要由报纸评论组成。\"\n\n**2. 词汇和短语**\n\n- **Yet**: 在这里，\"yet\"作为副词，表示\"然而\"或\"但是\"，用于转折语境。\n\n- **A considerable number**: 这个短语的意思是\"相当多的\"或\"大量的\"，用于描述数量较多。\n\n- **The most significant collections of criticism**: 这个短语指的是最重要或最具影响力的评论集。\n\n- **Published in the 20th century**: 这个短语是一个过去分词短语，用作定语，修饰\"collections of criticism\"，表示这些评论集是在20世纪出版的。\n\n- **Consisted in large part of**: 这个短语的意思是\"主要由...组成\"。\n\n- **Newspaper reviews**: 这个短语指的是报纸上的评论或评价。\n\n**3. 句子结构**\n\n这是一个简单句。主句是 \"a considerable number of the most significant collections of criticism published in the 20th century consisted in large part of newspaper reviews\"，其中主语是 \"a considerable number of the most significant collections of criticism published in the 20th century\"，谓语是 \"consisted in large part of\"，宾语是 \"newspaper reviews\"。这个主句前面有一个转折连词 \"Yet\"。\n\n**4. 语法**\n\n这个句子主要使用了一个叫做\"of\"的介词短语，用于表示主语和宾语之间的关系。在这个句子中，\"a considerable number of the most significant collections of criticism published in the 20th century\"是主语，\"newspaper reviews\"是宾语，它们之间的关系是主体和组成部分的关系，这个关系由介词\"of\"表示。\n\n**5. 知识点总结**\n\n这个句子的主要知识点包括：\n\n- **转折连词的使用**：如 \"Yet\"。\n\n- **介词短语的使用**：如 \"consisted in large part of\"。\n\n- **过去分词短语做定语的使用**：如 \"the most significant collections of criticism published in the 20th century\"。\n\n- **指示数量的短语的使用**：如 \"a considerable number\"。\n\n**6. 练习相似句子**\n\n1. \"Yet a large portion of the most successful technology companies established in the 21st century are largely based on Internet technology.\"\n\n   \"然而，在21世纪成立的最成功的技术公司中，有很大一部分主要基于互联网技术。\"\n\n2. \"However, a significant number of the most popular movies released during the 1980s were primarily science fiction films.\"\n\n   \"然而，在1980年代上映的最受欢迎的电影中，有很大一部分主要是科幻电影。\""
                },
                {
                    "text": "To read such books today is to marvel at the fact that their learned contents were once deemed suitable for publication in general-circulation dailies.",
                    "explainMd": "**1. 翻译**\n\n\"如今阅读这些书籍，会让人惊奇地发现，这些学术性的内容曾经被认为适合在大众传播的日报上发表。\"\n\n**2. 词汇和短语**\n\n- **To read such books today**: 这个短语的意思是\"如今阅读这些书籍\"。\n\n- **Is to marvel at**: 这个短语的意思是\"会让人惊奇地发现\"。\n\n- **The fact that**: 这个连接词引导一个名词性从句，翻译为\"…的事实\"。\n\n- **Their learned contents**: 这个短语指的是\"他们的学术性内容\"。\n\n- **Were once deemed suitable for**: 这个短语的意思是\"曾经被认为适合于\"。\n\n- **Publication in general-circulation dailies**: 这个短语指的是\"在大众传播的日报上发表\"。\n\n**3. 句子结构**\n\n这是一个简单句。主句是\"To read such books today is to marvel at the fact that their learned contents were once deemed suitable for publication in general-circulation dailies\"，其中主语是\"To read such books today\"，谓语是\"is\"，宾语是\"to marvel at the fact that their learned contents were once deemed suitable for publication in general-circulation dailies\"。这个宾语中又包含了一个名词性从句\"that their learned contents were once deemed suitable for publication in general-circulation dailies\"。\n\n**4. 语法**\n\n这个句子主要使用了一种叫做\"to...is to...\"的结构，这是英语中常用的一种结构，用于强调某种行为的结果或效果。在这个结构中，两个\"to\"后面都跟的是动词的原形，第一个\"to\"的动词原形表示一种行为，第二个\"to\"的动词原形表示这种行为的结果或效果。\n\n此外，这个句子还使用了\"the fact that\"引导的名词性从句，用于描述具体的事实。\n\n**5. 知识点总结**\n\n这个句子的主要知识点包括：\n\n- **\"to...is to...\"结构的使用**：这是一种常用的结构，用于强调某种行为的结果或效果。\n\n- **\"the fact that\"引导的名词性从句的使用**：用于描述具体的事实。\n\n- **动词的过去式的使用**：如\"were once deemed suitable for\"。\n\n**6. 练习相似句子**\n\n1. \"To study these theories now is to realize that their complex concepts were once taught in high school curriculum.\"\n\n   \"现在学习这些理论，会让人惊奇地发现，这些复杂的概念曾经在高中课程中教授。\"\n\n2. \"To watch these films today is to appreciate the fact that their advanced techniques were once considered groundbreaking.\"\n\n   \"如今观看这些电影，会让人欣赏到，这些先进的技术曾经被认为是破坏性的。\""
                }
            ]
        },
        {
            "sentences": [
                {
                    "text": "We are even farther removed from the unfocused newspaper reviews published in England between the turn of the 20th century and the eve of World War II, at a time when newsprint was dirt-cheap and stylish arts criticism was considered an ornament to the publications in which it appeared.",
                    "explainMd": "**1. 翻译**\n\n\"我们与20世纪初和二战前夕在英国出版的，新闻纸便宜且时兴的艺术评论被视为出版物之饰的那个时期的不专注的报纸评论，相距更远了。\"\n\n**2. 词汇和短语**\n\n- **We are even farther removed from**: 这个短语的意思是\"我们与...相距更远了\"。\n\n- **The unfocused newspaper reviews**: 这个短语指的是\"不专注的报纸评论\"。\n\n- **Published in England between the turn of the 20th century and the eve of World War II**: 这个短语是一个过去分词短语，用作定语，修饰\"the unfocused newspaper reviews\"，表示这些评论是在20世纪初和二战前夕在英国出版的。\n\n- **At a time when**: 这个连接词引导一个时间状语从句，翻译为\"在...的时候\"。\n\n- **Newsprint was dirt-cheap**: 这个短语的意思是\"新闻纸非常便宜\"。\n\n- **Stylish arts criticism was considered an ornament to the publications in which it appeared**: 这个短语的意思是\"时兴的艺术评论被视为出版物的装饰\"。\n\n**3. 句子结构**\n\n这是一个复合句。主句是\"We are even farther removed from the unfocused newspaper reviews published in England between the turn of the 20th century and the eve of World War II\"，其中主语是\"We\"，谓语是\"are even farther removed from\"，宾语是\"the unfocused newspaper reviews published in England between the turn of the 20th century and the eve of World War II\"。这个主句后面接了一个时间状语从句\"at a time when newsprint was dirt-cheap and stylish arts criticism was considered an ornament to the publications in which it appeared\"。\n\n**4. 语法**\n\n这个句子主要使用了一个时间状语从句，用于描述主句发生的时间背景。在这个从句中，\"when\"是连接词，后面接的是两个并列的句子\"newsprint was dirt-cheap\"和\"stylish arts criticism was considered an ornament to the publications in which it appeared\"。\n\n**5. 知识点总结**\n\n这个句子的主要知识点包括：\n\n- **时间状语从句的使用**：如 \"at a time when...\"。\n\n- **过去分词短语做定语的使用**：如 \"the unfocused newspaper reviews published in England between the turn of the 20th century and the eve of World War II\"。\n\n- **并列句的使用**：如 \"newsprint was dirt-cheap and stylish arts criticism was considered an ornament to the publications in which it appeared\"。\n\n**6. 练习相似句子**\n\n1. \"We are far from the simple radio broadcasts made in America during the Great Depression, at a time when technology was emerging and engaging storytelling was seen as a key to attracting listeners.\"\n\n   \"我们与大萧条时期在美国制作的简单广播节目，那是一个技术正在崭露头角，吸引听众的关键被视为吸引人的讲故事的时期，相距很远了。\"\n\n2. \"We are much further removed from the rudimentary computer games developed in the 1970s, at a time when digital technology was in its infancy and innovative gameplay was considered a novelty.\"\n\n   \"我们与20世纪70年代开发的初级电脑游戏，那是一个数字技术正处于起步阶段，创新的游戏玩法被视为新颖的时期，相距更远了。\""
                },
                {
                    "text": "In those far-off days, it was taken for granted that the critics of major papers would write in detail and at length about the events they covered.",
                    "explainMd": "**1. 翻译**\n\n\"在那些遥远的日子里，大家都认为主要报纸的评论员会详尽且长篇大论地写关于他们报道的事件。\"\n\n**2. 词汇和短语**\n\n- **In those far-off days**: 这个短语的意思是\"在那些遥远的日子里\"。\n\n- **It was taken for granted that**: 这个短语的意思是\"大家都认为...是理所当然的\"。\n\n- **The critics of major papers**: 这个短语指的是\"主要报纸的评论员\"。\n\n- **Would write in detail and at length about**: 这个短语的意思是\"会详尽且长篇大论地写关于...\"。\n\n- **The events they covered**: 这个短语指的是\"他们报道的事件\"。\n\n**3. 句子结构**\n\n这是一个简单句。其中主语是\"It\"，谓语是\"was taken for granted\"，\"that\"引导的宾语从句是\"the critics of major papers would write in detail and at length about the events they covered\"。\n\n**4. 语法**\n\n这个句子主要使用了\"it...that...\"的结构，这是英语中常用的一种强调句型，用于强调\"that\"后面的内容。在这个句型中，\"it\"是形式主语，真正的主语是\"that\"引导的宾语从句。\n\n此外，这个句子还使用了\"would\"表示过去的习惯动作。\n\n**5. 知识点总结**\n\n这个句子的主要知识点包括：\n\n- **\"it...that...\"结构的使用**：这是一种常用的强调句型，用于强调\"that\"后面的内容。\n\n- **\"would\"表示过去的习惯动作的使用**：如\"the critics of major papers would write in detail and at length about the events they covered\"。\n\n**6. 练习相似句子**\n\n1. \"In those early days, it was assumed that the pioneers would face many challenges and work hard to overcome them.\"\n\n   \"在那些早期的日子里，大家都认为先驱者会面临许多挑战，并努力克服它们。\"\n\n2. \"In that distant era, it was taken as a given that the artists would express their emotions freely and passionately in their works.\"\n\n   \"在那个遥远的时代，大家都认为艺术家会在他们的作品中自由和热情地表达他们的情感。\""
                },
                {
                    "text": "Theirs was a serious business, and even those reviewers who wore their learning lightly, like George Bernard Shaw and Ernest Newman, could be trusted to know what they were about.",
                    "explainMd": "**1. 翻译**\n\n他们的工作是一项严肃的事务，即使是像乔治·伯纳德·肖和恩斯特·纽曼这样的评论员，他们的学识轻松自如，也可以被信任他们知道他们在做什么。\n\n**2. 词汇和短语**\n\n- **Theirs was a serious business**: 他们的工作是一项严肃的事务\n- **Reviewers**: 评论员\n- **Wore their learning lightly**: 学识轻松自如\n- **Could be trusted to know what they were about**: 可以被信任他们知道他们在做什么\n\n**3. 句子结构**\n\n这句话是一个复合句，主句是\"Theirs was a serious business\"，并列的从句是\"even those reviewers who wore their learning lightly, like George Bernard Shaw and Ernest Newman, could be trusted to know what they were about\"。这个从句中还包含一个由\"who\"引导的定语从句\"wore their learning lightly\"来修饰\"reviewers\"。\n\n**4. 语法**\n\n- **名词性物主代词的使用**：\"Theirs\"是名词性物主代词，用来代替前文提到的人或事物，它在这里作为句子的主语。\n- **被动语态的使用**：\"could be trusted\"是被动语态，强调的是评论员的可信度，而不是其他人的观点。\n- **定语从句的使用**：\"who wore their learning lightly\"是定语从句，用来修饰\"reviewers\"。\n\n**5. 知识点总结**\n\n- 名词性物主代词如\"theirs\"，\"ours\"，\"hers\"等可以作为句子的主语。\n- 被动语态用来强调受动者，而非行动者。\n- 定语从句用来修饰名词或代词，它后面通常跟着一个句子，这个句子用来进一步描述或限定前面的名词或代词。\n\n**6. 练习相似句子**\n\n- Theirs was a tough job, and even those workers who carried out their tasks effortlessly, like John and Mary, could be trusted to understand what they were doing.\n- His was a complicated project, and even those engineers who made their progress seem easy, like Alice and Bob, could be relied on to know what they were tackling."
                },
                {
                    "text": "These men believed in journalism as a calling, and were proud to be published in the daily press.",
                    "explainMd": "**1. 翻译**\n\n这些人视新闻业为他们的使命，并为自己的作品能在日报上发表感到自豪。\n\n**2. 词汇和短语**\n\n- **These men**: 这些人\n- **Believed in**: 信任，信仰\n- **Journalism as a calling**: 将新闻业视为一种使命\n- **Were proud to be**: 感到自豪\n- **Published in the daily press**: 在日报上发表\n\n**3. 句子结构**\n\n这是一个复合句，主句是\"These men believed in journalism as a calling\"，并列句是\"were proud to be published in the daily press\"。\n\n**4. 语法**\n\n- **动词短语**：\"Believed in\"是一个动词短语，表示信任或信仰。\n- **被动语态**：\"were proud to be published in the daily press\"是被动语态，强调的是他们的作品被发表的事实。\n\n**5. 知识点总结**\n\n- \"Believe in\"是一个动词短语，表示对某事物的信任或信仰。\n- 在被动语态中，行为的结果或影响被强调，而不是行为的执行者。\n\n**6. 练习相似句子**\n\n- These women viewed nursing as a vocation, and were proud to be recognized in the medical community.\n- These students perceived learning as a lifelong journey, and were proud to have their research published in academic journals."
                },
                {
                    "text": "“So few authors have brains enough or literary gift enough to keep their own end up in journalism,” Newman wrote, “that I am tempted to define ‘journalism’ as ‘a term of contempt applied by writers who are not read to writers who are’.”",
                    "explainMd": "**1. 翻译**\n\nNewman写道：“极少有作者拥有足够的智力或文学才华在新闻业中保持自己的地位，我甚至被诱惑去定义‘新闻业’为‘那些未被阅读的作家对被阅读的作家的蔑视之词’。”\n\n**2. 词汇和短语**\n\n- **So few**: 如此少\n- **Authors**: 作者\n- **Brains enough or literary gift enough**: 足够的智力或文学才华\n- **Keep their own end up in journalism**: 在新闻业中保持自己的地位\n- **A term of contempt**: 一个蔑视的词语\n- **Applied by writers who are not read to writers who are**: 未被阅读的作家对被阅读的作家使用的\n\n**3. 句子结构**\n\n这是一个复杂句。主句是\"Newman wrote\"，它的宾语是由\"that\"引导的宾语从句。这个宾语从句中又包含了一个\"I am tempted to define...\"的主从复合句，其中\"journalism\"是\"define\"的直接宾语，\"as 'a term of contempt applied by writers who are not read to writers who are'\"则是间接宾语。\n\n**4. 语法**\n\n- **双重否定**：\"So few authors have brains enough or literary gift enough\"是一个双重否定，强调的是作者在新闻业中能保持地位的困难。\n- **被动语态**：\"Applied by writers who are not read to writers who are\"，这里使用了被动语态，强调的是\"term of contempt\"这个词是如何被使用的。\n\n**5. 知识点总结**\n\n- 在英语中，双重否定可以用来强化否定的含义。\n- 被动语态可以在不改变句子含义的情况下，改变句子的焦点。\n\n**6. 练习相似句子**\n\n- \"So few students have the discipline or the intellectual curiosity to excel in science,\" the teacher said, \"that I am tempted to define 'science' as 'a field of study neglected by those who do not understand its value to those who do'.\""
                }
            ]
        },
        {
            "sentences": [
                {
                    "text": "Unfortunately, these critics are virtually forgotten.",
                    "explainMd": "**1. 翻译**\n\n不幸的是，这些批评家几乎被遗忘了。\n\n**2. 词汇和短语**\n\n- **Unfortunately**: 不幸的是\n- **These critics**: 这些批评家\n- **Are virtually**: 几乎\n- **Forgotten**: 被遗忘\n\n**3. 句子结构**\n\n这是一个简单句，主语是\"These critics\"，谓语是\"are virtually forgotten\"，而\"Unfortunately\"是副词，用来修饰整个句子。\n\n**4. 语法**\n\n- **被动语态**：\"are forgotten\"是一个被动语态，强调的是批评家被遗忘的状态。\n- **副词**：\"Unfortunately\"是副词，用来修饰整个句子，表示对这种情况的感叹。\n\n**5. 知识点总结**\n\n- 在被动语态中，行为的结果或影响被强调，而不是行为的执行者。\n- 副词可以用来修饰整个句子，表示对某种情况的态度或感受。\n\n**6. 练习相似句子**\n\n- Unfortunately, these traditions are virtually extinct.\n- Unfortunately, these species are virtually unknown."
                },
                {
                    "text": "Neville Cardus, who wrote for the Manchester Guardian from 1917 until shortly before his death in 1975, is now known solely as a writer of essays on the game of cricket.",
                    "explainMd": "**1. 翻译**\n\nNeville Cardus，他从1917年开始为《曼彻斯特卫报》写作，一直到1975年去世前不久，现在他仅以写板球游戏论文而闻名。\n\n**2. 词汇和短语**\n\n- **Neville Cardus**: Neville Cardus（人名）\n- **Wrote for the Manchester Guardian**: 为《曼彻斯特卫报》写作\n- **From 1917 until shortly before his death in 1975**: 从1917年到1975年去世前不久\n- **Is now known solely as**: 现在仅以...而闻名\n- **A writer of essays on the game of cricket**: 板球游戏论文的作者\n\n**3. 句子结构**\n\n这句话是一个复合句。主句是\"Neville Cardus is now known solely as a writer of essays on the game of cricket\"，而\"who wrote for the Manchester Guardian from 1917 until shortly before his death in 1975\"是一个限定性定语从句，修饰\"Neville Cardus\"。\n\n**4. 语法**\n\n- **限定性定语从句**：\"who wrote for the Manchester Guardian from 1917 until shortly before his death in 1975\"是一个限定性定语从句，由关系代词\"who\"引导，修饰\"Neville Cardus\"。\n\n**5. 知识点总结**\n\n- 限定性定语从句用于对先行词进行必要的修饰，如果去掉，主句的意思就不完整或发生改变。在这个句子中，定语从句提供了关于\"Neville Cardus\"的重要信息。\n\n**6. 练习相似句子**\n\n- Albert Einstein, who worked at the patent office before he became famous, is now known solely as a great physicist.\n- Jane Austen, who started writing at a young age, is now known solely as a writer of classic romantic novels."
                },
                {
                    "text": "During his lifetime, though, he was also one of England’s foremost classical-music critics, and a stylist so widely admired that his Autobiography (1947) became a best-seller.",
                    "explainMd": "**1. 翻译**\n\n然而，在他的一生中，他也是英国最重要的古典音乐评论家之一，且他的文风广受赞赏，以至于他的《自传》（1947年）成为了畅销书。\n\n**2. 词汇和短语**\n\n- **During his lifetime**: 在他的一生中\n- **Also**: 也\n- **One of England’s foremost classical-music critics**: 英国最重要的古典音乐评论家之一\n- **And a stylist so widely admired**: 且他的文风广受赞赏\n- **That his Autobiography (1947) became a best-seller**: 以至于他的《自传》（1947年）成为了畅销书\n\n**3. 句子结构**\n\n这是一个复合句。主句是\"he was also one of England’s foremost classical-music critics, and a stylist so widely admired\"，之后的\"that his Autobiography (1947) became a best-seller\"是一个结果状语从句，表明因为他的文风广受赞赏，所以他的自传成为了畅销书。\n\n**4. 语法**\n\n- **结果状语从句**：\"that his Autobiography (1947) became a best-seller\"是一个结果状语从句，表示由于\"he was a stylist so widely admired\"的结果。\n\n**5. 知识点总结**\n\n- 结果状语从句用于表示动作或状态的结果或效果。在这个句子中，结果状语从句表明他的自传成为了畅销书是他广受赞赏的风格的结果。\n\n**6. 练习相似句子**\n\n- During her lifetime, though, she was also one of America's foremost poets, and a writer so widely admired that her novel (1999) became a best-seller.\n- During his career, he was also one of the industry's leading innovators, and a visionary so widely admired that his biography (2020) became a best-seller."
                },
                {
                    "text": "He was knighted in 1967, the first music critic to be so honored.",
                    "explainMd": "**1. 翻译**\n\n他在1967年被封为爵士，是首位获此荣誉的音乐评论家。\n\n**2. 词汇和短语**\n\n- **He was knighted**: 他被封为爵士\n- **In 1967**: 在1967年\n- **The first music critic**: 首位音乐评论家\n- **To be so honored**: 获此荣誉\n\n**3. 句子结构**\n\n这是一个简单句，主语是\"He\"，谓语是\"was knighted\"和\"be honored\"，\"in 1967\"是时间状语，\"the first music critic\"是插入语，表明\"He\"是首位获此荣誉的音乐评论家。\n\n**4. 语法**\n\n- **被动语态**：\"was knighted\"和\"be honored\"都是被动语态，强调的是\"He\"被封为爵士和获得荣誉的状态。\n- **不定式做定语**：\"to be so honored\"是不定式短语做定语，修饰\"the first music critic\"，表示是首位获此荣誉的音乐评论家。\n\n**5. 知识点总结**\n\n- 在被动语态中，行为的结果或影响被强调，而不是行为的执行者。\n- 不定式做定语，修饰名词，通常用来表示目的、原因、结果等。\n\n**6. 练习相似句子**\n\n- She was promoted in 2000, the first female manager to be so recognized.\n- He was awarded the Nobel Prize in 2010, the first Chinese writer to be so honored."
                },
                {
                    "text": "Yet only one of his books is now in print, and his vast body of writings on music is unknown save to specialists.",
                    "explainMd": "**1. 翻译**\n\n然而，他的书籍中现在只有一本还在印刷中，他大量关于音乐的写作只有专家们才知道。\n\n**2. 词汇和短语**\n\n- **Yet**: 然而\n- **Only one of his books**: 他的书籍中只有一本\n- **Is now in print**: 现在还在印刷中\n- **And his vast body of writings on music**: 他大量关于音乐的写作\n- **Is unknown save to specialists**: 只有专家们才知道\n\n**3. 句子结构**\n\n这是一个并列句，由\"Yet only one of his books is now in print\"和\"his vast body of writings on music is unknown save to specialists\"两个简单句通过并列连词\"and\"连接。\n\n**4. 语法**\n\n- **数量词+of结构**：\"one of his books\"中，\"one\"为数量词，后接\"of\"表示\"他的书籍中的一本\"，这是一种常见的表示部分的结构。\n- **倒装句**：\"is unknown save to specialists\"中，\"save to specialists\"是介词短语，表示\"除...之外\"，\"unknown\"是形容词，作表语。这是一种部分倒装，当句子以否定词、半否定词开头时，常常采用部分倒装。\n\n**5. 知识点总结**\n\n- \"数量词+of\"结构常用来表示部分，如\"one of\", \"some of\", \"a few of\"等。\n- 部分倒装的条件之一是：句首是否定词或半否定词，如\"never\", \"seldom\", \"hardly\"等。\n\n**6. 练习相似句子**\n\n- Yet only a few of his paintings are now on display, and his extensive collection is unknown save to art historians.\n- Yet only one of her poems is now published, and her large volume of literary works is unknown except to scholars."
                }
            ]
        },
        {
            "sentences": [
                {
                    "text": "Is there any chance that Cardus’s criticism will enjoy a revival?",
                    "explainMd": "**1. 翻译**\n\nCardus的评论有可能会重新流行起来吗？\n\n**2. 词汇和短语**\n\n- **Is there any chance**: 有可能吗\n- **That Cardus’s criticism**: Cardus的评论\n- **Will enjoy a revival**: 会重新流行起来\n\n**3. 句子结构**\n\n这是一个疑问句，主语是\"Cardus’s criticism\"，谓语是\"will enjoy a revival\"，\"Is there any chance\"用来询问可能性。\n\n**4. 语法**\n\n- **宾语从句**：\"that Cardus’s criticism will enjoy a revival\"是一个宾语从句，作为\"Is there any chance\"的宾语。在这里，\"that\"引导的是一个陈述语序的宾语从句。\n\n**5. 知识点总结**\n\n- \"Is there any chance\"是一个询问可能性的常用短语。\n- \"That\"可引导宾语从句，从句的语序为陈述语序。\n\n**6. 练习相似句子**\n\n- Is there any chance that the old traditions will make a comeback?\n- Is there any chance that her novel will be republished?"
                },
                {
                    "text": "The prospect seems remote.",
                    "explainMd": "**1. 翻译**\n\n这个可能性看起来很小。\n\n**2. 词汇和短语**\n\n- **The prospect**: 这个可能性\n- **Seems**: 看起来\n- **Remote**: 很小\n\n**3. 句子结构**\n\n这是一个简单句，主语是\"The prospect\"，谓语是\"seems\"，\"remote\"是表语，用来描述主语的状态。\n\n**4. 语法**\n\n- **系动词和表语**：\"seems\"是系动词，用来连接主语和表语，\"remote\"作为表语，描述主语\"The prospect\"的状态。\n\n**5. 知识点总结**\n\n- \"The prospect\"用来表示某种可能性或预期的事物。\n- \"Seems\"是系动词，常用来连接主语和表语，表述主语的状态或特性。\n\n**6. 练习相似句子**\n\n- The possibility seems unlikely.\n- The chance seems slim."
                },
                {
                    "text": "Journalistic tastes had changed long before his death, and postmodern readers have little use for the richly upholstered Vicwardian prose in which he specialized.",
                    "explainMd": "**1. 翻译**\n\n在他去世之前，新闻业的口味早已改变，而后现代读者对他擅长的丰富多彩的维多利亚-爱德华时期的散文兴趣寥寥。\n\n**2. 词汇和短语**\n\n- **Journalistic tastes**: 新闻业的口味\n- **Had changed long before his death**: 在他去世之前早已改变\n- **And postmodern readers**: 而后现代读者\n- **Have little use for**: 对…兴趣寥寥\n- **The richly upholstered Vicwardian prose**: 丰富多彩的维多利亚-爱德华时期的散文\n- **In which he specialized**: 他擅长的\n\n**3. 句子结构**\n\n这是一个复合句，主句是\"Journalistic tastes had changed long before his death\"，并列句是\"postmodern readers have little use for the richly upholstered Vicwardian prose\"，\"in which he specialized\"是一个定语从句，修饰\"the richly upholstered Vicwardian prose\"。\n\n**4. 语法**\n\n- **过去完成时**：\"had changed\"是过去完成时，表示在过去某一时间点或动作之前已经完成的动作或状态。\n- **have little use for**：\"have little use for\"是一个固定短语，表示对某事物兴趣寥寥或无需求。\n- **定语从句**：\"in which he specialized\"是一个定语从句，\"which\"指代\"the richly upholstered Vicwardian prose\"，\"in\"是介词，表示所擅长的领域。\n\n**5. 知识点总结**\n\n- 过去完成时用于表示一个过去的时间或动作之前已经完成的动作或状态。\n- \"have little use for\"是一个固定短语，表示对某事物兴趣寥寥或无需求。\n- \"which\"可以引导定语从句，修饰其前面的名词或代词。\n\n**6. 练习相似句子**\n\n- The fashion had shifted long before her retirement, and modern designers have little use for the elaborate Baroque style in which she excelled.\n- Artistic trends had evolved long before his passing, and contemporary artists have little interest in the detailed realism in which he was proficient."
                },
                {
                    "text": "Moreover, the amateur tradition in music criticism has been in headlong retreat.",
                    "explainMd": "**1. 翻译**\n\n此外，音乐评论中的业余传统一直在急速退却。\n\n**2. 词汇和短语**\n\n- **Moreover**: 此外\n- **The amateur tradition in music criticism**: 音乐评论中的业余传统\n- **Has been in headlong retreat**: 一直在急速退却\n\n**3. 句子结构**\n\n这句话是一个简单句，主语是\"The amateur tradition in music criticism\"，谓语是\"has been in headlong retreat\"。\n\n**4. 语法**\n\n- **现在完成进行时**：\"has been in headlong retreat\"是现在完成进行时，表示从过去某一时间开始一直持续到现在的动作或状态。\n\n**5. 知识点总结**\n\n- \"Moreover\" 是一个过渡词，用于引导附加的信息或观点。\n- 现在完成进行时表示从过去某一时间开始一直持续到现在的动作或状态。\n\n**6. 练习相似句子**\n\n- Moreover, the traditional approach to teaching has been in rapid decline.\n- Furthermore, the handmade craft in pottery making has been in swift dwindling."
                }
            ]
        }
    ],
    "title": ""
}