{"translate":"","paragraphs":[{"sentences":[{"text":"In his book The Tipping Point, Malcolm Gladwell argues that “social epidemics” are driven in large part by the actions of a tiny minority of special individuals, often called influentials, who are unusually informed, persuasive, or well connected.","explainMd":"### 1. 翻译：\n\n在他的书《引爆点》中，马尔科姆·格拉德威尔主张，“社会疫情”在很大程度上是由一小部分特殊个体的行动驱动的，这些个体常被称为影响者，他们通常信息丰富、有说服力或者人脉广泛。\n\n### 2. 词汇和短语：\n\n- **The Tipping Point**：书名，中文翻译为《引爆点》。\n- **social epidemics**：社会疫情，指的是在社会中迅速传播的行为、观念或者趋势。\n- **driven in large part by**：在很大程度上由……驱动。\n- **a tiny minority of special individuals**：一小部分特殊的个体。\n- **often called influentials**：通常被称为影响者。\n- **unusually informed, persuasive, or well connected**：有丰富信息、有说服力或者人脉广泛。\n\n### 3. 句子结构：\n\n这句话是一个复合句，主语是\"Malcum Gladwell argues\"，引导词\"that\"引导了一个宾语从句，描述了他的主张。这个宾语从句包含了两部分，一部分描述了由什么驱动，另一部分描述了这些驱动者是什么样的人。\n\n### 4. 语法：\n\n- **are driven in large part by**：这是一个被动语态结构，表示\"社会疫情\"是被\"一小部分特殊的个体的行动\"驱动的。\n- **often called influentials**：这是一个被动语态结构，表示他们常常被称为\"影响者\"。\n- **unusually informed, persuasive, or well connected**：这是一个并列结构，用来描述\"影响者\"的特征。\n\n### 5. 知识点总结：\n\n本句提供了一个例子，展示了如何在英语中使用被动语态和并列结构来描述和解释一个观点。同时，这句话也提供了一些描述社会现象的词汇和短语。\n\n### 6. 练习相似句子：\n\nIn his research, Robert Cialdini suggests that social behaviors are largely influenced by a small group of people, often known as opinion leaders, who are exceptionally knowledgeable, convincing, or networked.\n\n在他的研究中，罗伯特·希尔迪尼认为，社会行为在很大程度上是受一小部分人的影响，这些人通常被称为意见领袖，他们非常知情、有说服力或者关系网广泛。"},{"text":"The idea is intuitively compelling, but it doesn’t explain how ideas actually spread.","explainMd":"### 1. 翻译：\n\n这个观点直觉上是令人信服的，但它并没有解释清楚想法是如何实际传播的。\n\n### 2. 词汇和短语：\n\n- **The idea**：指的是前文所提到的观点或理论。\n- **is intuitively compelling**：直觉上令人信服的。\n- **it doesn’t explain how ideas actually spread**：它并没有解释清楚想法是如何实际传播的。\n\n### 3. 句子结构：\n\n这句话是一个并列句，用\"but\"连接了两个独立的句子，第一个句子是对观点的评价，第二个句子是对观点的批评。\n\n### 4. 语法：\n\n- **is intuitively compelling**：这是一个被动语态结构，表示观点在直觉上是令人信服的。\n- **it doesn’t explain how ideas actually spread**：这是一个否定句，表示它并没有解释清楚想法是如何实际传播的。\n\n### 5. 知识点总结：\n\n本句提供了一个例子，展示了如何在英语中使用并列句和被动语态来评价和批评一个观点。同时，这句话也提供了一些描述和评价观点的词汇和短语。\n\n### 6. 练习相似句子：\n\nThe theory is remarkably convincing at first glance, but it does not illustrate how behaviors are truly formed.\n\n这个理论乍看之下非常有说服力，但它并未阐明行为是如何真正形成的。"}]},{"sentences":[{"text":"The supposed importance of influentials derives from a plausible-sounding but largely untested theory called the “two-step flow of communication” : Information flows from the media to the influentials and from them to everyone else.","explainMd":"### 1. 翻译：\n\n所谓影响者的重要性，源于一个听起来合理但基本未经检验的理论，称为“双步流通讯理论”：信息从媒体流向影响者，再从他们流向其他所有人。\n\n### 2. 词汇和短语：\n\n- **The supposed importance of influentials**：所谓影响者的重要性。\n- **derives from**：源于。\n- **a plausible-sounding but largely untested theory**：一个听起来合理但基本未经检验的理论。\n- **the “two-step flow of communication”**：双步流通讯理论。\n- **Information flows from the media to the influentials and from them to everyone else**：信息从媒体流向影响者，再从他们流向其他所有人。\n\n### 3. 句子结构：\n\n这句话是一个复合句，主语是\"The supposed importance of influentials\"，谓语动词\"derives from\"表示源于，然后引导了一个宾语从句，描述了这个重要性从何而来。\n\n### 4. 语法：\n\n- **derives from**：这是一个动词短语，表示源于。\n- **a plausible-sounding but largely untested theory**：这是一个带有并列结构的修饰词组，用来形容\"theory\"。\n- **Information flows from...to...and from...to...**：这是一个描述信息流动的复合句结构。\n\n### 5. 知识点总结：\n\n本句提供了一个例子，展示了如何在英语中使用复合句和并列结构来描述一个观点的来源。同时，这句话也提供了一些描述信息流动和理论检验的词汇和短语。\n\n### 6. 练习相似句子：\n\nThe perceived significance of leaders stems from a seemingly cogent but largely unproven hypothesis known as the \"multi-step flow model\": Insights travel from scientific research to leaders and from them to the general public.\n\n领导者的感知重要性，源于一个看似有道理但基本未经验证的假设，称为“多步流动模型”：洞察力从科学研究流向领导者，再从他们流向普罗大众。"},{"text":"Marketers have embraced the two-step flow because it suggests that if they can just find and influence the influentials, those select people will do most of the work for them.","explainMd":"### 1. 翻译：\n\n营销人员喜欢这种双步流动理论，因为它暗示了如果他们能找到并影响那些有影响力的人，那些选定的人就会为他们做大部分的工作。\n\n### 2. 词汇和短语：\n\n- **Marketers**：营销人员。\n- **have embraced the two-step flow**：喜欢这种双步流动理论。\n- **it suggests that**：它暗示了\n- **if they can just find and influence the influentials**：如果他们能找到并影响那些有影响力的人\n- **those select people will do most of the work for them**：那些选定的人就会为他们做大部分的工作。\n\n### 3. 句子结构：\n\n这是一个复杂句。主句是\"Marketers have embraced the two-step flow\"，接着是一个因为它（the two-step flow）暗示的内容，即一个条件句\"if they can just find and influence the influentials\"，最后是对应的结果句\"those select people will do most of the work for them\"。\n\n### 4. 语法：\n\n- **have embraced**：这是现在完成时态的使用，表示营销人员已经接受了这种双步流动理论。\n- **it suggests that**：这是一个it作为形式主语的结构，真正的主语是后面的宾语从句。\n- **if...will...**：这是一个条件句的结构，如果他们能找到并影响那些有影响力的人，那么那些选定的人就会为他们做大部分的工作。\n\n### 5. 知识点总结：\n\n本句提供了一个例子，展示了如何在英语中使用复杂句和条件句来描述一个观点或理论的影响和应用。同时，这句话也提供了一些描述营销策略和影响力传播的词汇和短语。\n\n### 6. 练习相似句子：\n\nAdvertisers have adopted the multi-step flow model because it indicates that if they can successfully target and sway the decision-makers, those chosen individuals will accomplish the bulk of the task on their behalf.\n\n广告商已经采用了多步流动模型，因为它表明如果他们能成功地定位并影响决策者，那些被选中的人将会代表他们完成大部分的任务。"},{"text":"The theory also seems to explain the sudden and unexpected popularity of certain looks, brands, or neighborhoods.","explainMd":"### 1. 翻译：\n\n这个理论似乎也解释了某些样式、品牌或社区的突然和意外的受欢迎。\n\n### 2. 词汇和短语：\n\n- **The theory**：这个理论。\n- **also seems to explain**：也似乎解释了。\n- **the sudden and unexpected popularity of**：突然和意外的受欢迎。\n- **certain looks, brands, or neighborhoods**：某些样式、品牌或社区。\n\n### 3. 句子结构：\n\n这是一个简单句，主语是\"The theory\"，谓语是\"also seems to explain\"，宾语是\"the sudden and unexpected popularity of certain looks, brands, or neighborhoods\"。\n\n### 4. 语法：\n\n- **also seems to explain**：这是一个动词短语，\"seems to\"表示似乎，\"also\"表示也。\n- **the sudden and unexpected popularity of**：这是一个形容词短语，用来修饰某些样式、品牌或社区的受欢迎程度。\n\n### 5. 知识点总结：\n\n本句提供了一个例子，展示了如何在英语中使用简单句和动词短语来描述一个理论的应用和解释能力。同时，这句话也提供了一些描述流行趋势和理论解释的词汇和短语。\n\n### 6. 练习相似句子：\n\nThe hypothesis also appears to account for the abrupt and surprising rise in popularity of certain diets, gadgets, or vacation spots.\n\n这个假设似乎也解释了某些饮食、小工具或度假地点的突然和惊人的受欢迎程度。"},{"text":"In many such cases, a cursory search for causes finds that some small group of people was wearing, promoting, or developing whatever it is before anyone else paid attention.","explainMd":"### 1. 翻译：\n\n在许多这样的情况下，对原因进行粗略的搜索会发现，在其他人关注之前，总有一小部分人在穿着、推广，或者是开发某些东西。\n\n### 2. 词汇和短语：\n\n- **In many such cases**：在许多这样的情况下\n- **a cursory search for causes**：对原因进行粗略的搜索\n- **finds that**：发现\n- **some small group of people**：一小部分人\n- **was wearing, promoting, or developing**：在穿着、推广或开发\n- **whatever it is before anyone else paid attention**：在其他人注意之前的任何事物\n\n### 3. 句子结构：\n\n这是一个复杂句。主句是\"a cursory search for causes finds that\"，然后是一个宾语从句\"some small group of people was wearing, promoting, or developing whatever it is before anyone else paid attention\"，其中\"before anyone else paid attention\"是一个时间状语从句。\n\n### 4. 语法：\n\n- **a cursory search for causes**：这是一个名词短语，\"for\"引导的是目的状语。\n- **finds that**：这是一个动词短语，\"that\"引导的是宾语从句。\n- **was wearing, promoting, or developing**：这是一个过去进行时的动词短语，表示在过去某个时间正在进行的动作。\n- **before anyone else paid attention**：这是一个时间状语从句，用来表示动作发生的时间。\n\n### 5. 知识点总结：\n\n本句提供了一个例子，展示了如何在英语中使用复杂句和时间状语从句来描述一个观察或发现的过程。同时，这句话也提供了一些描述搜索原因、发现结果和行为发生时间的词汇和短语。\n\n### 6. 练习相似句子：\n\nIn numerous such instances, a brief investigation for reasons reveals that a small cluster of individuals was experimenting, advocating, or innovating something before it caught anyone else's interest.\n\n在许多这样的实例中，对原因进行简短的调查会发现，在任何人对它产生兴趣之前，总有一小部分人在试验、倡导或创新某些东西。"},{"text":"Anecdotal evidence of this kind fits nicely with the idea that only certain special people can drive trends.","explainMd":"### 1. 翻译：\n\n这种轶事证据很好地符合只有某些特殊人群能引领潮流的观念。\n\n### 2. 词汇和短语：\n\n- **Anecdotal evidence**：轶事证据。\n- **of this kind**：这种类型的。\n- **fits nicely with**：很好地符合。\n- **the idea that**：观念，那就是。\n- **only certain special people**：只有某些特殊的人。\n- **can drive trends**：能引领潮流。\n\n### 3. 句子结构：\n\n这是一个简单句，主语是\"Anecdotal evidence of this kind\"，谓语是\"fits nicely with\"，宾语是\"the idea that only certain special people can drive trends\"。\n\n### 4. 语法：\n\n- **fits nicely with**：这是一个动词短语，\"fits with\"表示符合，\"nicely\"是一个副词，用来修饰动词\"fits\"。\n- **the idea that**：这是一个名词短语，\"that\"引导的是宾语从句。\n- **can drive trends**：这是一个模态动词短语，\"can\"表示能力，\"drive trends\"表示引领潮流。\n\n### 5. 知识点总结：\n\n本句提供了一个例子，展示了如何在英语中使用简单句和动词短语来描述一个观察或发现与一个观念的匹配程度。同时，这句话也提供了一些描述轶事证据、符合程度和能力的词汇和短语。\n\n### 6. 练习相似句子：\n\nCasual observation of this sort aligns well with the notion that only select unique individuals can shape fashions.\n\n这种随意的观察很好地符合只有选定的独特个体能塑造时尚的观点。"}]},{"sentences":[{"text":"In their recent work, however, some researchers have come up with the finding that influentials have far less impact on social epidemics than is generally supposed.","explainMd":"### 1. 翻译：\n\n然而，在他们最近的研究中，一些研究人员得出的发现是，影响者对社会流行病的影响远小于普遍认为的。\n\n### 2. 词汇和短语：\n\n- **In their recent work**：在他们最近的研究中。\n- **however**：然而。\n- **some researchers**：一些研究人员。\n- **have come up with the finding that**：得出了这样的发现，那就是。\n- **influentials**：影响者。\n- **have far less impact on**：对...的影响远小于。\n- **social epidemics**：社会流行病。\n- **than is generally supposed**：比普遍认为的。\n\n### 3. 句子结构：\n\n这是一个复合句。主句是\"some researchers have come up with the finding that\"，然后是一个宾语从句\"influentials have far less impact on social epidemics than is generally supposed\"。\n\n### 4. 语法：\n\n- **have come up with**：这是一个现在完成时的动词短语，表示一个已经完成的动作对现在的影响。\"come up with\"意为“得出”。\n- **the finding that**：这是一个名词短语，\"that\"引导的是宾语从句。\n- **have far less impact on**：这是一个现在完成时的动词短语，\"have impact on\"表示对...有影响，\"far less\"是一个程度副词，表示远小于。\n- **than is generally supposed**：这是一个比较级的结构，\"than\"引导的是比较的对象，\"is generally supposed\"是被动语态，表示普遍认为的。\n\n### 5. 知识点总结：\n\n本句提供了一个例子，展示了如何在英语中使用复合句和现在完成时的动词短语来描述研究人员的发现和比较级的使用。同时，这句话也提供了一些描述研究、发现、影响和比较的词汇和短语。\n\n### 6. 练习相似句子：\n\nIn their latest studies, however, several scientists have arrived at the conclusion that leaders have significantly less influence on societal trends than is commonly believed.\n\n然而，在他们最近的研究中，一些科学家得出的结论是，领导者对社会趋势的影响远小于通常所认为的。"},{"text":"In fact, they don’t seem to be required at all.","explainMd":"### 1. 翻译：\n\n事实上，他们似乎根本就不需要。\n\n### 2. 词汇和短语：\n\n- **In fact**：事实上。\n- **they**：他们。\n- **don’t seem to be**：似乎不是。\n- **required at all**：根本就不需要。\n\n### 3. 句子结构：\n\n这是一个简单句，主语是\"they\"，谓语是\"don’t seem to be required at all\"。\n\n### 4. 语法：\n\n- **don’t seem to be**：这是一个否定的动词短语，\"seem to be\"表示似乎是，前面加上\"don’t\"表示否定。\n- **required at all**：这是一个被动语态的动词短语，\"required\"表示需要，\"at all\"是一个副词短语，表示根本。\n\n### 5. 知识点总结：\n\n本句提供了一个例子，展示了如何在英语中使用简单句和否定的动词短语来表示一个事物的不需要性。同时，这句话也提供了一些描述事实、否定和需要性的词汇和短语。\n\n### 6. 练习相似句子：\n\nIn reality, they don't appear to be necessary at all.\n\n实际上，他们似乎根本就不必要。"}]},{"sentences":[{"text":"The researchers’ argument stems from a simple observation about social influence: With the exception of a few celebrities like Oprah Winfrey—whose outsize presence is primarily a function of media, not interpersonal, influence—even the most influential members of a population simply don’t interact with that many others.","explainMd":"### 1. 翻译：\n\n研究者的论点源于对社会影响的一个简单观察：除了像奥普拉·温弗瑞这样的少数名人——她的超大影响力主要是媒体的功能，而不是人际影响——即使是人口中最有影响力的成员也不会与那么多其他人进行互动。\n\n### 2. 词汇和短语：\n\n- **The researchers’ argument**：研究者的论点。\n- **stems from**：源于。\n- **a simple observation about**：对...的一个简单观察。\n- **social influence**：社会影响。\n- **With the exception of**：除了。\n- **a few celebrities like**：像...这样的少数名人。\n- **whose outsize presence is primarily a function of**：她的超大影响力主要是...的功能。\n- **media, not interpersonal, influence**：媒体的影响，而不是人际影响。\n- **even the most influential members of a population**：即使是人口中最有影响力的成员。\n- **simply don’t interact with that many others**：简单地说，不会与那么多其他人进行互动。\n\n### 3. 句子结构：\n\n这是一个复杂的复合句。主句是\"The researchers’ argument stems from a simple observation about social influence\"，然后有一个\"With the exception of...\"引导的状语从句，这个状语从句中又包含了一个非限制性定语从句\"whose outsize presence is primarily a function of media, not interpersonal, influence\"。\n\n### 4. 语法：\n\n- **stems from**：这是一个动词短语，表示源于。\n- **With the exception of**：这是一个固定短语，表示除了。\n- **whose outsize presence is primarily a function of**：这是一个非限制性定语从句，\"whose\"是关系代词，\"is primarily a function of\"是谓语。\n- **even the most influential members of a population**：这是一个表示程度的短语，\"even\"表示甚至，\"the most\"表示最...的。\n- **simply don’t interact with that many others**：这是一个否定的动词短语，\"interact with\"表示与...进行互动，\"don’t\"表示否定，\"simply\"是一个副词，表示简单地。\n\n### 5. 知识点总结：\n\n本句提供了一个例子，展示了如何在英语中使用复杂的复合句和动词短语来描述研究者的论点和社会影响的观察。同时，这句话也提供了一些描述研究、论点、社会影响、名人、媒体影响、人际影响和互动的词汇和短语。\n\n### 6. 练习相似句子：\n\nThe scientists' hypothesis originates from a basic observation about societal influence: Apart from a handful of public figures like Elon Musk—whose immense impact is largely a product of media, not personal, influence—even the most influential individuals in a society simply don't engage with that many others.\n\n科学家们的假设来源于对社会影响的一个基本观察：除了像埃隆·马斯克这样的少数公众人物——他们的巨大影响力主要是媒体的产品，而不是个人影响——即使是社会中最有影响力的个人也只是简单地与许多其他人进行互动。"},{"text":"Yet it is precisely these non-celebrity influentials who, according to the two-step-flow theory, are supposed to drive social epidemics, by influencing their friends and colleagues directly.","explainMd":"### 1. 翻译：\n\n然而，正是这些非名人的有影响力的人，根据两步流理论，他们应该通过直接影响他们的朋友和同事来推动社会流行病的发生。\n\n### 2. 词汇和短语：\n\n- **Yet**：然而。\n- **it is precisely these**：正是这些。\n- **non-celebrity influentials**：非名人的有影响力的人。\n- **who, according to the two-step-flow theory, are supposed to**：根据两步流理论，他们应该。\n- **drive social epidemics**：推动社会流行病的发生。\n- **by influencing their friends and colleagues directly**：通过直接影响他们的朋友和同事。\n\n### 3. 句子结构：\n\n这是一个复杂的复合句。主句是\"it is precisely these non-celebrity influentials who are supposed to drive social epidemics\"，然后有一个\"according to the two-step-flow theory\"引导的状语从句，以及一个\"by influencing their friends and colleagues directly\"引导的方式状语从句。\n\n### 4. 语法：\n\n- **it is precisely these**：这是一个强调句型，\"it is...who...\"，强调的是\"these non-celebrity influentials\"。\n- **who, according to the two-step-flow theory, are supposed to**：这是一个非限制性定语从句，\"who\"是关系代词，\"are supposed to\"表示应该。\n- **drive social epidemics**：这是一个动词短语，\"drive\"表示推动，\"social epidemics\"表示社会流行病。\n- **by influencing their friends and colleagues directly**：这是一个方式状语从句，\"by\"表示通过，\"influencing their friends and colleagues directly\"表示直接影响他们的朋友和同事。\n\n### 5. 知识点总结：\n\n本句提供了一个例子，展示了如何在英语中使用复杂的复合句和动词短语来描述非名人的有影响力的人如何推动社会流行病的发生。同时，这句话也提供了一些描述名人、有影响力的人、两步流理论、社会流行病、影响、朋友和同事的词汇和短语。\n\n### 6. 练习相似句子：\n\nHowever, it is exactly these non-famous influencers who, according to the diffusion of innovations theory, are expected to propel societal trends, by having a direct effect on their peers and associates.\n\n然而，正是这些非名人的影响者，根据创新的扩散理论，他们应该通过对他们的同伴和关系人直接产生影响来推动社会趋势。"},{"text":"For a social epidemic to occur, however, each person so affected must then influence his or her own acquaintances, who must in turn influence theirs, and so on; and just how many others pay attention to each of these people has little to do with the initial influential.","explainMd":"### 1. 翻译：\n\n然而，要发生社会流行病，每个受影响的人必须影响他或她自己的熟人，这些熟人又必须影响他们的熟人，如此反复；而每个人关注这些人的其他人的数量，与最初的影响者关系不大。\n\n### 2. 词汇和短语：\n\n- **For a social epidemic to occur**：要发生社会流行病。\n- **however**：然而。\n- **each person so affected**：每个受影响的人。\n- **must then influence his or her own acquaintances**：必须影响他或她自己的熟人。\n- **who must in turn influence theirs, and so on**：这些熟人又必须影响他们的熟人，如此反复。\n- **just how many others pay attention to each of these people**：每个人关注这些人的其他人的数量。\n- **has little to do with the initial influential**：与最初的影响者关系不大。\n\n### 3. 句子结构：\n\n这是一个复杂的复合句。主句是\"For a social epidemic to occur, each person so affected must then influence his or her own acquaintances\"，然后有一个\"who must in turn influence theirs, and so on\"引导的定语从句，以及一个\"and just how many others pay attention to each of these people has little to do with the initial influential\"的并列句。\n\n### 4. 语法：\n\n- **For a social epidemic to occur**：这是一个目的状语，\"for\"表示为了，\"a social epidemic to occur\"表示发生社会流行病。\n- **each person so affected**：这是一个定语从句，\"so\"表示如此，\"affected\"表示受影响的。\n- **must then influence his or her own acquaintances**：这是一个动词短语，\"must\"表示必须，\"influence his or her own acquaintances\"表示影响他或她自己的熟人。\n- **who must in turn influence theirs, and so on**：这是一个定语从句，\"who\"是关系代词，\"must in turn influence theirs\"表示必须反过来影响他们的。\n- **just how many others pay attention to each of these people**：这是一个疑问词引导的名词性从句，作为主语。\n- **has little to do with the initial influential**：这是一个动词短语，\"has little to do with\"表示与...关系不大。\n\n### 5. 知识点总结：\n\n本句提供了一个例子，展示了如何在英语中使用复杂的复合句和动词短语来描述社会流行病的发生和人们的影响。同时，这句话也提供了一些描述社会流行病、影响、熟人、注意、数量、最初的影响者的词汇和短语。\n\n### 6. 练习相似句子：\n\nFor a trend to become widespread, each person impacted must then affect their own contacts, who must subsequently influence theirs, and so forth; and the number of others who heed each of these people has minor relevance to the original influencer.\n\n对于一种趋势要变得广泛，每个受影响的人必须影响他们自己的联系人，这些联系人必须随后影响他们的联系人，如此反复；而关注这些人的其他人的数量，与最初的影响者的关系微乎其微。"},{"text":"If people in the network just two degrees removed from the initial influential prove resistant, for example, the cascade of change won’t propagate very far or affect many people.","explainMd":"### 1. 翻译：\n\n例如，如果网络中距离最初的影响者只有两度的人证明抵抗，那么变化的连锁反应就不会传播得很远或影响到许多人。\n\n### 2. 词汇和短语：\n\n- **If people in the network just two degrees removed from the initial influential prove resistant**：如果网络中距离最初的影响者只有两度的人证明抵抗。\n- **for example**：例如。\n- **the cascade of change**：变化的连锁反应。\n- **won’t propagate very far or affect many people**：不会传播得很远或影响到许多人。\n\n### 3. 句子结构：\n\n这是一个条件句，主句是\"the cascade of change won’t propagate very far or affect many people\"，条件从句是\"If people in the network just two degrees removed from the initial influential prove resistant\"。\n\n### 4. 语法：\n\n- **If people in the network just two degrees removed from the initial influential prove resistant**：这是一个条件状语从句，\"if\"表示如果，\"people in the network just two degrees removed from the initial influential prove resistant\"表示网络中距离最初的影响者只有两度的人证明抵抗。\n- **the cascade of change**：这是一个名词短语，\"cascade\"表示连锁反应，\"of change\"表示的变化。\n- **won’t propagate very far or affect many people**：这是一个动词短语，\"won’t propagate very far\"表示不会传播得很远，\"or affect many people\"表示或影响到许多人。\n\n### 5. 知识点总结：\n\n本句提供了一个例子，展示了在英语中如何使用条件句和动词短语来描述网络中人的影响和变化的连锁反应。同时，这句话也提供了一些描述网络、距离、影响者、抵抗、连锁反应、传播、远、影响、许多人的词汇和短语。\n\n### 6. 练习相似句子：\n\nIf individuals in the network just three steps away from the original influencer appear immune, for instance, the ripple of transformation won't spread widely or touch many lives.\n\n例如，如果网络中距离原始影响者只有三步的个体显得免疫，那么变革的涟漪就不会广泛传播或触及许多生活。"}]},{"sentences":[{"text":"Building on the basic truth about interpersonal influence, the researchers studied the dynamics of social influence by conducting thousands of computer simulations of populations, manipulating a number of variables relating to people’s ability to influence others and their tendency to be influenced.","explainMd":"### 1. 翻译：\n\n研究人员基于人际影响的基本真理，通过进行数千次的人口计算机模拟研究社会影响的动态，操纵了与人们影响他人的能力和受他人影响的倾向相关的一些变量。\n\n### 2. 词汇和短语：\n\n- **Building on the basic truth about interpersonal influence**：基于人际影响的基本真理。\n- **the researchers studied the dynamics of social influence**：研究人员研究了社会影响的动态。\n- **by conducting thousands of computer simulations of populations**：通过进行数千次的人口计算机模拟。\n- **manipulating a number of variables relating to people’s ability to influence others and their tendency to be influenced**：操纵了与人们影响他人的能力和受他人影响的倾向相关的一些变量。\n\n### 3. 句子结构：\n\n这是一个复杂的长句。主句是\"the researchers studied the dynamics of social influence\"，然后有一个\"by conducting thousands of computer simulations of populations\"引导的方式状语从句，以及一个\"manipulating a number of variables relating to people’s ability to influence others and their tendency to be influenced\"的并列句。\n\n### 4. 语法：\n\n- **Building on the basic truth about interpersonal influence**：这是一个介词短语，\"building on\"表示基于，\"the basic truth about interpersonal influence\"表示人际影响的基本真理。\n- **the researchers studied the dynamics of social influence**：这是一个动词短语，\"studied\"是动词，\"the dynamics of social influence\"是宾语。\n- **by conducting thousands of computer simulations of populations**：这是一个方式状语从句，\"by\"表示通过，\"conducting thousands of computer simulations of populations\"表示进行数千次的人口计算机模拟。\n- **manipulating a number of variables relating to people’s ability to influence others and their tendency to be influenced**：这是一个并列句，\"manipulating\"是动词，\"a number of variables relating to people’s ability to influence others and their tendency to be influenced\"是宾语。\n\n### 5. 知识点总结：\n\n本句提供了一个例子，展示了在英语中如何使用复杂的长句和动词短语来描述研究人员如何研究社会影响的动态。同时，这句话也提供了一些描述基本真理、人际影响、研究、动态、计算机模拟、人口、操纵、变量、影响他人的能力、受他人影响的倾向的词汇和短语。\n\n### 6. 练习相似句子：\n\nBased on the fundamental concept of peer pressure, the scientists investigated the patterns of social control by running numerous computer simulations of communities, adjusting several variables associated with individuals' capacity to control others and their susceptibility to be controlled.\n\n基于同伴压力的基本概念，科学家们通过运行大量关于社区的计算机模拟，研究了社会控制的模式，调整了一些与个体控制他人的能力和易受他人控制的倾向相关的变量。"},{"text":"They found that the principal requirement for what is called “global cascades” —the widespread propagation of influence through networks—is the presence not of a few influentials but, rather, of a critical mass of easily influenced people.","explainMd":"### 1. 翻译：\n\n他们发现，被称为\"全球级连锁反应\"（即影响力在网络中的广泛传播）的主要需求不是少数影响者的存在，而是一大批容易受影响的人的存在。\n\n### 2. 词汇和短语：\n\n- **They found that**：他们发现。\n- **the principal requirement for what is called “global cascades”**：被称为\"全球级连锁反应\"的主要需求。\n- **the widespread propagation of influence through networks**：影响力在网络中的广泛传播。\n- **is the presence not of a few influentials but, rather, of a critical mass of easily influenced people**：不是少数影响者的存在，而是一大批容易受影响的人的存在。\n\n### 3. 句子结构：\n\n这是一个复杂句。主句是\"They found that the principal requirement for what is called “global cascades” is the presence not of a few influentials but, rather, of a critical mass of easily influenced people\"，其中有一个定义从句\"what is called “global cascades”\"，以及一个解释从句\"the widespread propagation of influence through networks\"。\n\n### 4. 语法：\n\n- **They found that**：这是一个宾语从句的引导词，\"they found\"是主句，\"that\"引导宾语从句。\n- **the principal requirement for what is called “global cascades”**：这是一个含有定义从句的复合名词短语，\"the principal requirement for\"表示的主要需求，\"what is called “global cascades”\"是定义从句，解释了\"global cascades\"的含义。\n- **the widespread propagation of influence through networks**：这是一个名词短语，\"the widespread propagation of influence\"表示影响力的广泛传播，\"through networks\"表示在网络中。\n- **is the presence not of a few influentials but, rather, of a critical mass of easily influenced people**：这是一个含有并列结构的谓语短语，\"is the presence\"是谓语，\"not of a few influentials but, rather, of a critical mass of easily influenced people\"表示不是少数影响者的存在，而是一大批容易受影响的人的存在。\n\n### 5. 知识点总结：\n\n本句提供了一个例子，展示了在英语中如何使用复杂句和并列结构来描述研究发现。同时，这句话也提供了一些描述发现、主要需求、全球级连锁反应、广泛传播、影响力、网络、存在、少数、影响者、一大批、容易受影响的人的词汇和短语。\n\n### 6. 练习相似句子：\n\nThey discovered that the key condition for what is referred to as \"massive spread\" — the extensive dispersion of ideas across communities — is not the existence of a few opinion leaders, but rather, a large group of easily persuaded individuals.\n\n他们发现，被称为\"大规模传播\"（即思想在社区中的广泛分散）的关键条件并不是少数意见领袖的存在，而是一大群容易被说服的个体的存在。"}]}],"title":""}