{"translate":"","paragraphs":[{"sentences":[{"text":"We tend to think of the decades immediately following World War II as a time of prosperity and growth, with soldiers returning home by the millions, going off to college on the G.I.Bill and lining up at the marriage bureaus.","explainMd":"**1. 翻译**\n\n\"我们倾向于把二战后的几十年视为繁荣和增长的时期，数百万士兵回家，依靠G.I. Bill去上大学，并在婚姻登记处排队。\"\n\n**2. 词汇和短语**\n\n- Tend to: 倾向于，意指有某种倾向或习惯。\n- The decades immediately following World War II: 二战后的几十年，指的是二战结束后的那段时期。\n- A time of prosperity and growth: 繁荣和增长的时期，指经济、社会等方面都在快速发展和进步的时间段。\n- Soldiers returning home: 士兵们回家，指的是战争结束后，士兵们结束服役回到家乡。\n- Going off to college: 去上大学，表示去参加大学教育的活动。\n- On the G. I. Bill: 依靠G.I. Bill，G.I. Bill是美国政府为二战后的退伍军人提供的一项福利，包括教育和住房等援助。\n- Lining up at the marriage bureaus: 在婚姻登记处排队，指的是准备注册结婚的行为。\n\n**3. 句子结构**\n\n这是一个复杂句，其结构为：主句 + 并列句。具体分析如下：\n\n主句：We tend to think of the decades immediately following World War II as a time of prosperity and growth，这是句子的主要部分，表示我们通常将二战后的几十年视为繁荣和增长的时期这一观点。\n\n并列句：with soldiers returning home by the millions, going off to college on the G. I.Bill and lining up at the marriage bureaus，这部分并列于主句，进一步提出了二战后士兵们的主要活动，如回家、上大学和结婚。\n\n**4. 语法分析**\n\n这句话主要使用了现在时态的动词形式，表示现在的倾向或习惯。\"We tend to\"后面跟的是动词原形，表示一种倾向或习惯。然后，\"with\"引导的并列句则使用了现在分词（returning, going, lining up），表示并列的动作或状态。\n\n**5. 知识点总结**\n\n1. **\"tend to\"的用法**：这个词组表示有某种倾向或习惯，后面通常接动词原形。在这句话中，\"We tend to think of the decades...\"就使用了\"tend to\"。另一个例子可以是：\"I tend to drink coffee in the morning.\"（我倾向于早上喝咖啡。）\n\n1. **现在分词作伴随状语的用法**：现在分词可以用来表示伴随主句发生的动作或状态，常常用\"with\"引导。在这句话中，\"with soldiers returning home...\"就是一个例子。另一个例子可以是：\"She walked in the park, with her dog running beside her.\"（她在公园里散步，她的狗在她旁边跑。）\n\n**6. 练习相似句子**\n\n- We tend to think of the years immediately following the economic recession as a time of recovery and growth, with workers finding new jobs by the thousands, entering into industries on government support and lining up at employment agencies.\n- 我们倾向于把经济衰退后的几年视为恢复和增长的时期，成千上万的工人找到新的工作，依靠政府支持进入各个行业，并在就业机构排队。"}]},{"sentences":[{"text":"But when it came to their houses, it was a time of common sense and a belief that less could truly be more.","explainMd":"**1. 翻译：**\n\n但是当涉及到他们的住房时，那是一个讲究实用和坚信少即是多的时代。\n\n**2. 词汇和短语：**\n\n- Houses：房屋，住宅。\n- Common sense：常识，实用。\n- A belief：一种信念。\n- Less could truly be more：少即是多，表示简洁、高效的理念。\n\n**3. 句子结构：**\n\n这是一个简单句，主谓宾形式。具体分析如下：\n\n主语：It，代指那个时代或环境。\n谓语：was。\n宾语：a time of common sense and a belief that less could truly be more。\n\n**4. 语法分析：**\n\n这句话的主语是\"It\"，代指的是当时的社会环境或时代背景。谓语\"was\"是be动词的过去时，表示状态。宾语是\"a time of common sense and a belief that less could truly be more\"，描述的是那个时代的特点或特征。\n\n**5. 知识点总结：**\n\n1. **主谓宾结构**：这是英语句子的基本结构，即每个句子都必须有主语、谓语和宾语。在这个句子中，主语是\"It\"，谓语是\"was\"，宾语是\"a time of common sense and a belief that less could truly be more\"。\n\n1. **抽象名词的使用**：在这个句子中，\"a time of common sense and a belief that less could truly be more\"是一个使用了很多抽象名词的表达，通过这些抽象名词，表达了那个时代的特点和特征。\n\n**6. 练习相似句子：**\n\n英文：When it comes to their education, it is a period of innovation and a conviction that hands-on experience could truly be valuable.\n中文：当涉及到他们的教育时，那是一个注重创新，坚信实践经验能够真正带来价值的时期。"},{"text":"During the Depression and the war, Americans had learned to live with less, and that restraint, in combination with the postwar confidence in the future, made small, efficient housing positively stylish.","explainMd":"**1. 翻译：**\n\n在大萧条和战争期间，美国人学会了用更少的资源生活，这种节制，结合战后对未来的信心，使得小型、高效的住房变得极具时尚感。\n\n**2. 词汇和短语：**\n\n- During the Depression and the war：在大萧条和战争期间\n- Americans：美国人\n- Had learned to live with less：学会了用更少的资源生活\n- Restraint：节制，克制\n- In combination with：结合\n- Postwar confidence in the future：战后对未来的信心\n- Made small, efficient housing positively stylish：使得小型、高效的住房变得极具时尚感\n\n**3. 句子结构：**\n\n这是一个复合句，其结构为：主句+并列的状语从句。具体分析如下：\n\n主句：Americans had learned to live with less.\n宾语从句：that restraint, in combination with the postwar confidence in the future, made small, efficient housing positively stylish.\n\n**4. 语法分析：**\n\n在这句话中，主句的主语是\"Americans\"，谓语是\"had learned\"，宾语是\"to live with less\"。从句的主语是\"restraint\"，谓语是\"made\"，宾语是\"small, efficient housing\"。\"in combination with the postwar confidence in the future\"是一个介词短语，作为整个从句的状语，修饰\"restraint\"。\n\n**5. 知识点总结：**\n\n1. **过去完成时态**：这句话的主句使用了过去完成时态（\"had learned\"），表示在过去的某个时间点之前已经完成的动作或状态。例如，在这个例子中，\"Americans had learned to live with less\"表示在某个过去的时间点（大萧条和战争期间）之前，美国人已经学会了用更少的资源生活。\n\n1. **宾语从句**：这句话的宾语从句（\"that restraint, in combination with the postwar confidence in the future, made small, efficient housing positively stylish\"）用来解释主句中的内容。在这个例子中，宾语从句解释了美国人为何学会了用更少的资源生活。\n\n**6. 练习相似句子：**\n\n英文：During the economic crisis, people had learned to save more, and that thrift, coupled with the post-crisis optimism, made frugal lifestyle quite appealing.\n中文：在经济危机期间，人们学会了更多地储蓄，这种节俭，结合危机后的乐观态度，使得节俭的生活方式变得颇具吸引力。"}]},{"sentences":[{"text":"Economic condition was only a stimulus for the trend toward efficient living.","explainMd":"**1. 翻译：**\n\n“经济状况只是推动高效生活趋势的一种刺激。”\n\n**2. 词汇和短语：**\n\n- Economic condition：经济状况\n- Only：只是\n- A stimulus：一种刺激\n- For the trend：对于趋势\n- Toward efficient living：向高效生活\n\n**3. 句子结构：**\n\n这是一个简单句，其结构为：主语+谓语+宾语。具体分析如下：\n\n- 主语：Economic condition\n- 谓语：was\n- 宾语：only a stimulus for the trend toward efficient living\n\n**4. 语法分析：**\n\n在这句话中，主语是\"Economic condition\"，谓语是\"was\"，宾语是\"only a stimulus for the trend toward efficient living\"。\"For the trend toward efficient living\"是一个介词短语，作为整个句子的宾语，修饰\"stimulus\"。\n\n**5. 知识点总结：**\n\n1. **简单句的结构**：这是一个简单句，只包含一个主语和一个谓语。这种句型相对简单，适用于表达单一的观点或事实。例如，在这个例子中，\"Economic condition was only a stimulus for the trend toward efficient living\"这句话就是表达经济状况只是推动高效生活趋势的一种刺激这一观点。\n\n1. **介词短语的用法**：在这句话中，\"for the trend toward efficient living\"是一个介词短语，作为宾语来修饰\"stimulus\"。介词短语可以用来添加更多的信息，以阐述或解释主要的句子元素。例如，在这个例子中，\"for the trend toward efficient living\"解释了\"stimulus\"的具体内容。\n\n**6. 练习相似句子：**\n\n英文：The technological advancement was just a catalyst for the shift towards digital learning.\n中文：技术进步只是推动向数字学习转变的催化剂。"},{"text":"The phrase “less is more” was actually first popularized by a German, the architect Ludwig Mies van der Rohe, who like other people associated with the Bauhaus, a school of design, emigrated to the United States before World War II and took up posts at American architecture schools.","explainMd":"**1. 翻译**\n\n“少即是多”这个词组其实最早是由一位德国人，建筑师路德维希·密斯·凡·德·罗赫普及。他和其他一些与包豪斯设计学派有关的人一样，在二战前移民到了美国，并在美国的建筑学校里担任职务。\n\n**2. 词汇和短语**\n\n- Phrase: 词组, 例如 \"less is more\"（少即是多）\n- Popularized: 普及，例如 \"The Internet has popularized the use of email.\"（互联网已使电子邮件的使用普及。）\n- German: 德国人\n- Architect: 建筑师\n- Ludwig Mies van der Rohe: 路德维希·密斯·凡·德·罗赫，著名的德国建筑师\n- Associated: 关联，例如 \"She is associated with the project.\"（她与这个项目有关。）\n- Bauhaus: 包豪斯，一所著名的设计学派\n- Emigrated: 移民，例如 \"Many people emigrated from Europe to America in the 19th century.\"（19世纪，很多人从欧洲移民到美国。）\n- United States: 美国\n- World War II: 二战\n- American architecture schools: 美国建筑学校\n\n**3. 句子结构**\n\n这是一个复杂句，其结构为：主句 + 非限制性定语从句。具体分析如下：\n\n- 主句：The phrase “less is more” was actually first popularized by a German, the architect Ludwig Mies van der Rohe.\n  这个词组“少即是多”其实最早是由一位德国人普及的，他就是建筑师路德维希·密斯·凡·德·罗赫。\n\n- 非限制性定语从句：who like other people associated with the Bauhaus, a school of design, emigrated to the United States before World War II and took up posts at American architecture schools.\n  和其他一些与包豪斯设计学派有关的人一样，他在二战前移民到了美国，并在美国的建筑学校里担任职务。\n\n**4. 语法分析**\n\n这句话是一个复合句，其中包含一个主句和一个非限制性定语从句。主句中的主语是\"The phrase 'less is more'\"，谓语是\"was popularized\"，宾语是\"a German, the architect Ludwig Mies van der Rohe\"。非限制性定语从句通过\"who\"引导，对前面的\"German, the architect Ludwig Mies van der Rohe\"进行了进一步的描述和补充。\n\n**5. 知识点总结**\n\n1. **非限制性定语从句的使用**: 非限制性定语从句通过提供额外的信息来对句子的某一部分进行补充说明或描述，但它并不限制那一部分的意义。在这个句子中，\"who like other people associated with the Bauhaus, a school of design, emigrated to the United States before World War II and took up posts at American architecture schools.\" 就是一个非限制性定语从句，对\"a German, the architect Ludwig Mies van der Rohe\"提供了额外的信息。\n\n1. **特定的词汇和短语的使用**: 了解和学习特定的词汇和短语，例如\"popularized\"（普及），\"emigrated\"（移民）等，可以帮助我们更准确、生动地表达思想和观点。\n\n**6. 练习相似句子**\n\nThe concept of \"sustainable development\" was first popularizedby a Norwegian, the politician Gro Harlem Brundtland, who like other people associated with the World Commission on Environment and Development, introduced this term in the report \"Our Common Future\" before the end of the Cold War and took up significant roles in global environmental policy making.\n\n**译文**：\n\n“可持续发展”的概念其实最早是由一位挪威人，政治家格罗·哈莱姆·布伦特兰普及的。她和其他一些与世界环境与发展委员会有关的人一样，在冷战结束前在报告“我们共同的未来”中引入了这个术语，并在全球环境政策制定中担任重要职务。"},{"text":"These designers came to exert enormous influence on the course of American architecture, but none more so than Mies.","explainMd":"**句子讲解**\n\n**1. 翻译：**\n\n\"这些设计师对美国建筑的发展产生了巨大的影响，但最有影响力的无疑是密斯。\"\n\n**2. 词汇和短语：**\n\n- Designers: 设计师\n- Exert: 施加，产生（影响）\n- Enormous: 巨大的\n- Influence: 影响\n- Course: 进程，过程\n- Architecture: 建筑学\n- None: 无一，没有\n- More so: 更甚\n\n**3. 句子结构：**\n\n这是一个简单句，其结构为：主语 + 谓语 + 宾语。具体分析如下：\n\n- 主语：These designers（这些设计师）\n- 谓语：came to exert（开始施加）\n- 宾语：enormous influence on the course of American architecture（对美国建筑进程的巨大影响）\n- 补充状语：but none more so than Mies（但最有影响力的无疑是密斯）\n\n**4. 语法分析：**\n\n这个句子的关键动词是\"came to exert\"，\"came to\"是一个常用短语，意味着“开始……”，后面接动词原形。\"enormous influence on the course of American architecture\"是这个动词的宾语，表示这些设计师开始在美国建筑的进程上产生巨大影响。\"but none more so than Mies\"是一个并列结构，用来强调在这些设计师中，密斯的影响力最大。\n\n**5. 知识点总结：**\n\n1. **\"came to\"的使用**：这是一个表达开始进行某种行为或状态的短语，表示过渡到新的状态或行为。例如：\"He came to understand the truth.\"（他开始理解这个事实。）\n1. **\"none more so than\"的使用**：这是一个常用的表达方式，用来强调在一组事物或人中，某个事物或人的特性最突出。例如：\"All the students are diligent, none more so than Jack.\"（所有的学生都勤奋，但杰克最勤奋。）\n\n**6. 练习相似句子：**\n\n- \"Many writers have left their mark on the literary world, but none more so than Shakespeare.\"\n- \"很多作家在文学世界留下了他们的印记，但最有影响力的无疑是莎士比亚。\""}]},{"sentences":[{"text":"Mies’s signature phrase means that less decoration, properly organized, has more impact than a lot.","explainMd":"**句子讲解**\n\n**1. 翻译：**\n\n\"Mies的标志性格言意味着，少量但组织良好的装饰比大量的装饰产生更大的影响。\"\n\n**2. 词汇和短语：**\n\n- Signature phrase: 标志性格言\n- Means: 意味着\n- Less decoration: 少量装饰\n- Properly organized: 组织良好的\n- More impact: 更大的影响\n- Than a lot: 比大量的\n\n**3. 句子结构：**\n\n这是一个简单句，其结构为：主语 + 谓语 + 宾语。具体分析如下：\n\n- 主语：Mies’s signature phrase（Mies的标志性格言）\n- 谓语：means（意味着）\n- 宾语：that less decoration, properly organized, has more impact than a lot（少量但组织良好的装饰比大量的装饰产生更大的影响）\n\n**4. 语法分析：**\n\n这个句子的关键动词是\"means\"，后面接的是一个由\"that\"引导的宾语从句。在这个宾语从句中，\"less decoration, properly organized,\"是主语，\"has\"是谓语，\"more impact than a lot\"是宾语。\"more...than...\"是一个常用的比较级结构，用来比较两者之间的差别。\n\n**5. 知识点总结：**\n\n1. **\"signature phrase\"的使用**：这是一个常用的表达方式，表示某人的标志性格言或者最著名的说法。例如：\"His signature phrase is 'Yes, we can.'\"（他的标志性格言是“是的，我们能。”）\n1. **\"means\"的使用**：这是一个常用的动词，表示“意味着”，后面通常接名词、代词或者由\"that\"引导的宾语从句。例如：\"This means a lot to me.\"（这对我来说意味着很多。）\n1. **\"more...than...\"的使用**：这是一个常用的比较级结构，表示“比……更……”，用来比较两者之间的差别。例如：\"He is more diligent than his brother.\"（他比他的哥哥更勤奋。）\n\n**6. 练习相似句子：**\n\n- \"The teacher's motto means that hard work, if persisted in, brings more success than mere talent.\"\n- \"老师的座右铭意味着，如果坚持下来，努力工作比单纯的天赋带来更多的成功。\""},{"text":"Elegance, he believed, did not derive from abundance.","explainMd":"**句子讲解**\n\n**1. 翻译：**\n\n\"他相信，真正的优雅并不源于过多。\"\n\n**2. 词汇和短语：**\n\n- Elegance: 优雅\n- Believed: 相信\n- Did not derive from: 并不源于\n- Abundance: 过多，丰富\n\n**3. 句子结构：**\n\n这是一个简单句，其结构为：主语 + 谓语 + 宾语。具体分析如下：\n\n- 主语：Elegance（优雅）\n- 谓语：did not derive from（并不源于）\n- 宾语：abundance（过多）\n\n**4. 语法分析：**\n\n句子的主要动词是\"derive from\"，意为\"源于\"，在此被否定形式\"did not\"修饰。句子的主语是名词\"elegance\"（优雅），宾语是名词\"abundance\"（过多）。此句表达的是主语（优雅）并不源于宾语（过多）的观点。\n\n**5. 知识点总结：**\n\n1. **\"derive from\"的使用**：这是一个常用的短语，表示“源于”，用来指出某事物的来源或起源。例如：\"The word 'universe' derives from Latin.\"（'universe'这个词源于拉丁语。）\n\n1. **\"did not\"的使用**：这是“did”的否定形式，表示过去的否定。例如：\"He did not go to the party.\"（他没有去那个派对。）\n\n1. **\"elegance\"和\"abundance\"的使用**：这两个名词表示的都是抽象的概念，分别是“优雅”和“过多”。例如：\"Her dress has a simple elegance.\"（她的裙子有一种简单的优雅。）\"There is an abundance of food at the party.\"（派对上的食物丰富多样。）\n\n**6. 练习相似句子：**\n\n- \"Happiness, she believed, did not derive from material wealth.\"\n- \"她相信，幸福并不源于物质财富。\""},{"text":"Like other modern architects, he employed metal, glass and laminated wood—materials that we take for granted today but that in the 1940s symbolized the future.","explainMd":"**句子讲解**\n\n**1. 翻译：**\n\n\"与其他现代建筑师一样，他使用了金属、玻璃和层压木——这些材料我们今天视为理所当然，但在20世纪40年代，这些材料象征着未来。\"\n\n**2. 词汇和短语：**\n\n- Modern architects: 现代建筑师\n- Employed: 使用，采用\n- Metal, glass, and laminated wood: 金属、玻璃和层压木\n- Take for granted: 认为理所当然\n- Symbolized: 象征\n\n**3. 句子结构：**\n\n这是一个复合句，其结构为：主句 + 宾语从句。具体分析如下：\n\n主句：Like other modern architects, he employed metal, glass and laminated wood\n\n- 主语：他（指的是上文中提到的建筑师）\n- 谓语：employed（使用，采用）\n- 宾语：metal, glass and laminated wood（金属、玻璃和层压木）\n- 状语：Like other modern architects（与其他现代建筑师一样）\n\n宾语从句：materials that we take for granted today but that in the 1940s symbolized the future\n\n- 主语：materials（材料）\n- 谓语：take for granted（认为理所当然），symbolized（象征）\n- 宾语：today（今天），the future（未来）\n- 连接词：that，but（但是）\n\n**4. 语法分析：**\n\n主句的主要动词是\"employed\"，意为\"使用、采用\"，主要宾语是\"metal, glass and laminated wood\"（金属、玻璃和层压木）。而宾语从句的主要动词分别是\"take for granted\"（认为理所当然）和\"symbolized\"（象征），主语是\"materials\"（材料），而\"today\"（今天）和\"the future\"（未来）是宾语。\n\n**5. 知识点总结：**\n\n1. **\"Like other...\"的使用**：这是一个常用的短语，用来表达某人或某事物与其他相似的人或事物的相似性。例如：\"Like other children, he loves playing games.\"（像其他孩子一样，他喜欢玩游戏。）\n1. **\"take for granted\"的使用**：这是一个常用的短语，表示不把某事当做是特别或值得注意的，而是认为它是理所当然的。例如：\"Don't take your health for granted.\"（不要认为健康是理所当然的。）\n1. **\"symbolized\"的使用**：这个词指的是某物象征或代表另一种事物或想法。例如：\"The dove symbolizes peace.\"（鸽子象征和平。）\n\n**6. 练习相似句子：**\n\n- \"Like other successful entrepreneurs, she adopted a growth mindset, which we take for granted today but that in the 1980s symbolized a progressive approach to business.\"\n- \"像其他成功的企业家一样，她采用了成长型思维，这种思维我们今天认为理所当然，但在20世纪80年代，它象征着对商业的前进式方法。\""},{"text":"Mies’s sophisticated presentation masked the fact that the spaces he designed were small and efficient, rather than big and often empty.","explainMd":"**句子讲解**\n\n**1. 翻译：**\n\n\"Mies的精致呈现掩盖了他设计的空间其实小而高效，而非大而通常空荡荡的事实。\"\n\n**2. 词汇和短语：**\n\n- Sophisticated presentation: 精致的呈现\n- Masked: 掩盖\n- Spaces: 空间\n- Small and efficient: 小而高效\n- Big and often empty: 大而通常空荡荡\n\n**3. 句子结构：**\n\n这是一个简单句，其结构为：主语 + 谓语 + 宾语。具体分析如下：\n\n主语：Mies's sophisticated presentation（Mies的精致呈现）\n谓语：masked（掩盖）\n宾语：the fact that the spaces he designed were small and efficient, rather than big and often empty（他设计的空间其实小而高效，而非大而通常空荡荡的事实）\n\n**4. 语法分析：**\n\n句子的主要动词是\"masked\"，意为\"掩盖\"，主语是\"Mies's sophisticated presentation\"（Mies的精致呈现），而宾语是一个名词性从句\"the fact that the spaces he designed were small and efficient, rather than big and often empty\"（他设计的空间其实小而高效，而非大而通常空荡荡的事实），其中\"that\"引导了此从句。\n\n**5. 知识点总结：**\n\n1. **\"sophisticated\"的使用**：这是一个形容词，通常用来描述复杂的、精致的或高度发展的事物。例如：\"He has a sophisticated understanding of the business.\"（他对业务有深入的理解。）\n1. **\"mask\"的使用**：这个词在这里是作为动词使用，表示隐藏或掩盖某事物。例如：\"She masked her disappointment with a smile.\"（她用微笑掩饰了失望。）\n1. **\"the fact that\"的使用**：这是一个常用的短语，用来引导名词性从句，表示一个事实或情况。例如：\"The fact that she was late worried her.\"（她迟到的事实让她担心。）\n\n**6. 练习相似句子：**\n\n- \"Her calm demeanor masked the fact that she was actually very nervous about the presentation.\"\n- \"她冷静的举止掩盖了她其实对这次演讲非常紧张的事实。\""}]},{"sentences":[{"text":"The apartments in the elegant towers Mies built on Chicago’s Lake Shore Drive, for example, were smaller—two-bedroom units under 1,000 square feet—than those in their older neighbors along the city’s Gold Coast.","explainMd":"**句子讲解**\n\n**1. 翻译：**\n\n例如，Mies在芝加哥湖畔大道上建造的高雅塔楼中的公寓，比城市金海岸线上的老邻居更小——两卧室单位不到1000平方英尺。\n\n**2. 词汇和短语：**\n\n- Elegant towers: 高雅的塔楼\n- Mies built: Mies建造的\n- Chicago’s Lake Shore Drive: 芝加哥湖滨大道\n- Smaller: 更小的\n- Two-bedroom units: 两卧室单位\n- Under 1,000 square feet: 不到1000平方英尺\n- Their older neighbors: 它们的老邻居\n- City’s Gold Coast: 城市的黄金海岸\n\n**3. 句子结构：**\n\n这是一个复杂句，其结构为：主句 + 状语从句。具体分析如下：\n\n主句：The apartments in the elegant towers Mies built on Chicago’s Lake Shore Drive were smaller.\n状语从句：for example, two-bedroom units under 1,000 square feet—than those in their older neighbors along the city’s Gold Coast.\n\n**4. 语法分析：**\n\n句子的主要动词是\"were\"，表示“是”，主语是\"The apartments in the elegant towers Mies built on Chicago’s Lake Shore Drive\"（Mies在芝加哥湖滨大道上建造的高雅塔楼中的公寓），而宾语是\"smaller\"（更小的）。\"For example\"是一个引导状语从句的连词，它在这里引导了一个比较级的结构\"two-bedroom units under 1,000 square feet—than those in their older neighbors along the city’s Gold Coast\"（比城市金海岸线上的老邻居更小——两卧室单位不到1000平方英尺）。\n\n**5. 知识点总结：**\n\n1. **\"for example\"的使用**：这是一个常用的短语，用来引导例子或者说明。例如：\"I love fruit, for example, apples and bananas.\"（我喜欢水果，例如，苹果和香蕉。）\n1. **比较级的使用**：在这个句子中，\"smaller\"是一个比较级，用来比较两个或者更多的事物。\"than\"是一个比较级的连词，用来连接被比较的事物。例如：\"He is taller than me.\"（他比我高。）\n\n**6. 练习相似句子：**\n\n- \"The houses in the new development are larger, for example, three-bedroom units over 2,000 square feet, than those in the older part of the city.\"\n- \"新开发区的房子更大，例如，三卧室单位超过2000平方英尺，比城市老区的房子大。\""},{"text":"But they were popular because of their airy glass walls, the views they afforded and the elegance of the buildings’ details and proportions, the architectural equivalent of the abstract art so popular at the time.","explainMd":"**1. 翻译：**\n\n但它们因其通透的玻璃墙，它们提供的视野以及建筑细节和比例的优雅，得到了人们的喜爱，这在当时流行的抽象艺术中有着建筑学的对等体现。\n\n**2. 词汇和短语：**\n\n- Popular: 受欢迎的\n- Airy glass walls: 通透的玻璃墙\n- The views they afforded: 它们提供的视野\n- Elegance: 优雅\n- The buildings’ details and proportions: 建筑的细节和比例\n- The architectural equivalent: 建筑学的对等体现\n- Abstract art: 抽象艺术\n- So popular at the time: 在当时如此流行\n\n**3. 句子结构：**\n\n这是一个复杂句，其结构为：主句 + 并列句。具体分析如下：\n\n主句：But they were popular，这是句子的主要部分，表达的是他们受到了欢迎这一观点。\n并列句：because of their airy glass walls, the views they afforded, and the elegance of the buildings’ details and proportions, the architectural equivalent of the abstract art so popular at the time，这部分并列于主句，进一步提出了他们受欢迎的原因是因为：他们的通透玻璃墙，他们提供的视野，以及建筑的细节和比例的优雅，这在当时流行的抽象艺术中有着建筑学的对等体现。\n\n**4. 语法分析：**\n\n句子的主要动词是\"were\"，表示“是”，主语是\"they\"（他们），而宾语是\"popular\"（受欢迎的）。\"Because\"是一个引导原因状语从句的连词，它在这里引导了一个并列的结构\"of their airy glass walls, the views they afforded, and the elegance of the buildings’ details and proportions, the architectural equivalent of the abstract art so popular at the time\"（因为他们的通透玻璃墙，他们提供的视野，建筑的细节和比例的优雅，这在当时流行的抽象艺术中有着建筑学的对等体现）。\n\n**5. 知识点总结：**\n\n1. **\"Because of\"的使用**：这是一个常用的短语，用来引导原因或者理由。例如：\"I love you because of who you are.\"（我爱你是因为你是你。）\n1. **并列结构的使用**：在这个句子中，\"because of their airy glass walls, the views they afforded, and the elegance of the buildings’ details and proportions, the architectural equivalent of the abstract art so popular at the time\"是一个并列的结构，用来列举他们受欢迎的原因。并列结构通常由并列连词（如and, or, but）来连接。例如：\"She likes dancing, singing, and painting.\"（她喜欢跳舞，唱歌和画画。）\n\n**6. 练习相似句子：**\n\n- \"But the movie was a hit because of its engaging storyline, the performances of its actors, and the director's unique vision, the cinematic equivalent of the postmodern literature so popular at the time.\"\n- \"但这部电影因其吸引人的故事线，演员的表演，以及导演的独特视角，得到了人们的喜爱，这在当时流行的后现代文学中有着电影的对等体现。\""}]},{"sentences":[{"text":"The trend toward “less” was not entirely foreign.","explainMd":"**1. 翻译：**\n\n\"这种朝向'少'的趋势并非完全来自外国。\"\n\n**2. 词汇和短语：**\n\n- Trend: 趋势\n- Toward: 朝向\n- Less: 少\n- Not entirely: 并非完全\n- Foreign: 外国的\n\n**3. 句子结构：**\n\n这是一个简单句。具体分析如下：\n\n主语：The trend，这是句子的主要部分，指的是“这种趋势”。\n谓语：was，表示“是”。\n宾语：not entirely foreign，表示“并非完全来自外国”。\n\n**4. 语法分析：**\n\n句子的主要动词是\"was\"，表示“是”，主语是\"The trend\"（这种趋势），而宾语是\"not entirely foreign\"（并非完全来自外国）。\"Toward 'less'\"是一个介词短语，用来修饰主语，表示这种趋势的方向是“朝向'少'”。\n\n**5. 知识点总结：**\n\n1. **介词短语的使用**：在这个句子中，\"toward 'less'\"是一个介词短语，用来修饰主语，表示这种趋势的方向。介词短语通常用来修饰名词或者代词，给出更多的信息。例如：\"She is walking toward the park.\"（她正在朝公园走去。）\n1. **否定词的使用**：\"not\"是一个常用的否定词，用来否定动词、形容词或者其他副词。在这个句子中，它用来否定\"entirely foreign\"（完全来自外国），形成\"not entirely foreign\"（并非完全来自外国）这样的表达。\n\n**6. 练习相似句子：**\n\n- \"The shift toward 'green' is not entirely new.\"\n- \"这种向'绿色'转变的趋势并非全新的。\""},{"text":"In the 1930s Frank Lloyd Wright started building more modest and efficient houses—usually around 1,200 square feet—than the spreading two-story ones he had designed in the 1890s and the early 20th century.","explainMd":"**1. 翻译：**\n\n\"在20世纪30年代，弗兰克·劳埃德·赖特开始建造比他在19世纪90年代和20世纪初设计的那些扩展的两层房屋更为朴素和高效的房屋——通常约1200平方英尺。\"\n\n**2. 词汇和短语：**\n\n- In the 1930s: 在20世纪30年代\n- Frank Lloyd Wright: 弗兰克·劳埃德·赖特（著名美国建筑师）\n- Started building: 开始建造\n- More modest and efficient: 更为朴素和高效\n- Houses: 房屋\n- Usually around 1,200 square feet: 通常约1200平方英尺\n- Than the spreading two-story ones: 比那些扩展的两层房屋\n- designed: 设计\n- In the 1890s and the early 20th century: 在19世纪90年代和20世纪初\n\n**3. 句子结构：**\n\n这是一个复杂句，其结构为：主句 + 定语从句。具体分析如下：\n\n主句：Frank Lloyd Wright started building more modest and efficient houses—usually around 1,200 square feet，这是句子的主要部分，表达的是弗兰克·劳埃德·赖特开始建造更为朴素和高效的房屋的观点，这些房屋通常约1200平方英尺。\n定语从句：than the spreading two-story ones he had designed in the 1890s and the early 20th century，这部分是主句的定语从句，修饰前面的\"houses\"，进一步说明他设计的这些房屋是如何的。\n\n**4. 语法分析：**\n\n句子的主要动词是\"started building\"，表示“开始建造”，主语是\"Frank Lloyd Wright\"（弗兰克·劳埃德·赖特），而宾语是\"more modest and efficient houses\"（更为朴素和高效的房屋）。\"Usually around 1,200 square feet\"是一个副词短语，用来修饰主句，表示这些房屋的大概面积。定语从句\"than the spreading two-story ones he had designed in the 1890s and the early 20th century\"则用来修饰并比较\"houses\"，说明这些房屋与他在19世纪90年代和20世纪初设计的那些扩展的两层房屋的不同。\n\n**5. 知识点总结：**\n\n1. **定语从句的使用**：在这个句子中，\"than the spreading two-story ones he had designed in the 1890s and the early 20th century\"是一个定语从句，用来修饰主句中的\"houses\"。定语从句通常用来修饰名词或者代词，给出更多的信息。例如：\"The man who lives next door is a doctor.\"（住在隔壁的那个人是医生。）\n1. **比较级的使用**：\"more modest and efficient\"（更为朴素和高效）是一个比较级的表达，用来比较和强调这些房屋的特性。在英语中，我们通常通过加\"more\"或者在形容词后面加\"-er\"来形成比较级。例如：\"She is more beautiful than her sister.\"（她比她姐姐更漂亮。）\n\n**6. 练习相似句子：**\n\n- \"In the 1980s, Steve Jobs started designing more user-friendly and innovative computers—usually lighter than the traditional ones he had seen in the 1970s\"在20世纪80年代，史蒂夫·乔布斯开始设计更为用户友好和创新的电脑——通常比他在20世纪70年代见过的传统电脑更轻。\"\n- \"In the 1950s, Walt Disney started creating more colorful and engaging cartoons—usually shorter than the lengthy ones he had produced in the 1940s.\"\n  \"在20世纪50年代，沃尔特·迪斯尼开始创作更为五彩斑斓和引人入胜的卡通——通常比他在20世纪40年代制作的那些冗长卡通短。\""}]},{"sentences":[{"text":"The “Case Study Houses” commissioned from talented modern architects by California Arts & Architecture magazine between 1945 and 1962 were yet another homegrown influence on the “less is more” trend.","explainMd":"**翻译**\n\n1. \"1945年至1962年间，《加利福尼亚艺术与建筑》杂志委托了一批才华横溢的现代建筑师设计的“案例研究住宅”，是“少即是多”趋势的另一种本土影响。\"\n\n**词汇和短语**\n\n2. - Commissioned: 委托\n   - Talented: 才华横溢的\n   - Modern architects: 现代建筑师\n   - California Arts & Architecture: 《加利福尼亚艺术与建筑》\n   - Case Study Houses: “案例研究住宅”\n   - Homegrown: 本土的\n   - Influence: 影响\n   - Trend: 趋势\n\n**句子结构**\n\n3. 这是一个复杂句，其结构为：主句 + 定语从句。具体分析如下：\n\n   - 主句：The “Case Study Houses” commissioned from talented modern architects by California Arts & Architecture magazine between 1945 and 1962 were yet another homegrown influence on the “less is more” trend. 主句主要表达的是“案例研究住宅”是“少即是多”趋势的另一种本土影响。\n\n   - 定语从句：commissioned from talented modern architects by California Arts & Architecture magazine between 1945 and 1962，这部分是定语从句，它修饰主句中的“Case Study Houses”，说明这些房屋是由《加利福尼亚艺术与建筑》杂志在1945年至1962年间委托才华横溢的现代建筑师设计的。\n\n**语法分析**\n\n4. 这个句子使用了被动语态（\"were commissioned\"），表示“案例研究住宅”是被《加利福尼亚艺术与建筑》杂志委托设计的。同时，这个句子也使用了介词短语\"between 1945 and 1962\"来指定时间范围。\n\n**知识点总结**\n\n5. 1. **被动语态的使用**：这句话中的“were commissioned”是被动语态的使用例子，表示“案例研究住宅”是被《加利福尼亚艺术与建筑》杂志委托设计的。\n   1. **介词短语的使用**：这句话中的\"between 1945 and 1962\"是介词短语的使用，用于指定时间范围。\n\n**练习相似句子**\n\n6. - \"The modern libraries built by talented architects, commissioned by the city between 2000 and 2010, were a significant influence on the trend toward digital learning.\"\n   - \"2000年至2010年间，由城市委托才华横溢的建筑师建造的现代图书馆，对向数字学习的趋势产生了重要影响。\""},{"text":"Aesthetic effect came from the landscape, new materials and forthright detailing.","explainMd":"**翻译**\n\n1. \"美学效果源自于景观、新材料以及直接的细部处理。\"\n\n**词汇和短语**\n\n2. - Aesthetic effect: 美学效果\n   - Came from: 源自于\n   - Landscape: 景观\n   - New materials: 新材料\n   - Forthright detailing: 直接的细部处理\n\n**句子结构**\n\n3. 这是一个简单句，其结构为：主语 + 谓语 + 宾语。具体分析如下：\n\n   - 主语：“Aesthetic effect”，主语是句子的主要部分，本句中的主语是\"美学效果\"。\n\n   - 谓语：“Came from”，谓语是句子的行为或状态，这里“源自于”就是谓语。\n\n   - 宾语：“the landscape, new materials and forthright detailing”，宾语是句子的受事，这里是\"景观、新材料以及直接的细部处理\"。\n\n**语法分析**\n\n4. 这个句子使用了简单的主谓宾（SVO）结构，其中主语是\"Aesthetic effect\"，谓语是\"came from\"，宾语是\"the landscape, new materials and forthright detailing\"。同时，这个句子使用了并列结构，列出了美学效果的三个来源。\n\n**知识点总结**\n\n5. 1. **简单句的使用**：这句话是一个简单句，使用了基本的主谓宾（SVO）结构，清晰地表达了主题和主要信息。\n   1. **并列结构的使用**：这句话中的\"the landscape, new materials and forthright detailing\"是并列结构的使用，通过列举三个元素，清晰地表达了美学效果的来源。\n\n**练习相似句子**\n\n6. - \"The beauty of the painting comes from the artist's use of color, texture and composition.\"\n   - \"画的美感源自于艺术家对颜色、质感和构图的运用。\""},{"text":"In his Case Study House, Ralph Rapson may have mispredicted just how the mechanical revolution would impact everyday life—few American families acquired helicopters, though most eventually got clothes dryers—but his belief that self-sufficiency was both desirable and inevitable was widely shared.","explainMd":"**翻译**\n\n1. \"在他的案例研究住宅中，拉尔夫·拉普森可能误判了机械革命将如何影响日常生活——很少有美国家庭拥有直升机，尽管大多数最终购买了衣物烘干机——但他认为自给自足既可取又必然的观念得到了广泛的认同。\"\n\n**词汇和短语**\n\n2. - Case Study House: 案例研究住宅\n   - Mispredict: 误判\n   - Mechanical revolution: 机械革命\n   - Impact: 影响\n   - Acquire: 获得\n   - Self-sufficiency: 自给自足\n   - Desirable: 可取的\n   - Inevitable: 必然的\n   - Widely shared: 广泛认同的\n\n**句子结构**\n\n3. 这是一个复杂句，其结构为：主句 + 并列句。具体分析如下：\n\n   - 主句：\"In his Case Study House, Ralph Rapson may have mispredicted just how the mechanical revolution would impact everyday life\"，这是句子的主要部分，表达的是拉尔夫·拉普森在他的案例研究住宅中可能误判了机械革命将如何影响日常生活这一观点。\n\n   - 并列句：\"few American families acquired helicopters, though most eventually got clothes dryers\"和\"his belief that self-sufficiency was both desirable and inevitable was widely shared\"，这两部分并列于主句，进一步提出了很少有美国家庭拥有直升机，尽管大多数最终购买了衣物烘干机和他认为自给自足既可取又必然的观念得到了广泛的认同这两个观点。\n\n**语法分析**\n\n4. 这个句子使用了复杂的语法结构，包括主句和两个并列句。主句使用了\"may have\"来表示对过去事件的可能性猜测。前一个并列句使用了\"though\"作为让步状语从句的引导词，表示尽管某事情，但另一事情仍然成立的情况。后一个并列句使用了\"that\"引导的宾语从句来表达一个人的观点或信念。\n\n**知识点总结**\n\n5. 1. **\"may have\"的使用**：这是一种表示对过去事件可能性猜测的表达方式，在这句话中，\"Ralph Rapson may have mispredicted\" 使用了这种结构。另一个例子可以是：\"He may have left the party early.\"\n   1. **让步状语从句的使用**：让步状语从句用来表示尽管某事情，但另一事情仍然成立的情况。在这句话中，\"though most eventually got clothes dryers\"使用了让步状语从句。另一个例子可以是：\"Though it was raining, we still went out for a walk.\"\n   1. **\"that\"引导的宾语从句的使用**：这是一种表示一个人的观点或信念的表达方式。在这句话中，\"his belief that self-sufficiency was both desirable and inevitable\"使用了这种结构。另一个例子可以是：\"She said that she would come soon.\"\n\n**练习相似句子**\n\n6. - \"In his novel, Mark Twain may have underestimated how the industrial revolution would change society—few households had electricity, though most eventually got telephones—but his belief that progress was both necessary and unstoppable was widely accepted.\"\n   - \"在他的小说中，马克·吐温可能低估了工业革命将如何改变社会——很少有家庭拥有电力，尽管大多数最终拥有了电话——但他认为进步既必要又不可阻挡的观点得到了广泛的接受。\"\n\n- \"In her research, Jane Goodall may have overestimated how quickly primates could learn sign language—few chimps mastered more than a handful of signs, though most eventually learned to understand basic commands—but her belief that animals were capable of complex communication was widely shared.\"\n  - \"在她的研究中，珍·古多尔可能高估了灵长类动物能够多快地学习手语——很少有黑猩猩能掌握超过一小部分的符号，尽管大多数最终学会了理解基本的命令——但她认为动物有能力进行复杂沟通的观点得到了广泛的认同。\""}]}],"title":""}