{"translate":"","paragraphs":[{"sentences":[{"text":"In the idealized version of how science is done, facts about the world are waiting to be observed and collected by objective researchers who use the scientific method to carry out their work.","explainMd":"### 1. 翻译\n\n在理想化的科学实践版本中，世界的事实正在等待客观的研究者们去观察和收集，这些研究者们运用科学方法进行他们的工作。\n\n### 2. 词汇和短语\n\n- **In the idealized version**: 在理想化的版本中，\"idealized version\" 指的是理想化或最完美的版本或模型。\n- **how science is done**: 科学是如何进行的，这里 \"how\" 引导的是宾语从句。\n- **facts about the world**: 世界的事实，\"facts\" 是事实或真相的意思，\"about the world\" 指的是关于世界的。\n- **waiting to be observed and collected by**: 被……观察和收集，这是一个被动语态的句子结构。\n- **objective researchers**: 客观的研究者，\"objective\" 是客观的意思，指的是不受个人感情、偏见影响，准确公正地看待事物。\n- **who use the scientific method to carry out their work**: 使用科学方法进行他们的工作，\"who\" 引导的是定语从句，修饰 \"researchers\"。\n\n### 3. 句子结构\n\n这个句子的结构是：主语(\"facts about the world\") + 谓语(\"are waiting\") + 宾语(\"to be observed and collected\") + 宾语补足语(\"by objective researchers\") + 定语从句(\"who use the scientific method to carry out their work\")。\n\n### 4. 语法\n\n- 这个句子使用了被动语态(\"are waiting to be observed and collected\")，强调动作的接受者（事实）而非执行者（研究者）。\n- 句子使用了定语从句(\"who use the scientific method to carry out their work\")，修饰 \"researchers\"。\n\n### 5. 知识点总结\n\n- 使用被动语态强调动作的接受者。\n- 定语从句的使用，作为对前面名词的修饰。\n\n### 6. 相似句子练习\n\nIn the idealized version of how art is created, beauty is waiting to be discovered and appreciated by subjective artists who use their unique perspectives to create their work.\n\n在理想化的艺术创作版本中，美丽正在等待主观的艺术家们去发现和欣赏，这些艺术家们运用他们独特的视角去创作他们的作品。\n在这个句子中，\"In the idealized version\" 引导的是主句，\"how art is created\" 是宾语从句，\"beauty is waiting to be discovered and appreciated\" 是被动语态的句子结构，\"by subjective artists\" 是被动语态的宾语补足语，\"who use their unique perspectives to create their work\" 是定语从句，修饰 \"artists\"。\n\n"},{"text":"But in the everyday practice of science, discovery frequently follows an ambiguous and complicated route.","explainMd":"### 1. 翻译\n\n但在科学的日常实践中，发现往往走的是一条模糊复杂的道路。\n\n### 2. 词汇和短语\n\n- **But**: 但是，表示转折。\n- **in the everyday practice of science**: 在科学的日常实践中，\"everyday practice\" 指的是日常实践或常规操作。\n- **discovery**: 发现，这里指的是科学上的新发现或者理论。\n- **frequently follows**: 经常遵循，\"follows\" 在这里的意思是遵循或者沿着某个路径走。\n- **an ambiguous and complicated route**: 一个模糊复杂的道路，\"ambiguous\" 意为模糊或者不明确的，\"complicated\" 指的是复杂的。\n\n### 3. 句子结构\n\n这个句子的结构是：转折连词(\"But\") + 状语(\"in the everyday practice of science\") + 主语(\"discovery\") + 谓语(\"frequently follows\") + 宾语(\"an ambiguous and complicated route\")。\n\n### 4. 语法\n\n- 这个句子使用了转折连词 \"But\"，表示对前文的转折。\n- 句子的主语 \"discovery\" 和谓语 \"frequently follows\" 形成了主谓结构。\n- \"an ambiguous and complicated route\" 作为谓语动词 \"follows\" 的宾语。\n\n### 5. 知识点总结\n\n- 使用转折连词表示对前文内容的转折。\n- 主谓宾的基本句子结构。\n\n### 6. 相似句子练习\nBut in the everyday practice of art, creation often follows an unpredictable and intricate path.\n\n但在艺术的日常实践中，创作经常走的是一条不可预测和复杂的道路。\n\n这句话的结构和原句相似，\"But\" 是转折连词，\"in the everyday practice of art\" 是状语，\"creation\" 是主语，\"often follows\" 是谓语，\"an unpredictable and intricate path\" 是宾语。"},{"text":"We aim to be objective, but we cannot escape the context of our unique life experiences.","explainMd":"### 1. 翻译\n\n我们力求客观，但我们无法逃避我们独特生活经验的背景。\n\n### 2. 词汇和短语\n\n- **We aim to be objective**: 我们力求客观，\"aim to be\" 表示的是一个目标或者意图。\n- **but we cannot escape**: 但我们无法逃避，\"cannot escape\" 指的是无法避免或者摆脱。\n- **the context of our unique life experiences**: 我们独特生活经验的背景，\"context\" 指的是背景或者环境，\"unique life experiences\" 指的是独特的生活经验。\n\n### 3. 句子结构\n\n这个句子的结构是：主语(\"We\") + 谓语(\"aim to be\") + 宾语(\"objective\") + 转折连词(\"but\") + 主语(\"we\") + 谓语动词(\"cannot escape\") + 宾语(\"the context of our unique life experiences\")。\n\n### 4. 语法\n\n- 这个句子使用了转折连词 \"but\"，表示对前文的转折或者对比。\n- 句子的主语 \"We\" 和谓语 \"aim to be\" 形成了主谓结构。\n- \"the context of our unique life experiences\" 作为谓语动词 \"cannot escape\" 的宾语。\n\n### 5. 知识点总结\n\n- 使用转折连词表示对前文内容的转折或者对比。\n- 主谓宾的基本句子结构。\n- \"aim to be\" 表示一个目标或者意图，\"cannot escape\" 表示无法避免或者摆脱。\n\n### 6. 相似句子练习\n\nWe strive to be fair, but we cannot escape the influence of our personal biases.\n\n我们力求公正，但我们无法逃避个人偏见的影响。\n\n这句话的结构和原句相似，\"We\" 是主语，\"strive to be\" 表示一个目标或者意图，\"fair\" 是宾语，\"but\" 是转折连词，\"we\" 是主语，\"cannot escape\" 是谓语动词，\"the influence of our personal biases\" 是宾语。"},{"text":"Prior knowledge and interests influence what we experience, what we think our experiences mean, and the subsequent actions we take.","explainMd":"### 1. 翻译\n\n我们的先前知识和兴趣影响了我们的经历、我们对经历的理解以及我们采取的后续行动。\n\n### 2. 词汇和短语\n\n- **Prior knowledge and interests**: 先前的知识和兴趣。\"Prior\" 是形容词，表示先前的，早先的；\"knowledge\" 是名词，表示知识；\"interests\" 是名词，表示兴趣。\n- **Influence**: 影响。这里作为动词使用。\n- **What we experience, what we think our experiences mean, and the subsequent actions we take**: 我们的经历、我们对经历的理解以及我们采取的后续行动。这是一个并列结构，用逗号分隔。\n\n### 3. 句子结构\n\n这个句子的结构是：主语(\"Prior knowledge and interests\") + 谓语(\"influence\") + 宾语(\"what we experience, what we think our experiences mean, and the subsequent actions we take\")。\n\n### 4. 语法\n\n- 主语 \"Prior knowledge and interests\" 和谓语 \"influence\" 形成了主谓结构。\n- \"what we experience, what we think our experiences mean, and the subsequent actions we take\" 作为谓语动词 \"influence\" 的宾语，这是一个复杂的宾语，由三个子句构成，分别是 \"what we experience\", \"what we think our experiences mean\" 和 \"the subsequent actions we take\"，这三个子句都是名词性从句，用来详细说明 \"influence\" 的对象是什么。\n\n### 5. 知识点总结\n\n- 主谓宾的基本句子结构。\n- 使用复杂的宾语来详细说明谓语动词的对象，特别是使用名词性从句作为宾语。\n- \"Prior\" 的使用表示先前的，早先的。\n\n### 6. 相似句子练习\n\nOur cultural backgrounds and personal beliefs shape how we perceive things, how we interpret our perceptions, and the decisions we make.\n\n我们的文化背景和个人信仰塑造了我们如何感知事物、我们如何解释我们的感知以及我们做出的决定。\n\n这句话的结构和原句相似，主语是 \"Our cultural backgrounds and personal beliefs\"，谓语是 \"shape\"，宾语是 \"how we perceive things, how we interpret our perceptions, and the decisions we make\"，这个宾语由三个名词性从句构成，详细说明了 \"shape\" 的对象是什么。"},{"text":"Opportunities for misinterpretation, error, and self-deception abound.","explainMd":"### 1. 翻译\n\n误解、错误和自我欺骗的机会比比皆是。\n\n### 2. 词汇和短语\n\n- **Opportunities for**: 对于…的机会。在这里，\"opportunities\" 是名词，表示机会；\"for\" 是介词，表示目的或者方向。\n- **Misinterpretation, error, and self-deception**: 误解、错误和自我欺骗。这是一个并列结构，用逗号分隔。\n- **Abound**: 比比皆是，非常多。这里作为动词使用。\n\n### 3. 句子结构\n\n这个句子的结构是：主语(\"Opportunities for misinterpretation, error, and self-deception\") + 谓语(\"abound\")。这是一个简单句，即只有一个主语和一个谓语。\n\n### 4. 语法\n\n- 使用 \"for\" 来建立主语 \"Opportunities\" 和 \"misinterpretation, error, and self-deception\" 之间的关系。\n- \"Abound\" 是不及物动词，后面不需要宾语。因此，这个句子的结构就是主谓结构。\n\n### 5. 知识点总结\n\n- 主谓的基本句子结构。\n- 使用 \"for\" 来表示目的或方向。\n- \"Abound\" 的使用表示非常多或者比比皆是。\n\n### 6. 相似句子练习\n\nOpportunities for learning, growth, and development are plentiful.\n\n学习、成长和发展的机会比比皆是。\n\n这句话的结构和原句相似，主语是 \"Opportunities for learning, growth, and development\"，谓语是 \"are plentiful\"。主语中使用 \"for\" 来建立 \"Opportunities\" 和 \"learning, growth, and development\" 之间的关系。这是一个主谓宾的结构，其中 \"are plentiful\" 表示的是比比皆是的意思，与原句的 \"abound\" 相似。"}]},{"sentences":[{"text":"Consequently, discovery claims should be thought of as protoscience.","explainMd":"### 1. 翻译\n\n因此，发现的声明应被视为原始科学。\n\n### 2. 词汇和短语\n\n- **Consequently**: 因此，所以。这是一个副词，常用于引出结果或者结论。\n- **Discovery claims**: 发现的声明。这里，\"discovery\" 是名词，表示发现；\"claims\" 也是名词，表示声明或主张。\n- **Should be thought of as**: 应该被看作是。这是一个 modal verb phrase，用于表达建议或者意见。\n- **Protoscience**: 原始科学。这是一个名词，表示在科学理论和实践方法完全发展出来之前的科学研究阶段。\n\n### 3. 句子结构\n\n这个句子的结构是：副词(\"Consequently\") + 主语(\"discovery claims\") + 谓语(\"should be thought of as\") + 宾语(\"protoscience\")。这是一个简单的主谓宾句型。\n\n### 4. 语法\n\n\"Should be thought of as\" 是一个被动语态的 modal verb phrase，其中 \"should\" 表达了建议或者意见，\"be thought of as\" 是被动语态，表示主语 \"discovery claims\" 是被动地接受动作。\n\n### 5. 知识点总结\n\n- 使用副词 \"consequently\" 来引出结果或者结论。\n- 利用被动语态的 modal verb phrase (\"should be thought of as\") 来表达建议或者意见。\n- \"Protoscience\" 的意思和用法。\n\n### 6. 相似句子练习\n\nConsequently, his actions should be regarded as heroic.\n\n因此，他的行为应该被视为英勇。\n\n这句话的结构和原句相似，副词 \"Consequently\" 引出了结果，主语是 \"his actions\"，谓语是 \"should be regarded as\"，宾语是 \"heroic\"。主语和谓语之间的关系通过被动语态的 modal verb phrase \"should be regarded as\" 来建立。这是一个主谓宾的结构，其中 \"should be regarded as\" 表达了对于主语 \"his actions\" 的看法或评价。"},{"text":"Similar to newly staked mining claims, they are full of potential.","explainMd":"### 1. 翻译\n\n他们就像新获得的采矿权一样，充满潜力。\n\n### 2. 词汇和短语\n\n- **Similar to**: 和……相似。这是一个短语，用于比较两个事物的相似性。\n- **Newly staked mining claims**: 新立的采矿权。\"Newly staked\" 是形容词短语，表示刚刚建立或者新近创建；\"mining claims\" 是名词短语，表示采矿权。\n- **They**: 他们。这是一个代词，指代前文的 \"discovery claims\"。\n- **Are full of**: 充满了。这是一个动词短语，用于表示事物充满或者包含了某种特性或者属性。\n- **Potential**: 潜力。这是一个名词，表示可能性或者潜在的实力。\n\n### 3. 句子结构\n\n这个句子的结构是：状语(\"Similar to newly staked mining claims\") + 主语(\"they\") + 谓语(\"are full of\") + 宾语(\"potential\")。这是一个简单的主谓宾句型。\n\n### 4. 语法\n\n\"Are full of\" 是一个动词短语，用于表达主语 \"they\" 具有或者包含了某种特性或者属性。在这个句子中，这个特性或者属性是 \"potential\"。\n\n### 5. 知识点总结\n\n- 利用 \"similar to\" 来进行比较。\n- 利用 \"are full of\" 来表达事物具有或者包含了某种特性或者属性。\n- \"Newly staked mining claims\" 和 \"potential\" 的意思和用法。\n\n### 6. 相似句子练习\n\nSimilar to a newly opened book, it is full of possibilities.\n\n它就像一本新开的书，充满了可能性。\n\n这句话的结构和原句相似，状语 \"Similar to a newly opened book\" 比较了主语 \"it\" 和 \"a newly opened book\" 的相似性，谓语 \"is full of\" 表达了主语 \"it\" 充满或者包含了某种特性或者属性，这个特性或者属性是 \"possibilities\"。这是一个主谓宾的结构。"},{"text":"But it takes collective scrutiny and acceptance to transform a discovery claim into a mature discovery.","explainMd":"### 1. 翻译\n\n但是，需要集体的审查和接受来将一个发现的声明转化为成熟的发现。\n\n### 2. 词汇和短语\n\n- **But**: 但是。这是一个连词，用于引出对前面内容的转折或者对比。\n- **It takes**: 需要。这是一个短语，用于表示完成某事需要某种东西或者需要花费一些时间。\n- **Collective scrutiny and acceptance**: 集体的审查和接受。\"Collective\" 是一个形容词，表示的是由一组或者多个人共同进行的；\"scrutiny and acceptance\" 是一个名词短语，表示审查和接受。\n- **To transform**: 转化。这是一个动词，表示改变或者转化某件事物的状态或者形式。\n- **A discovery claim into a mature discovery**: 一个发现的声明变成一个成熟的发现。\"A discovery claim\" 是一个名词短语，表示的是一个关于发现的声明；\"a mature discovery\" 是一个名词短语，表示的是一个被公认接受的，已经成熟的发现。\n\n### 3. 句子结构\n\n这个句子的结构是：连词(\"But\") + 主语+谓语(\"It takes collective scrutiny and acceptance\") + 不定式短语(\"to transform a discovery claim into a mature discovery\")。这是一个复杂句结构，主干是\"It takes collective scrutiny and acceptance\"，不定式短语作为目的状语，解释了主干的目的或者结果。\n\n### 4. 语法\n\n句子主干为\"It takes collective scrutiny and acceptance\"，其中，\"It takes\" 是一个常用语法结构，用于表示完成某事需要某种东西或者需要花费一些时间。\"To transform a discovery claim into a mature discovery\" 是一个不定式短语，用于解释主干的目的或者结果。\n\n### 5. 知识点总结\n\n- \"It takes\" 的用法和含义。\n- 不定式短语作为目的状语的用法。\n- \"Collective scrutiny and acceptance\" 和 \"a discovery claim into a mature discovery\" 的意思和用法。\n\n### 6. 相似句子练习\n\nBut it takes hard work and dedication to transform a simple idea into a successful business.\n\n但是，需要辛勤的工作和执着的精神将一个简单的想法转化为成功的事业。\n\n这句话的结构和原句相似，主干是\"It takes hard work and dedication\"，其中，\"It takes\" 表示完成某事需要某种东西或者需要花费一些时间，\"hard work and dedication\" 是所需的东西。不定式短语 \"to transform a simple idea into a successful business\" 作为目的状语，解释了主干的目的或者结果。"},{"text":"This is the credibility process, through which the individual researcher’s me, here, now becomes the community’s anyone, anywhere, anytime.","explainMd":"### 1. 翻译\n\n这就是信任过程，通过这个过程，单个研究员的“我，这里，现在”变成了社区的“任何人，任何地方，任何时间”。\n\n### 2. 词汇和短语\n\n- **This is**: 这就是。这是一个短语，用于引出后面的定义或解释。\n- **The credibility process**: 信任过程。\"Credibility\" 是一个名词，表示的是被公众认可的程度或者信任度；\"process\" 是一个名词，表示的是一个过程或者步骤。\n- **Through which**: 通过这个。这是一个关系代词短语，用于引出后面的定语从句。\n- **The individual researcher's me, here, now becomes the community's anyone, anywhere, anytime**: 单个研究员的“我，这里，现在”变成了社区的“任何人，任何地方，任何时间”。这是一个并列结构，表示的是一个变化过程。\n\n### 3. 句子结构\n\n这个句子的结构是：主语+谓语(\"This is the credibility process\") + 关系代词短语 + 从句(\"the individual researcher's me, here, now becomes the community's anyone, anywhere, anytime\")。这是一个复杂句结构，主干是\"This is the credibility process\"，关系代词短语和从句一起构成了一个定语从句，用来修饰和解释主语。\n\n### 4. 语法\n\n句子主干为\"This is the credibility process\"，其中，\"This is\" 是一个常用语法结构，用于引出后面的定义或解释。\"Through which the individual researcher's me, here, now becomes the community's anyone, anywhere, anytime\" 是一个定语从句，其中，\"through which\" 是一个关系代词短语，用于引出定语从句，\"the individual researcher's me, here, now becomes the community's anyone, anywhere, anytime\" 是定语从句的主干，表示的是一个变化过程。\n\n### 5. 知识点总结\n\n- \"This is\" 的用法和含义。\n- 定语从句和关系代词短语 \"through which\" 的用法。\n- 并列结构 \"the individual researcher's me, here, now becomes the community's anyone, anywhere, anytime\" 的意思和用法。\n\n### 6. 相似句子练习\nThis is the transformation process, through which the caterpillar becomes a beautiful butterfly.\n\n这就是变化过程，通过这个过程，毛毛虫变成了美丽的蝴蝶。\n\n这句话的结构和原句相似，主干是\"This is the transformation process\"，其中，\"This is\" 用于引出后面的定义或解释，\"the transformation process\" 是定义或解释的内容。定语从句 \"through which the caterpillar becomes a beautiful butterfly\" 用来修饰和解释主语，其中，\"through which\" 是一个关系代词短语，用于引出定语从句，\"the caterpillar becomes a beautiful butterfly\" 是定语从句的主干，表示的是一个变化过程。"},{"text":"Objective knowledge is the goal, not the starting point.","explainMd":"### 1. 翻译\n\n客观的知识是目标，而不是起点。\n\n### 2. 词汇和短语\n\n- **Objective knowledge**: 客观的知识。\"Objective\" 是一个形容词，表示的是不受个人情感、解释或偏见影响的事实或真实；\"knowledge\" 是一个名词，表示的是了解或理解的信息或技能。\n- **Is the goal**: 是目标。\"Is\" 是一个动词，表示的是存在或状态；\"the goal\" 是一个名词短语，表示的是期望达到的结果或目标。\n- **Not the starting point**: 不是起点。\"Not\" 是一个否定词，用于否定后面的表述；\"the starting point\" 是一个名词短语，表示的是开始或起始的地方。\n\n### 3. 句子结构\n\n这个句子的结构是：主语+谓语+宾语(\"Objective knowledge is the goal\") + 并列连词 + 宾语(\"not the starting point\")。这是一个并列句结构，表示的是两个对比的观点。\n\n### 4. 语法\n\n句子主干为\"Objective knowledge is the goal\"，其中，\"Objective knowledge\" 是主语，\"is\" 是谓语，\"the goal\" 是宾语，表示的是一种状态或情况。\"Not the starting point\" 是一个并列结构，\"not\" 是一个否定词，用于否定后面的表述，\"the starting point\" 是宾语，表示的是另一种对比的状态或情况。\n\n### 5. 知识点总结\n\n- \"Objective knowledge\" 的用法和含义。\n- \"Is the goal\" 的用法和含义。\n- 并列结构 \"not the starting point\" 的意思和用法。\n\n### 6. 相似句子练习\nTrue happiness is the journey, not the destination.\n\n真正的快乐是旅程，而不是目的地。\n\n这句话的结构和原句相似，主干是\"True happiness is the journey\"，其中，\"True happiness\" 是主语，\"is\" 是谓语，\"the journey\" 是宾语，表示的是一种状态或情况。\"Not the destination\" 是一个并列结构，\"not\" 是一个否定词，用于否定后面的表述，\"the destination\" 是宾语，表示的是另一种对比的状态或情况。"}]},{"sentences":[{"text":"Once a discovery claim becomes public, the discoverer receives intellectual credit.","explainMd":"### 1. 翻译\n\n一旦一个发现声明变为公开，发现者就会获得知识产权。\n\n### 2. 词汇和短语\n\n- **Once**: 一旦。这个词是一个并列连词，表示的是一种条件或情况发生之后，另一种情况或行为就会发生。\n- **A discovery claim becomes public**: 一个发现声明变为公开。\"A discovery claim\" 是一个名词短语，表示的是一种科学发现的声明或提出；\"becomes public\" 是一个动词短语，表示的是变为公开或知晓。\n- **The discoverer**: 发现者。这是一个名词，表示的是发现或创造某种事物的人。\n- **Receives**: 收到，获得。这是一个动词，表示的是得到某种物品或服务。\n- **Intellectual credit**: 知识产权。这是一个名词短语，表示的是对某种创造或发现的知识产权或所有权。\n\n### 3. 句子结构\n\n这个句子的结构是：条件状语从句(\"Once a discovery claim becomes public\") + 主语(\"the discoverer\") + 谓语(\"receives\") + 宾语(\"intellectual credit\")。这是一个复合句结构，表示的是一种条件和结果的关系。\n\n### 4. 语法\n\n此句的主干为\"the discoverer receives intellectual credit\"，其中，\"the discoverer\" 是主语，\"receives\" 是谓语，\"intellectual credit\" 是宾语，表示的是一种行为或状态。\"Once a discovery claim becomes public\" 是一个条件状语从句，\"once\" 是一个并列连词，表示的是一种条件或情况，\"a discovery claim becomes public\" 是从句的主干，其中，\"a discovery claim\" 是主语，\"becomes public\" 是谓语，表示的是一种状态或情况。\n\n### 5. 知识点总结\n\n- \"Once\" 的用法和含义。\n- \"A discovery claim becomes public\" 的用法和含义。\n- \"The discoverer\" 和 \"Receives intellectual credit\" 的用法和含义。\n- 条件状语从句的构造和用法。\n\n### 6. 相似句子练习\nOnce an idea is accepted, the inventor gains recognition.\n\n一旦一个想法被接受，发明者就会获得认可。\n\n这个句子的结构和原句很相似。主干是\"the inventor gains recognition\"，其中，\"the inventor\" 是主语，\"gains\" 是谓语，\"recognition\" 是宾语，表示的是一种行为或状态。\"Once an idea is accepted\" 是一个条件状语从句，\"once\" 是一个并列连词，表示的是一种条件或情况，\"an idea is accepted\" 是从句的主干，其中，\"an idea\" 是主语，\"is accepted\" 是谓语，表示的是一种状态或情况。"},{"text":"But, unlike with mining claims, the community takes control of what happens next.","explainMd":"### 1. 翻译\n\n但是，与采矿权声明不同，接下来的事情由社区控制。\n\n### 2. 词汇和短语\n\n- **But**: 但是。这个词是一个并列连词，用于连接并对比两个句子或句子中的两个部分。\n- **unlike with mining claims**: 与采矿权声明不同。\"unlike\" 是一个介词，表示的是一种比较或对比，\"with mining claims\" 是一个介词短语，表示的是\"与采矿权声明\"。\n- **the community**: 社区。这是一个名词，表示的是一种群体或集合。\n- **takes control of**: 控制。这是一个动词短语，表示的是控制或管理某种事情或情况。\n- **what happens next**: 接下来会发生的事情。\"what happens next\" 是一个名词性从句，表示的是\"接下来会发生的事情\"。\n\n### 3. 句子结构\n\n这个句子的结构是：并列连词(\"But\") + 状语(\"unlike with mining claims\") + 主语(\"the community\") + 谓语(\"takes control of\") + 宾语(\"what happens next\")。这是一个简单句结构，表示的是一种行为或状态。\n\n### 4. 语法\n\n此句的主干为\"the community takes control of what happens next\"，其中，\"the community\" 是主语，\"takes control of\" 是谓语，\"what happens next\" 是宾语，表示的是一种行为或状态。\"But\" 是一个并列连词，用于连接并对比句子。\"unlike with mining claims\" 是一个状语，\"unlike\" 是一个介词，表示的是一种比较或对比，\"with mining claims\" 是一个介词短语，表示的是\"与采矿权声明\"。\n\n### 5. 知识点总结\n\n- \"But\" 的用法和含义。\n- \"unlike with mining claims\" 的用法和含义。\n- \"the community\" 和 \"takes control of what happens next\" 的用法和含义。\n\n### 6. 相似句子练习\n\nBut, unlike with traditional teaching methods, the students take charge of their own learning.\n\n但是，与传统教学方法不同，学生们主导自己的学习。\n\n这个句子的结构和原句很相似。主干是\"the students take charge of their own learning\"，其中，\"the students\" 是主语，\"take charge of\" 是谓语，\"their own learning\" 是宾语，表示的是一种行为或状态。\"But\" 是一个并列连词，用于连接并对比句子。\"unlike with traditional teaching methods\" 是一个状语，\"unlike\" 是一个介词，表示的是一种比较或对比，\"with traditional teaching methods\" 是一个介词短语，表示的是\"与传统教学方法\"。"},{"text":"Within the complex social structure of the scientific community, researchers make discoveries; editors and reviewers act as gatekeepers by controlling the publication process; other scientists use the new finding to suit their own purposes; and finally, the public (including other scientists) receives the new discovery and possibly accompanying technology.","explainMd":"### 1. 翻译\n\n在科学社区的复杂社会结构中，研究人员进行发现；编辑和审稿人通过控制出版过程充当门卫；其他科学家将新的发现用于自己的目的；最后，公众（包括其他科学家）接收新的发现和可能的配套技术。\n\n### 2. 词汇和短语\n\n- **Within**: 在...之内。这是一个预词，用于表示某种范围或限制。\n- **the complex social structure of the scientific community**: 科学社区的复杂社会结构。这是一个名词短语，\"complex social structure\" 指复杂的社会结构，\"of the scientific community\" 是一个定语，用于修饰复杂的社会结构。\n- **researchers make discoveries; editors and reviewers act as gatekeepers by controlling the publication process; other scientists use the new finding to suit their own purposes; and finally, the public (including other scientists) receives the new discovery and possibly accompanying technology**: 这是一个并列的复合句，描述了科学社区中不同角色的行为。\n\n### 3. 句子结构\n\n这是一个复杂的句子结构，由一个主句和多个并列的分句组成。主句是 \"Within the complex social structure of the scientific community\"，这个句子的主体部分是由四个并列的分句组成的，分别描述了研究人员、编辑和审稿人、其他科学家以及公众的行为。\n\n### 4. 语法\n\n此句的主语是复杂的名词短语 \"the complex social structure of the scientific community\"，谓语是四个并列的动词短语 \"researchers make discoveries; editors and reviewers act as gatekeepers by controlling the publication process; other scientists use the new finding to suit their own purposes; and finally, the public (including other scientists) receives the new discovery and possibly accompanying technology\"，这些动词短语描述了科学社区中不同角色的行为。\n\n### 5. 知识点总结\n\n- \"Within\" 的用法和含义。\n- \"the complex social structure of the scientific community\" 的用法和含义。\n- 如何理解和分析复杂的句子结构。\n\n### 6. 相似句子练习\n\nWithin the intricate network of a corporation, managers make decisions; auditors ensure compliance by overseeing financial operations; employees contribute to the company's goals through their work; and, finally, the stakeholders (including employees) benefit from the company's success.\n\n在公司复杂的网络结构中，经理做出决策；审计员通过监督财务运作来确保合规；员工通过他们的工作为公司的目标作出贡献；最后，利益相关者（包括员工）从公司的成功中获益。\n\n这个句子的结构和原句很相似，主干是 \"managers make decisions; auditors ensure compliance by overseeing financial operations; employees contribute to the company's goals through their work; and, finally, the stakeholders (including employees) benefit from the company's success\"，描述了公司中不同角色的行为。\"Within the intricate network of a corporation\" 是一个状语，\"within\" 是一个介词，表示的是一种范围或限制，\"the intricate network of a corporation\" 是一个名词短语，表示的是\"公司的复杂网络结构\"。"},{"text":"As a discovery claim works its way through the community, the interaction and confrontation between shared and competing beliefs about the science and the technology involved transforms an individual’s discovery claim into the community’s credible discovery.","explainMd":"### 1. 翻译\n\n当一个发现声明在社区中传播时，关于涉及的科学和技术的共享和竞争信念之间的交互和对抗将个人的发现声明转化为社区的可信发现。\n\n### 2. 词汇和短语\n\n- **As a discovery claim works its way through the community**: 当一个发现声明在社区中传播。这是一个时间状语从句，描述的是主句发生的背景或条件。\n\n- **the interaction and confrontation between shared and competing beliefs about the science and the technology involved**: 关于涉及的科学和技术的共享和竞争信念之间的交互和对抗。这是一个名词短语，作为主句的主语。\n\n- **transforms an individual’s discovery claim into the community’s credible discovery**: 将个人的发现声明转化为社区的可信发现。这是一个动词短语，作为主句的谓语。\n\n### 3. 句子结构\n\n这是一个单独的复合句。主句是 \"the interaction and confrontation between shared and competing beliefs about the science and the technology involved transforms an individual’s discovery claim into the community’s credible discovery\"，描述了一个过程。而 \"As a discovery claim works its way through the community\" 是一个时间状语从句，描述的是这个过程发生的背景或条件。\n\n### 4. 语法\n\n此句的主语是复杂的名词短语 \"the interaction and confrontation between shared and competing beliefs about the science and the technology involved\"，谓语是动词短语 \"transforms an individual’s discovery claim into the community’s credible discovery\"。这个句子的特点是使用了 \"as\" 引导的时间状语从句。\n\n### 5. 知识点总结\n\n- \"As\" 的用法和含义。\n- 如何理解和分析复杂的句子结构。\n- 了解科学社区中发现声明的传播和接受过程。\n\n### 6. 相似句子练习\n\nAs a new product makes its way through the market, the interaction and confrontation between the shared and competing beliefs about the product's value and use transforms an individual company’s product offering into the community’s accepted product.\n\n当一种新产品在市场中流通时，关于产品价值和使用的共享和竞争信念之间的交互和对抗将个人公司的产品推广转化为社区接受的产品。\n\n这个句子的结构和原句很相似，主干是 \"the interaction and confrontation between the shared and competing beliefs about the product's value and use transforms an individual company’s product offering into the community’s accepted product\"，描述了一个过程。\"As a new product makes its way through the market\" 是一个时间状语从句，描述的是这个过程发生的背景或条件。"}]},{"sentences":[{"text":"Two paradoxes exist throughout this credibility process.","explainMd":"### 1. 翻译\n\n在这个可信度过程中存在两个悖论。\n\n### 2. 词汇和短语\n\n- **Two paradoxes**: 两个悖论。\"Paradoxes\" 是 \"paradox\" 的复数形式，\"paradox\" 指的是看似矛盾但可能是真实的情况或观点。\n\n- **exist**: 存在。此处用作不及物动词，表示某物或某人在某个地方或某个状态中存在。\n\n- **throughout**: 贯穿，遍及。这是一个副词，表示在整个过程或范围内。\n\n- **this credibility process**: 这个可信度过程。这是一个名词短语，\"credibility\" 指的是被认为可信或被接受的程度，\"process\" 指的是一系列发生的事情，这两个词合在一起指的是使某事被认为是可信的过程。\n\n### 3. 句子结构\n\n这是一个简单句，主语是 \"Two paradoxes\"，谓语是 \"exist\"，\"throughout this credibility process\" 是一个副词短语，修饰谓语，表示这两个悖论在整个可信度过程中存在。\n\n### 4. 语法\n\n此句的主语是 \"Two paradoxes\"，是一个复数名词，因此谓语 \"exist\" 也用了复数形式。\"throughout\" 是一个副词，表示在整个过程或范围内。\n\n### 5. 知识点总结\n\n- \"Paradox\" 的含义和用法。\n- \"Exist\" 的含义和用法。\n- \"Throughout\" 的含义和用法。\n- 复数主语与谓语一致性的规则。\n\n### 6. 相似句子练习\nTwo challenges exist throughout this learning process.\n\n在这个学习过程中存在两个挑战。\n\n这个句子的结构与原句相似，主语是 \"Two challenges\"，谓语是 \"exist\"，\"throughout this learning process\" 是一个副词短语，修饰谓语，表示这两个挑战在整个学习过程中存在。"},{"text":"First, scientific work tends to focus on some aspect of prevailing knowledge that is viewed as incomplete or incorrect.","explainMd":"### 1. 翻译\n\n首先，科学工作往往关注的是被视为不完整或错误的现有知识的某个方面。\n\n### 2. 词汇和短语\n\n- **First**: 首先。这是一个序数词，常用于列举事项的开始。\n\n- **scientific work**: 科学工作。这是一个名词短语，表示进行科学研究或实验的活动。\n\n- **tends to**: 倾向于。这是一个短语，表示某人或某事有做某事的趋势。\n\n- **focus on**: 关注。这是一个短语，表示把注意力、精力或兴趣集中在某事物上。\n\n- **some aspect of**: 某个方面。这是一个短语，表示事物的某个特定部分。\n\n- **prevailing knowledge**: 现有知识。这是一个名词短语，\"prevailing\" 是形容词，表示主要的、普遍的，\"knowledge\" 是名词，表示知识。这个短语表示的是主流或广为接受的知识。\n\n- **that is viewed as**: 被视为。这是一个关系从句的引导词和动词，表示主句中的事物被看作是什么。\n\n- **incomplete or incorrect**: 不完整或错误的。这是一个形容词短语，用来描述某事物的状态。\n\n### 3. 句子结构\n\n这是一个复合句。主句是 \"First, scientific work tends to focus on some aspect of prevailing knowledge\"，这里的 \"that is viewed as incomplete or incorrect\" 是一个定义性的关系从句，修饰 \"some aspect of prevailing knowledge\"。\n\n### 4. 语法\n\n这个句子中使用了 \"tends to\" 表达趋势，\"focus on\" 表达关注的对象。同时，使用了关系代词 \"that\" 引导的定义性关系从句，对主句中的 \"some aspect of prevailing knowledge\" 进行了详细的描述和定义。\n\n### 5. 知识点总结\n\n- \"Tends to\" 的含义和用法。\n- \"Focus on\" 的含义和用法。\n- 如何使用定义性关系从句来进行描述和定义。\n- \"View as\" 的含义和用法。\n\n### 6. 相似句子练习\n\nFirst, the study tends to focus on some aspect of social behavior that is viewed as unusual or abnormal.\n\n首先，这项研究往往关注的是被视为不寻常或者异常的社会行为的某个方面。\n\n这个句子的结构与原句相似，主语是 \"the study\"，谓语是 \"tends to focus on\"，\"some aspect of social behavior\" 是宾语，\"that is viewed as unusual or abnormal\" 是一个定义性的关系从句，修饰 \"some aspect of social behavior\"。"},{"text":"Little reward accompanies duplication and confirmation of what is already known and believed.","explainMd":"### 1. 翻译\n\n对已知和被接受的事物进行复制和确认往往只会带来少量的回报。\n\n### 2. 词汇和短语\n\n- **Little reward**: 少量的回报。\"Little\" 是一个量词，用于表示数量少的事物，\"reward\" 是名词，代表奖赏或回报。\n\n- **accompanies**: 陪伴，伴随。这是一个动词，表示一种事物随着另一种事物同时出现或发生。\n\n- **duplication and confirmation**: 复制和确认。这是一个由 \"and\" 连接的名词短语，表示两种行为或过程。\n\n- **of what is already known and believed**: 对已知和被接受的事物。这是一个介词短语，\"of\" 是介词，\"what is already known and believed\" 是一个名词性从句，作为 \"of\" 的宾语。\n\n### 3. 句子结构\n\n这是一个简单句。主语是 \"Little reward\"，谓语是 \"accompanies\"，宾语是 \"duplication and confirmation\"，\"of what is already known and believed\" 是一个介词短语，修饰 \"duplication and confirmation\"。\n\n### 4. 语法\n\n这个句子中使用了名词性从句 \"what is already known and believed\" 作为介词 \"of\" 的宾语，表达的是复制和确认的对象。\"Accompanies\" 是一个动词，表示陪伴或伴随的意思，这里用来表示 \"Little reward\" 伴随着 \"duplication and confirmation\" 出现。\n\n### 5. 知识点总结\n\n- \"Accompanies\" 的含义和用法。\n- 如何使用名词性从句作为介词的宾语。\n- \"Little\" 作为量词的含义和用法。\n\n### 6. 相似句子练习\n\nLittle satisfaction accompanies repetition and compliance of what is already understood and followed.\n\n对已理解和遵循的事物进行重复和遵守往往只会带来少量的满足感。\n\n这个句子的结构与原句相似，主语是 \"Little satisfaction\"，谓语是 \"accompanies\"，宾语是 \"repetition and compliance\"，\"of what is already understood and followed\" 是一个介词短语，修饰 \"repetition and compliance\"。"},{"text":"The goal is new-search, not re-search.","explainMd":"### 1. 翻译\n\n目标是新的探索，而不是重复的研究。\n\n### 2. 词汇和短语\n\n- **The goal**: 目标。\"The\" 是定冠词，\"goal\" 是名词，表示目标或目的。\n\n- **is**: 是。这是系动词 \"be\" 的第三人称单数现在时态。\n\n- **new-search, not re-search**: 新的探索，而不是重复的研究。这是一个由 \"not\" 连接的并列结构，意为 \"而不是\"，其中 \"new-search\" 和 \"re-search\" 都是名词，分别表示新的探索和重复的研究。\n\n### 3. 句子结构\n\n这是一个简单句。主语是 \"The goal\"，谓语是 \"is\"，宾语是 \"new-search, not re-search\"。\n\n### 4. 语法\n\n这个句子中使用了并列结构 \"new-search, not re-search\"，表达的是目标的对比，即目标是新的探索，而不是重复的研究。\n\n### 5. 知识点总结\n\n- \"Is\" 的含义和用法。\n- 如何使用并列结构来表达对比。\n- \"The goal\" 的含义和用法。\n\n### 6. 相似句子练习\n\nThe aim is innovation, not imitation.\n\n目标是创新，而不是模仿。\n\n这个句子的结构与原句相似，主语是 \"The aim\"，谓语是 \"is\"，宾语是 \"innovation, not imitation\"。"},{"text":"Not surprisingly, newly published discovery claims and credible discoveries that appear to be important and convincing will always be open to challenge and potential modification or refutation by future researchers.","explainMd":"### 1. 翻译\n\n不出所料，新发布的发现声明和看似重要且令人信服的可信发现总是会受到未来研究者的挑战，可能会被修改或反驳。\n\n### 2. 词汇和短语\n\n- **Not surprisingly**: 不出所料。这是一个副词短语，用来表示某事是预料之中的。\n\n- **newly published discovery claims and credible discoveries**: 新发布的发现声明和可信的发现。这是一个并列结构，连接两种不同的发现。\n\n- **that appear to be important and convincing**: 看似重要且令人信服。这是一个定语从句，修饰前面的 \"discovery claims and credible discoveries\"。\n\n- **will always be open to challenge and potential modification or refutation**: 总是会受到挑战，可能会被修改或反驳。这是主句的谓语部分，描述的是发现的潜在命运。\n\n- **by future researchers**: 由未来的研究者。这是一个介词短语，表示动作的执行者。\n\n### 3. 句子结构\n\n这是一个复合句。主句是 \"newly published discovery claims and credible discoveries ... will always be open to challenge and potential modification or refutation\"，其中包含一个定语从句 \"that appear to be important and convincing\"。\n\n### 4. 语法\n\n这个句子中使用了定语从句 \"that appear to be important and convincing\"，这是一个限制性定语从句，用来修饰 \"newly published discovery claims and credible discoveries\"。\n\n### 5. 知识点总结\n\n- \"Not surprisingly\" 的含义和用法。\n- 如何使用并列结构来连接两种不同的发现。\n- 定语从句的使用和功能。\n- 未来时态的使用。\n\n### 6. 相似句子练习\n\nNot surprisingly, the new theories that seem revolutionary and groundbreaking will always face skepticism and possible alteration or rejection by later scholars.\n\n不出所料，那些看似革命性和开创性的新理论总是会面临后来的学者的怀疑，可能会被修改或拒绝。\n\n这个句子的结构与原句相似，主句是 \"the new theories ... will always face skepticism and possible alteration or rejection\"，其中包含一个定语从句 \"that seem revolutionary and groundbreaking\"。"},{"text":"Second, novelty itself frequently provokes disbelief.","explainMd":"### 1. 翻译\n\n其次，新鲜事物本身经常引发怀疑。\n\n### 2. 词汇和短语\n\n- **Second**: 其次。通常用于列举或者阐述观点，表示接下来要讲的是第二个重要的点。\n\n- **novelty**: 新奇性，新颖。这是一个名词，通常用于描述一种新颖的事物或者观念。\n\n- **itself**: 本身。这是一个反身代词，通常用于强调前面的名词。\n\n- **frequently**: 经常。这是一个副词，表示某种行为或者状态的频率。\n\n- **provokes**: 引发，激起。这是一个动词，表示某种行为或者状态的出现是由某种因素激发的。\n\n- **disbelief**: 怀疑，不信。这是一个名词，表示对某种观念或者事实的怀疑或者不信。\n\n### 3. 句子结构\n\n这是一个简单句。主语是 \"novelty itself\"，谓语是 \"frequently provokes disbelief\"。\n\n### 4. 语法\n\n这个句子的语法结构非常简单，只有一个主语和一个谓语。主语 \"novelty itself\" 是一个名词短语，其中 \"itself\" 是一个反身代词，用于强调 \"novelty\"。谓语 \"frequently provokes disbelief\" 是一个动词短语，其中 \"frequently\" 是一个副词，用于修饰动词 \"provokes\"。\n\n### 5. 知识点总结\n\n- \"Second\" 的含义和用法。\n- 如何使用反身代词 \"itself\" 进行强调。\n- \"frequently\" 的含义和用法。\n- 如何构造一个简单句。\n\n### 6. 相似句子练习\n\nSecond, innovation itself often incites skepticism.\n\n其次，创新本身经常引发怀疑。\n\n这个句子的结构与原句相似，主语是 \"innovation itself\"，谓语是 \"often incites skepticism\"。"},{"text":"Nobel Laureate and physiologist Albert Szent-Györgyi once described discovery as “seeing what everybody has seen and thinking what nobody has thought.” But thinking what nobody else has thought and telling others what they have missed may not change their views.","explainMd":"### 1. 翻译\n\n诺贝尔奖得主和生理学家阿尔伯特·森特-乔尔吉曾经描述过发现的过程，他说：“发现就是看到每个人都看过的东西，但想到别人都没想过的东西。” 但是，想到别人都没想过的东西，并告诉别人他们错过了什么，可能并不能改变他们的观点。\n\n### 2. 词汇和短语\n\n- **Nobel Laureate**: 诺贝尔奖得主。这个短语通常用于表示荣获诺贝尔奖的人。\n\n- **physiologist**: 生理学家。这个词表示研究生理学的科学家。\n\n- **described**: 描述。这个词通常用于说明某人对某事物的理解或感觉。\n\n- **discovery**: 发现。这个词可以指具有重大科学意义的新发现，也可以是个人对某事物的新理解。\n\n- **seeing**: 看见。这个词在这里是动词的现在分词形式，用于构成进行时态。\n\n- **thinking**: 想法，思考。这个词在这里是动词的现在分词形式，用于表达一种心理状态。\n\n- **change their views**: 改变他们的观点。这是一个短语，用于表示对某事物的理解或感觉的变化。\n\n### 3. 句子结构\n\n这个句子其实是由两个并列的句子构成的。第一个句子的主语是 \"Albert Szent-Györgyi\"，谓语是 \"described discovery\"，宾语是引用的一段话。第二个句子的主语是 \"thinking what nobody else has thought and telling others what they have missed\"，谓语是 \"may not change\"，宾语是 \"their views\"。\n\n### 4. 语法\n\n- 这个句子中使用了引语的结构，引语是 \"seeing what everybody has seen and thinking what nobody has thought\"。\n\n- 这个句子中使用了并列的结构，两个句子之间用 \"but\" 连接。\n\n- 第二个句子中使用了虚拟语气，表示对未来的一种假设或者可能。\n\n### 5. 知识点总结\n\n- 如何使用引语的结构。\n- 如何使用并列的结构。\n- 如何使用虚拟语气。\n\n### 6. 相似句子练习\n\nPhysicist and Nobel Laureate Richard Feynman once said, \"The first principle is that you must not fool yourself—and you are the easiest person to fool.\" But recognizing our own biases and preconceptions may not necessarily lead to a change in our perspectives.\n\n物理学家和诺贝尔奖得主理查德·费曼曾经说过：“第一原则是你不能欺骗自己——而你是最容易被欺骗的人。”但是，识别我们自己的偏见和先入之见可能并不一定会引导我们改变观点。"},{"text":"Sometimes years are required for truly novel discovery claims to be accepted and appreciated.","explainMd":"### 1. 翻译\n\n有时，真正新颖的发现需要数年的时间才能被接受和赞赏。\n\n### 2. 词汇和短语\n\n- **Sometimes**: 有时。这个词用于表示某事情并非总是发生，而是在某些情况或某些时候发生。\n\n- **Years**: 年。这个词用来度量时间长度，多个 \"year\" 的复数形式。\n\n- **Required**: 需要。这个词通常用于表示完成某项任务或达到某个目标所必需的事物。\n\n- **Truly novel**: 真正新颖。这个短语用于强调事物的新颖性和独特性。\n\n- **Discovery claims**: 发现声明。这个短语在这篇文章中指的是科学家对他们的新发现的声明或描述。\n\n- **Accepted**: 被接受。这个词用于表示社区或集体对某事物的认可和接受。\n\n- **Appreciated**: 被赞赏。这个词表示对某事物的高度评价和欣赏。\n\n### 3. 句子结构\n\n这个句子的结构较为简单。主语是 \"years\"，谓语是 \"are required\"，而宾语是 \"for truly novel discovery claims to be accepted and appreciated\"。这个句子使用了 \"for...to\" 结构的复合宾语。\n\n### 4. 语法\n\n- 这个句子中使用了被动语态 \"are required\"，强调的是结果或状态，而不是动作的执行者。\n\n- 这个句子中使用了 \"for...to\" 结构的复合宾语，这是英语中常见的一个结构，通常用于表达 \"为了\"。\n\n### 5. 知识点总结\n\n- 如何使用被动语态表达结果或状态。\n- 如何使用 \"for...to\" 结构的复合宾语表示目的。\n\n### 6. 相似句子练习\n\nSometimes decades are needed for groundbreaking scientific theories to gain widespread recognition.\n\n有时，破天荒的科学理论需要数十年的时间才能获得广泛的认可。"}]},{"sentences":[{"text":"In the end, credibility “happens” to a discovery claim—a process that corresponds to what philosopher Annette Baier has described as the commons of the mind.","explainMd":"### 1. 翻译\n\n最后，可信度“降临”于发现的声明——这是一个过程，符合哲学家安妮特·贝尔描述的心灵公共领域。\n\n### 2. 词汇和短语\n\n- **In the end**: 最后。这个短语用来引导一个结果或结论。\n\n- **Credibility**: 可信度。这个词用来描述一个人、事物或陈述的信任度。\n\n- **Happens**: 降临。在这个上下文中，这个词用来描述某种属性或状态的出现或实现。\n\n- **Discovery claim**: 发现声明。这个短语在这篇文章中指的是科学家对他们的新发现的声明或描述。\n\n- **Process**: 过程。这个词用来描述由一系列步骤或行动组成的活动。\n\n- **Corresponds to**: 符合，对应。这个短语用来表示两个事物之间的一致性或相似性。\n\n- **Philosopher**: 哲学家。这个词用来描述研究哲学的人。\n\n- **Described**: 描述。这个动词用来表达对某事物的详细解释或描绘。\n\n- **The commons of the mind**: 心灵公共领域。这是一个由哲学家安妮特·贝尔提出的概念，指的是人们共同的思考、理解和知识。\n\n### 3. 句子结构\n\n这个句子的结构较为复杂。主句是 \"credibility happens to a discovery claim\"，后面跟着一个破折号，然后是一个从句 \"a process that corresponds to what philosopher Annette Baier has described as the commons of the mind\"，这个从句用来进一步解释主句中的 \"process\"。\n\n### 4. 语法\n\n- 这个句子中使用了现在时，表达了一个普遍的现象或状态。\n\n- 这个句子中使用了破折号来连接主句和从句，这是一种常见的方式，用来增加解释或额外的信息。\n\n### 5. 知识点总结\n\n- 如何使用现在时表达普遍的现象或状态。\n- 如何使用破折号来连接主句和从句，增加解释或额外的信息。\n\n### 6. 相似句子练习\n\nIn the end, respect is earned by a person—a process that aligns with what philosopher John Locke has defined as the social contract.\n\n最后，尊敬是人们赢得的——这是一个过程，符合哲学家约翰·洛克定义的社会契约。"},{"text":"“We reason together, challenge, revise, and complete each other’s reasoning and each other’s conceptions of reason.”","explainMd":"### 1. 翻译\n\n\"我们一起推理，质疑，修改，并补充每个人的推理和理性的概念。\"\n\n### 2. 词汇和短语\n\n- **We reason together**: 我们一起推理。这个短语表达了一种共同的思考或推理的过程。\n\n- **Challenge**: 质疑。这个词用来表示对某事物的疑问或挑战。\n\n- **Revise**: 修改。这个词用来表达对某事物的改变或修订。\n\n- **Complete**: 补充。这个词用来表示对某事物的增加或完善。\n\n- **Each other's reasoning**: 每个人的推理。这个短语用来表达共享的或交互的思考或推理。\n\n- **Conceptions of reason**: 理性的概念。这个短语用来表示对理性或逻辑的理解或观念。\n\n### 3. 句子结构\n\n这个句子的结构比较简单，主要由一系列的并列结构构成，每个动词（reason, challenge, revise, complete）后面都跟着一个宾语（together, each other's reasoning, and each other's conceptions of reason）。\n\n### 4. 语法\n\n- 这个句子使用了一种称为并列结构的语法形式，其中多个短语或句子在语法上是相等的，并且由并列连词（如and）连接。\n\n- 这个句子使用了现在时，表达的是一种持续的、经常发生的动作或状态。\n\n### 5. 知识点总结\n\n- 如何使用并列结构来连接多个短语或句子。\n- 如何使用现在时来表达持续的、经常发生的动作或状态。\n\n### 6. 相似句子练习\n\n\"We study together, question, adapt, and enrich each other's understanding and each other's perspectives of the world.\"\n\n\"我们一起学习，质疑，适应，并且丰富每个人的对世界的理解和视角。\""}]}],"title":""}