{"translate":"","paragraphs":[{"sentences":[{"text":"Come on—Everybody’s doing it.","explainMd":"### 1. 翻译\n\n来吧——每个人都在做。\n\n### 2. 词汇和短语\n\n- **Come on**：这是一个常见的口语短语，用于鼓励、挑逗或催促某人做某事。\n- **Everybody's doing it**：这是一个常用的短语，用于说明某种行为或活动是普遍的或被广泛接受的。\n\n### 3. 句子结构\n\n这是一个简单的句子，包含两个并列的独立子句，由破折号分隔。第一个子句是一个催促的短语 \"Come on\"，第二个子句是一个陈述句 \"Everybody's doing it\"。\n\n### 4. 语法\n\n这个句子使用了现在进行时（\"Everybody's doing it\"），表明一个正在进行或是一个普遍存在的现象。此外，这个句子也使用了省略（ellipsis），在 \"Come on\" 后面省略了动词，这在口语中是常见的。\n\n### 5. 知识点总结\n\n这个句子的关键知识点包括如何使用现在进行时来描述正在进行或普遍存在的现象，以及如何在口语中使用省略。\n\n### 6. 相似句子练习\n\nJust do it—Everyone else is.\n\n只管去做吧——其他人都在做。"},{"text":"That whispered message, half invitation and half forcing, is what most of us think of when we hear the words peer pressure.","explainMd":"### 1. 翻译\n\n那种低声的信息，一半是邀请，一半是强迫，是我们大多数人听到“同辈压力”这个词时想到的。\n\n### 2. 词汇和短语\n\n- **whispered message**: 指的是那种低声细语的信息或者建议。\n- **half invitation and half forcing**: 这是一个形象的说法，用来描述一种既有邀请的成分，又有强迫的成分的情形。\n- **peer pressure**: 这是一个常用的短语，指由同龄人或同辈人施加的影响或压力。\n\n### 3. 句子结构\n\n这个句子是一个复合句，主句是 \"That whispered message is what most of us think of when we hear the words peer pressure.\"，其中包含一个由 \"when\" 引导的时间状语从句 \"when we hear the words peer pressure\"。\n\n### 4. 语法\n\n这个句子中的 \"what\" 引导了一个名词性从句，作为 \"think of\" 的宾语。在这个句子中，\"what\" 的用法比较特殊，相当于 \"the thing that\"。\n\n### 5. 知识点总结\n\n这个句子的关键知识点包括如何使用 \"what\" 来引导名词性从句，以及如何使用 \"when\" 来引导时间状语从句。\n\n### 6. 相似句子练习\n\nThe quiet suggestion, half persuasion and half compulsion, is what many of us consider when we encounter the term social influence.\n\n那个安静的建议，一半是说服，一半是强迫，是我们很多人在遇到“社会影响”这个词时会考虑的。"},{"text":"It usually leads to no good—drinking, drugs and casual sex.","explainMd":"### 1. 翻译\n\n它通常只会导致不良后果——喝酒、吸毒和随意性行为。\n\n### 2. 词汇和短语\n\n- **leads to**: 这是一个常用短语，表示一种行为或事件导致了某个结果或后果。\n- **no good**: 这是一个口语短语，通常用来描述不良的、有害的或者不愉快的结果或后果。\n- **drinking, drugs and casual sex**: 这三个词汇都是通常被认为是不健康或者有害的行为。\n\n### 3. 句子结构\n\n这是一个简单的句子，主语是\"It\"，谓语是\"leads to\"，宾语是\"no good—drinking, drugs and casual sex\"。\n\n### 4. 语法\n\n这个句子使用了破折号来列举与 \"no good\" 相关的具体内容，这是一种强调的语法结构。\n\n### 5. 知识点总结\n\n这个句子的关键知识点包括如何使用 \"leads to\" 这个短语来表示结果或后果，以及如何使用破折号来进行强调或列举。\n\n### 6. 相似句子练习\n\nIt usually ends in disaster—reckless driving, excessive alcohol consumption and violence.\n\n它通常会以灾难告终——鲁莽驾驶、过度饮酒和暴力行为。"},{"text":"But in her new book Join the Club, Tina Rosenberg contends that peer pressure can also be a positive force through what she calls the social cure, in which organizations and officials use the power of group dynamics to help individuals improve their lives and possibly the world.","explainMd":"### 1. 翻译\n\n但在她的新书《加入俱乐部》中，蒂娜·罗森伯格争辩称，同辈压力也可以通过她所称的社会疗法成为一种积极力量，在这种疗法中，组织和官员利用群体动力来帮助个人改善他们的生活，甚至可能改变世界。\n\n### 2. 词汇和短语\n\n- **contends**: 这是一个动词，用来表示主张、争辩或坚决认为。\n- **peer pressure**: 这是一个常用的短语，指由同龄人或同辈人施加的影响或压力。\n- **a positive force**: 这是一个形象的说法，用来描述一种积极的影响或力量。\n- **the social cure**: 这是作者创造的短语，用来描述一种通过群体动力来改善个人生活的方法或策略。\n- **group dynamics**: 这是一个社会科学中的常见短语，指的是在一个群体中，成员之间的相互作用和影响。\n\n### 3. 句子结构\n\n这是一个复杂的句子，主句是 \"Tina Rosenberg contends that peer pressure can also be a positive force\"，其中包含一个由 \"that\" 引导的宾语从句。这个宾语从句中又包含了一个由 \"in which\" 引导的定语从句 \"in which organizations and officials use the power of group dynamics to help individuals improve their lives and possibly the world\"。\n\n### 4. 语法\n\n这个句子中的 \"that\" 引导了一个名词性从句，作为 \"contends\" 的宾语。在这个句子中，\"in which\" 引导了一个定语从句，用来修饰前面的 \"social cure\"。\n\n### 5. 知识点总结\n\n这个句子的关键知识点包括如何使用 \"that\" 来引导名词性从句，以及如何使用 \"in which\" 来引导定语从句。\n\n### 6. 相似句子练习\n\nIn his latest research, John Smith argues that social interaction can also be a powerful tool through what he calls the community engagement, in which citizens and local authorities utilize the strength of community relations to better their neighborhood and potentially the society.\n\n在他的最新研究中，约翰·史密斯争辩说，社交互动也可以通过他所称的社区参与成为一种强大的工具，在这种参与中，公民和地方当局利用社区关系的力量来改善他们的社区，甚至可能改善社会。"}]},{"sentences":[{"text":"Rosenberg, the recipient of a Pulitzer Prize, offers a host of examples of the social cure in action: In South Carolina, a state-sponsored antismoking program called Rage Against the Haze sets out to make cigarettes uncool.","explainMd":"### 1. 翻译\n\n罗森伯格，一位普利策奖得主，提供了一系列社会疗法的实践例子：在南卡罗来纳州，一个名为“对抗烟雾”的国家赞助的反吸烟程序致力于让香烟变得不受欢迎。\n\n### 2. 词汇和短语\n\n- **the recipient of a Pulitzer Prize**: 普利策奖的接受者或获得者。\n- **offers a host of examples**: 提供了大量的例子。\n- **the social cure in action**: 社会疗法的实践或应用。\n- **a state-sponsored antismoking program**: 一个由州政府赞助的反吸烟程序。\n- **sets out to**: 开始做，着手处理。\n\n### 3. 句子结构\n\n这个句子的主要结构是： \"Rosenberg offers a host of examples of the social cure in action\"。然后，句子中的一个冒号引入了一个具体的例子，这个例子是一个完整的句子：\"In South Carolina, a state-sponsored antismoking program called Rage Against the Haze sets out to make cigarettes uncool\"。\n\n### 4. 语法\n\n这个句子的主要语法特点是使用了冒号（:）来引出具体的例子。在英语中，冒号通常用来引出一个解释、说明、例子或者列表。\n\n### 5. 知识点总结\n\n这个句子的关键知识点主要是如何使用冒号来引出详细的列表或例子，以及如何使用 \"sets out to\" 来表达 \"开始做某事\" 的意思。\n\n### 6. 相似句子练习\n\nGates, the co-founder of Microsoft, provides a number of instances of technological innovation in practice: In California, a government-backed renewable energy project called Sun Power aims to make solar energy more accessible.\n\n盖茨，微软的联合创始人，提供了一系列技术创新的实践例子：在加利福尼亚州，一个名为“太阳能力量”的政府支持的可再生能源项目旨在让太阳能更容易被大众接受。"},{"text":"In South Africa, an HIV-prevention initiative known as LoveLife recruits young people to promote safe sex among their peers.","explainMd":"### 1. 翻译\n\n在南非，一个名为LoveLife的HIV预防项目招募年轻人在他们的同龄人中间推广安全性行为。\n\n### 2. 词汇和短语\n\n- **an HIV-prevention initiative**: 一个HIV预防项目。\n- **known as LoveLife**: 以LoveLife为名的。\n- **recruits young people**: 招募年轻人。\n- **to promote safe sex among their peers**: 在他们的同龄人中间推广安全性行为。\n\n### 3. 句子结构\n\n这个句子的主要结构是：“an initiative recruits young people to do something”。然后，一些额外的描述性信息被添加到句子中，例如该项目在哪个国家（South Africa），该项目的名字（known as LoveLife），以及年轻人被招募来做什么（promote safe sex among their peers）。\n\n### 4. 语法\n\n这个句子的主要语法特点是使用了被动语态的形式“known as LoveLife”来描述该项目的名称。在英语中，被动语态通常用来强调行动的接受者，而不是行动的执行者。\n\n### 5. 知识点总结\n\n这个句子的关键知识点包括如何使用被动语态来描述某物或某人的特性或名称，以及如何使用\"recruits...to\"的结构描述一个项目或组织的目标或目的。\n\n### 6. 相似句子练习\n\nIn the United States, a food waste reduction campaign called Save the Scraps employs students to encourage sustainable eating habits among their schoolmates.\n\n在美国，一个名为“Save the Scraps”的减少食物浪费的活动雇佣学生们在他们的同学中推广可持续的饮食习惯。"}]},{"sentences":[{"text":"The idea seems promising, and Rosenberg is a perceptive observer.","explainMd":"### 1. 翻译\n\n这个想法看起来有前途，罗森伯格是一个有洞察力的观察者。\n\n### 2. 词汇和短语\n\n- **The idea**: 这个想法，指的是前文提到的社会治愈的概念。\n- **seems promising**: 看起来有前途，有可能成功。\n- **Rosenberg**: 罗森伯格，是这本书的作者。\n- **is a perceptive observer**: 是一个有洞察力的观察者。\n\n### 3. 句子结构\n\n这个句子的基本结构是“Subject (Rosenberg) + is + Complement (a perceptive observer)”。此外，它还使用了一个并列结构，即“the idea seems promising”，并通过连词\"and\"将两个独立的句子连接在一起。\n\n### 4. 语法\n\n这个句子的语法特点是使用了现在时态和并列结构。现在时态表示现在或一般的情况，而并列结构通过连接词（如\"and\"）连接两个或更多的句子、短语或词。\n\n### 5. 知识点总结\n\n这个句子的关键知识点包括如何使用现在时态来描述现在的情况或一般真理，如何使用并列结构来连接两个或更多的句子或短语，以及如何使用“be + 形容词”结构来描述主语的特性。\n\n### 6. 相似句子练习\n\nThe plan looks feasible, and Smith is an insightful analyst.\n\n这个计划看起来可行，史密斯是一个有洞察力的分析师。"},{"text":"Her critique of the lameness of many public-health campaigns is spot-on: they fail to mobilize peer pressure for healthy habits, and they demonstrate a seriously flawed understanding of psychology.","explainMd":"### 1. 翻译\n\n她对许多公共卫生运动的乏味之处的批评一针见血：它们未能调动群体压力来形成健康习惯，而且它们对心理学的理解严重有误。\n\n### 2. 词汇和短语\n\n- **Her critique**: 她的批评，这里指的是罗森伯格的批评。\n- **of the lameness of many public-health campaigns**: 对许多公共卫生运动的乏味之处，\"lameness\"在这里表示的是无趣或无效的意思。\n- **is spot-on**: 一针见血，非常准确。\n- **they fail to mobilize peer pressure**: 它们未能调动群体压力，\"mobilize\"在这里是指激发或利用群体压力。\n- **for healthy habits**: 形成健康习惯。\n- **and they demonstrate a seriously flawed understanding of psychology**: 并且它们展示了对心理学的严重误解。\n\n### 3. 句子结构\n\n这个句子的基本结构是“Subject (Her critique) + is + Complement (spot-on)”。它的结构比较复杂，包括了两个并列的子句：\"they fail to mobilize peer pressure for healthy habits\" 和 \"they demonstrate a seriously flawed understanding of psychology\"，这两个子句通过连词\"and\"连接在一起。\n\n### 4. 语法\n\n这个句子的语法特点是使用了现在时态和并列结构。现在时态表示现在或一般的情况，而并列结构通过连接词（如\"and\"）连接两个或更多的句子、短语或词。\n\n### 5. 知识点总结\n\n这个句子的关键知识点包括如何使用现在时态来描述现在的情况或一般真理，如何使用并列结构来连接两个或更多的句子或短语，以及如何使用“be + 形容词”结构来描述主语的特性。\n\n### 6. 相似句子练习\n\nHis analysis of the weakness of many educational systems is precise: they fail to inspire self-learning among students, and they show a deep misunderstanding of modern pedagogy.\n\n他对许多教育系统中的弱点的分析非常精确：他们未能激发学生的自我学习，而且他们对现代教育学的理解深深有误。"},{"text":"“Dare to be different, please don’t smoke!” pleads one billboard campaign aimed at reducing smoking among teenagers—teenagers, who desire nothing more than fitting in.","explainMd":"### 1. 翻译\n\n\"敢于与众不同，请不要吸烟！\"这是一项针对减少青少年吸烟的户外广告活动的呼吁——青少年，而他们最渴望的无非就是融入大众。\n\n### 2. 词汇和短语\n\n- **\"Dare to be different, please don’t smoke!”**: \"敢于与众不同，请不要吸烟！\"，这是广告语的直接引用。\n- **pleads**: 呼吁，强烈请求。\n- **one billboard campaign**: 一项户外广告活动。\n- **aimed at reducing smoking among teenagers**: 旨在减少青少年吸烟。\n- **teenagers, who desire nothing more than fitting in**: 青少年，他们最渴望的无非就是融入大众。\n\n### 3. 句子结构\n\n这个句子的基本结构是“Subject (one billboard campaign) + Verb (pleads) + Object (\"Dare to be different, please don’t smoke!”)”。然后，通过使用“aimed at reducing smoking among teenagers”这个短语来修饰主语，并使用限定性定语从句“who desire nothing more than fitting in”来对\"teenagers\"进行详细描述。\n\n### 4. 语法\n\n这个句子主要的语法特点是使用了现在时态、直接引用和限定性定语从句。现在时态表示现在或一般的情况，直接引用用于引述原话，而限定性定语从句用于描述或详细说明名词。\n\n### 5. 知识点总结\n\n这个句子的关键知识点包括如何使用现在时态来描述现在或一般的情况，如何使用直接引用来引述原话，以及如何使用限定性定语从句来详细描述名词。\n\n### 6. 相似句子练习\n\n\"Stay true to yourself, don't follow the crowd!\" encourages one social media campaign aimed at promoting individuality among young people—young people, who are often under pressure to conform.\n\n\"保持真我，不要随大流！\"这是一项旨在促进年轻人个性发展的社交媒体活动的鼓励——年轻人，他们常常面临着顺应大众的压力。"},{"text":"Rosenberg argues convincingly that public-health advocates ought to take a page from advertisers, so skilled at applying peer pressure.","explainMd":"### 1. 翻译\n\n罗森伯格令人信服地争论，公共卫生倡导者应该向广告商学习，他们非常擅长应用群体压力。\n\n### 2. 词汇和短语\n\n- **Rosenberg argues convincingly**: 罗森伯格有力地争论，\"argues convincingly\" 是一个动词短语，表示有力的、令人信服的争论或论证。\n- **public-health advocates**: 公共卫生倡导者，这是一个名词短语，指提倡和推动公共卫生事业的人。\n- **ought to take a page from advertisers**: 应该向广告商学习，\"take a page from\" 是一个短语，表示“从...那里学习或借鉴”。\n- **so skilled at applying peer pressure**: 非常擅长应用群体压力，这是一个形容词短语，用来描述广告商的一种特性。\n\n### 3. 句子结构\n\n这个句子的基本结构是“主语(Rosenberg) + 动词(argues) + 宾语(that public-health advocates ought to take a page from advertisers)”。然后，通过使用“so skilled at applying peer pressure”这个形容词短语来修饰和详细描述广告商。\n\n### 4. 语法\n\n这个句子主要的语法特点是使用了现在时态和宾语从句。现在时态表示现在或一般的情况，而宾语从句是作为动词（argues）的宾语，用来表达主语（Rosenberg）的观点或论述。\n\n### 5. 知识点总结\n\n这个句子的关键知识点包括如何使用现在时态来描述现在或一般的情况，以及如何使用宾语从句来表达主语的观点或论述。\n\n### 6. 相似句子练习\n\n\"Smith insists firmly that educators should learn from game designers, so proficient at engaging student interest.\"\n\n\"史密斯坚定地坚称，教育工作者应该向游戏设计师学习，他们非常擅长吸引学生的兴趣。\""}]},{"sentences":[{"text":"But on the general effectiveness of the social cure, Rosenberg is less persuasive.","explainMd":"### 1. 翻译\n\n但是在社会治疗的总体效果上，罗森伯格的论证并不那么令人信服。\n\n### 2. 词汇和短语\n\n- **But on the general effectiveness of the social cure**: 但是在社会治疗的总体效果上，这是一个介词短语，用作本句的主题。\n- **Rosenberg**: 罗森伯格，指的是作者Tina Rosenberg。\n- **is less persuasive**: 论证不够令人信服，这是一个动词短语，用来描述Rosenberg的论证的效果。\n\n### 3. 句子结构\n\n这个句子的基本结构是“主题（But on the general effectiveness of the social cure） + 主语（Rosenberg）+ 谓语（is）+ 表语（less persuasive）”。它是一个简单句，只包含一个主语和一个谓语。\n\n### 4. 语法\n\n这个句子的主要语法特点是使用了现在时态和比较级。现在时态表示现在或一般的情况，而比较级（less persuasive）则用来比较Rosenberg在不同方面的论证的效果。\n\n### 5. 知识点总结\n\n这个句子的关键知识点包括如何使用现在时态来描述现在或一般的情况，以及如何使用比较级来进行比较。\n\n### 6. 相似句子练习\n\n\"But on the overall benefits of exercise, Johnson is less compelling.\"\n\n\"但在运动的总体益处上，约翰逊的论证不够有说服力。\""},{"text":"Join the Club is filled with too much irrelevant detail and not enough exploration of the social and biological factors that make peer pressure so powerful.","explainMd":"### 1. 翻译\n\n\"Join the Club\"这本书充斥着太多无关紧要的细节，而对于使同伴压力如此强大的社会和生物因素的探索却远远不够。\n\n### 2. 词汇和短语\n\n- **Join the Club**: \"Join the Club\"，这是书名，直译为“加入俱乐部”。\n- **is filled with**: 充满了，这是一个动词短语，用来描述书的内容。\n- **too much irrelevant detail**: 太多无关紧要的细节，这是一个带有修饰词的名词短语。\n- **not enough exploration of**: 对...的探索不够，这是一个表示不足的短语。\n- **the social and biological factors**: 社会和生物因素，这是一个并列的名词短语。\n- **that make peer pressure so powerful**: 使同伴压力如此强大，这是一个定语从句，用来修饰前面的“因素”。\n\n### 3. 句子结构\n\n这个句子的基本结构是“主语（Join the Club）+ 谓语（is filled with）+ 宾语（too much irrelevant detail and not enough exploration of the social and biological factors that make peer pressure so powerful）”。它是一个复合句，包含主句和定语从句。\n\n### 4. 语法\n\n这个句子的主要语法特点是使用了现在时态和定语从句。现在时态用来描述现在或一般的情况，而定语从句用来修饰前面的名词。\n\n### 5. 知识点总结\n\n这个句子的关键知识点包括如何使用现在时态来描述一般情况，如何使用定语从句来修饰名词，以及如何使用修饰词来强调意思。\n\n### 6. 相似句子练习\n\n\"The report is filled with too much technical jargon and not enough analysis of the economic factors that make the market so volatile.\"\n\n\"这份报告充满了太多的技术术语，而对于使市场如此不稳定的经济因素的分析却远远不足。\""},{"text":"The most glaring flaw of the social cure as it’s presented here is that it doesn’t work very well for very long.","explainMd":"### 1. 翻译\n\n这里提出的社会治疗的最显著的缺陷是，它并不能长久且有效地起作用。\n\n### 2. 词汇和短语\n\n- **The most glaring flaw**: 最显著的缺陷，这是一个带有修饰语的名词短语。\n\n- **of the social cure as it’s presented here**: 如这里所述的社会治疗，这是一个介词短语，作为定语修饰前面的\"flaw\"。\n\n- **is that**: 是...，这是一个连接词，用于引导表语从句。\n\n- **it doesn’t work very well for very long**: 它并不能长久且有效地起作用，这是一个否定的表语从句。\n\n### 3. 句子结构\n\n这个句子的基本结构是“主语（The most glaring flaw of the social cure as it’s presented here）+ 谓语（is）+ 表语（that it doesn’t work very well for very long）”。这是一个复合句，包含主句和表语从句。\n\n### 4. 语法\n\n这个句子的主要语法特点是使用了现在时态和表语从句。现在时态用来描述一般情况，而表语从句用来补充谓语后的内容。\n\n### 5. 知识点总结\n\n这个句子的关键知识点包括如何使用现在时态来描述一般情况，如何使用表语从句来补充谓语后的内容，以及如何使用修饰词来强调意思。\n\n### 6. 相似句子练习\n\n\"The main downside of the education system as it's implemented here is that it doesn't encourage creative thinking.\"\n\n\"这里实施的教育制度的主要缺点是，它并不鼓励创新思维。\""},{"text":"Rage Against the Haze failed once state funding was cut.","explainMd":"### 1. 翻译\n\n一旦州政府的资金支持被切断，\"Rage Against the Haze\"这个项目就失败了。\n\n### 2. 词汇和短语\n\n- **Rage Against the Haze**: 是南卡罗来纳州的一个反对吸烟的项目名称。\n\n- **failed**: 失败，这是一个动词，表示事情未能成功。\n\n- **once**: 一旦，这是一个连接词，用于连接两个事件，并表示一个事件发生后另一个事件将会发生。\n\n- **state funding was cut**: 州政府的资金被切断，这是一个被动语态的短语，表示资金的提供被停止了。\n\n### 3. 句子结构\n\n这个句子的基本结构是“主语（Rage Against the Haze）+ 谓语（failed）+ 时间状语（once state funding was cut）”。这是一个简单句。\n\n### 4. 语法\n\n这个句子的主要语法特点是利用了简单句和被动语态。简单句用来描述一个明确的事件，而被动语态用来强调动作的接受者（这个项目）。\n\n### 5. 知识点总结\n\n这个句子的关键知识点包括如何使用简单句来描述一个明确的事件，如何使用被动语态来强调动作的接受者，以及如何使用连接词\"once\"来表达一个事件发生后另一个事件会发生的情况。\n\n### 6. 相似句子练习\n\n\"The project came to a halt once the funding was withdrawn.\"\n\n\"一旦资金被撤回，这个项目就停止了。\""},{"text":"Evidence that the LoveLife program produces lasting changes is limited and mixed.","explainMd":"### 1. 翻译\n\n证据显示，LoveLife项目产生的持久变化是有限且混杂的。\n\n### 2. 词汇和短语\n\n- **Evidence**: 证据，这是一个名词，表示支持一个观点或理论的事实或信息。\n\n- **the LoveLife program**: LoveLife项目，这是一个HIV预防的项目。\n\n- **produces lasting changes**: 产生持久变化，这是一个动词短语，表示的是一个持续性的结果或效果。\n\n- **is limited and mixed**: 是有限且混杂的，这是一个形容词短语，表示的是结果或效果的数量和质量受到限制并且不一致。\n\n### 3. 句子结构\n\n这个句子的基本结构是“主语（Evidence）+ 定语从句（that the LoveLife program produces lasting changes）+ 谓语（is limited and mixed）”。这是一个带有定语从句的复合句。\n\n### 4. 语法\n\n句子使用了定语从句来修饰主语\"Evidence\"。定语从句提供了关于主语的详细信息，使句子的含义更加明确。\n\n### 5. 知识点总结\n\n这个句子的关键知识点包括如何使用定语从句来修饰主语，以及如何使用形容词短语来描述一个有限和混杂的结果或效果。\n\n### 6. 相似句子练习\n\n\"Proof that the new policy brings significant improvement is scarce and inconsistent.\"\n\n\"证明新政策带来显著改善的证据是稀缺且不一致的。\""}]},{"sentences":[{"text":"There’s no doubt that our peer groups exert enormous influence on our behavior.","explainMd":"### 1. 翻译\n\n毫无疑问，我们的朋友圈对我们的行为产生了巨大的影响。\n\n### 2. 词汇和短语\n\n- **There’s no doubt that**: 毫无疑问，这是一个固定短语，用于强调某个事实或观点是真实的或正确的。\n\n- **peer groups**: 朋友圈，这是一个名词短语，指的是一个人的同龄人或朋友。\n\n- **exert enormous influence on**: 对......产生巨大影响，这是一个动词短语，用于描述一种强烈的影响或效果。\n\n- **behavior**: 行为，这是一个名词，指的是一个人的行动或反应。\n\n### 3. 句子结构\n\n这个句子的基本结构是“主语（There）+ 谓语（is no doubt）+ 宾语（that our peer groups exert enormous influence on our behavior）”。这是一个主谓宾结构的复合句。\n\n### 4. 语法\n\n句子使用了名词性从句作为宾语，用来描述主语 \"There is no doubt\" 的具体内容。名词性从句在此扮演了宾语的角色，详细展示了毫无疑问的内容是什么。\n\n### 5. 知识点总结\n\n这个句子的关键知识点包括如何使用名词性从句作为宾语来详细展示主语的内容，以及如何使用固定短语 \"There's no doubt that\" 来强调某个事实或观点是真实的或正确的。\n\n### 6. 相似句子练习\n\n\"It's undeniable that our environment has a significant impact on our lifestyle.\"\n\n\"无可否认，我们的环境对我们的生活方式产生了重大影响。\""},{"text":"An emerging body of research shows that positive health habits—as well as negative ones—spread through networks of friends via social communication.","explainMd":"### 1. 翻译\n\n新兴的研究成果显示，通过社交交流，积极的健康习惯－以及负面的习惯－在朋友网络中传播。\n\n### 2. 词汇和短语\n\n- **emerging**: 新兴的，描述新出现或正在发展的事物。\n\n- **body of research**: 研究成果，指一系列相关的研究或论文。\n\n- **positive health habits and negative ones**: 正面和负面的健康习惯，描述有益和有害的健康行为。\n\n- **spread through**: 通过......传播，描述信息、疾病或者趋势的传播方式。\n\n- **networks of friends**: 朋友网络，表示朋友或熟人间的联系网。\n\n- **via social communication**: 通过社交交流，描述信息传递的方式。\n\n### 3. 句子结构\n\n这是一个复杂句子，主要包括主语（An emerging body of research），谓语（shows），宾语（that positive health habits—as well as negative ones—spread through networks of friends via social communication）。\n\n### 4. 语法\n\n该句使用了名词性从句作为主句的宾语，详细解释了主语的内容。\"that\"引导的是一个宾语从句，该从句详细解释了新兴的研究成果所显示的具体内容。\n\n### 5. 知识点总结\n\n这个句子的关键知识点主要在于如何使用名词性从句作为宾语来详细解释主语的内容。同时，也需要理解诸如“emerging”, \"body of research\", \"spread through\", \"networks of friends\"以及\"via social communication\"等词汇和短语的含义和用法。\n\n### 6. 相似句子练习\n\n\"Recent studies suggest that both good and bad behaviors can be transmitted among groups of friends through online interactions.\"\n\n\"最新研究表明，无论是好行为还是坏行为，都可以通过在线互动在朋友群体中传播。\""},{"text":"This is a subtle form of peer pressure: we unconsciously imitate the behavior we see every day.","explainMd":"### 1. 翻译\n\n这是一种微妙的同伴压力形式：我们每天都在无意识地模仿我们所看到的行为。\n\n### 2. 词汇和短语\n\n- **subtle**: 微妙的，指的是不易察觉的，细微的情况或者影响。\n\n- **form of peer pressure**: 同伴压力的一种形式，描述了影响我们行为的一种社交动力。\n\n- **unconsciously**: 无意识地，描述的是我们并不完全意识到的行为或感觉。\n\n- **imitate**: 模仿，复制或者尝试效仿他人的行为或样式。\n\n- **behavior we see every day**: 我们每天看到的行为，描述我们日常生活中观察到的行为或行动。\n\n### 3. 句子结构\n\n这是一个简单的句子，包括主语 (This)，谓语 (is)，系词补语 (a subtle form of peer pressure) 和一个冒号后的解释性陈述 (we unconsciously imitate the behavior we see every day)。\n\n### 4. 语法\n\n这个句子使用了一个冬天来解释或阐明主句的内容。冒号后面的部分为解释性陈述，解释了\"微妙的同伴压力\"的含义。\n\n### 5. 知识点总结\n\n这个句子的关键知识点在于如何使用冒号进行解释或阐明。另外，也需要了解词汇如 \"subtle\", \"form of peer pressure\", \"unconsciously\", \"imitate\", 和 \"behavior we see every day\" 的含义和用法。\n\n### 6. 相似句子练习\n\n\"This is a type of subtle influence: we tend to adopt the attitudes and beliefs of the people we interact with daily.\"\n\n\"这是一种微妙的影响：我们倾向于采纳我们每天交往的人的态度和信念。\""}]},{"sentences":[{"text":"Far less certain, however, is how successfully experts and bureaucrats can select our peer groups and steer their activities in virtuous directions.","explainMd":"### 1. 翻译\n\n然而，专家和官僚能否成功地选择我们的同伴群体并引导他们的活动走向美好的方向，这一点还不太确定。\n\n### 2. 词汇和短语\n\n- **Far less certain**: 表示\"不太确定\"，这里指的是作者对某件事情的不确定性。\n- **experts and bureaucrats**: \"专家和官僚\"，指的是在特定领域具有专业知识的人和管理或运行公共事务的官员。\n- **select our peer groups**: \"选择我们的同伴群体\"，指的是决定我们与谁交朋友或者与谁共处的过程。\n- **steer their activities**: \"引导他们的活动\"，指的是影响和改变他们的行为和活动的过程。\n- **virtuous directions**: \"美好的方向\"，指的是正面的、有益的或者道德上正当的方向。\n\n### 3. 句子结构\n\n这是一个复合句。主句为\"Far less certain is...\"，宾语从句为\"how successfully experts and bureaucrats can select our peer groups and steer their activities in virtuous directions\"。\n\n### 4. 语法\n\n这个句子使用了一种称为\"倒装句\"的句型，即把谓语动词放在主语之前。这在英语中通常用来强调主语。另外，\"how\"在这里充当了宾语从句的引导词。\n\n### 5. 知识点总结\n\n本句的关键知识点在于理解和使用倒装句（强调主语），以及如何使用 \"how\" 引导宾语从句。此外，还需要理解词汇和短语，如 \"far less certain\", \"experts and bureaucrats\", \"select our peer groups\", \"steer their activities\", 和 \"virtuous directions\" 的含义和用法。\n\n### 6. 相似句子练习\n\n\"Much less clear, however, is how effectively teachers can influence the learning habits of their students.\"\n\n然而，老师能否有效地影响学生的学习习惯，这一点则不那么明确。"},{"text":"It’s like the teacher who breaks up the troublemakers in the back row by pairing them with better-behaved classmates.","explainMd":"### 1. 翻译\n\n这就像老师通过将后排的捣蛋鬼和表现更好的同学配对来分散他们。\n\n### 2. 词汇和短语\n\n- **It's like**: 表示 \"就像\"，用来引出一个类比或者比较。\n- **the teacher**: \"老师\"，指的是在学校或者教育机构中负责教学的人。\n- **breaks up the troublemakers**: \"分散捣蛋鬼\"，指的是把经常制造麻烦的人分开。\n- **in the back row**: \"在后排\"，指的是物理位置，通常是指在教室后面的座位。\n- **by pairing them with better-behaved classmates**: \"通过将他们与表现更好的同学配对\"，指的是将学习表现不佳的学生与学习表现好的学生配对，以便让他们相互影响。\n\n### 3. 句子结构\n\n这是一个简单句，主语是 \"It\"，谓语是 \"is like\"，宾语是 \"the teacher who breaks up the troublemakers in the back row by pairing them with better-behaved classmates\"，其中 \"who breaks up the troublemakers in the back row by pairing them with better-behaved classmates\" 是一个定语从句，修饰 \"the teacher\"。\n\n### 4. 语法\n\n这个句子使用了一个比喻（\"It's like\"）来引出一个类比。此外，它还使用了一个定语从句（\"who breaks up the troublemakers in the back row by pairing them with better-behaved classmates\"）来详细描述 \"the teacher\"。\n\n### 5. 知识点总结\n\n本句的关键知识点在于理解和使用比喻（\"It's like\"）以及定语从句。此外，还需要理解词汇和短语，如 \"breaks up the troublemakers\", \"in the back row\", 和 \"by pairing them with better-behaved classmates\" 的含义和用法。\n\n### 6. 相似句子练习\n\n\"It's like the coach who motivates the team by pairing the less experienced players with the veterans.\"\n\n这就像教练通过将经验较少的球员与老将配对来激励球队。"},{"text":"The tactic never really works.","explainMd":"### 1. 翻译\n\n这个策略从未真正奏效。\n\n### 2. 词汇和短语\n\n- **The tactic**: \"这个策略\"，指的是上文提到的用好学生影响坏学生的做法。\n- **never**: \"从未\"，用来强调某事从来没有发生过。\n- **really**: \"真正地\"，用来加强语气，强调某事确实没有发生。\n- **works**: \"奏效\"，指的是产生预期的效果或结果。\n\n### 3. 句子结构\n\n这是一个简单句，主语是 \"The tactic\"，谓语是 \"never really works\"。\n\n### 4. 语法\n\n这个句子的语法相对简单，主要使用了一般现在时，表明这个策略在任何时候都没有奏效。此外，\"never\" 和 \"really\" 被用来加强语气，强调这个策略真的没有效果。\n\n### 5. 知识点总结\n\n本句的关键知识点在于理解和使用一般现在时，以及如何使用 \"never\" 和 \"really\" 来加强语气。此外，还需要理解 \"The tactic\" 和 \"works\" 的含义和用法。\n\n### 6. 相似句子练习\n\n\"The plan never really succeeds.\"\n\n这个计划从未真正成功。"},{"text":"And that’s the problem with a social cure engineered from the outside: in the real world, as in school, we insist on choosing our own friends.","explainMd":"### 1. 翻译\n\n这就是外部制造的社会治疗的问题：在现实世界里，就像在学校一样，我们坚持选择自己的朋友。\n\n### 2. 词汇和短语\n\n- **And that's the problem with**: \"这就是...的问题\"，用来引出某事物的问题或缺点。\n- **a social cure engineered from the outside**: \"外部制造的社会治疗\"，指的是由外部力量（如政府、专家等）试图通过影响群体动态来改变个体行为的方法。\n- **in the real world**: \"在现实世界里\"，对比于理论或想象中的情况。\n- **as in school**: \"就像在学校一样\"，用来引出一个比较的例子。\n- **we insist on choosing our own friends**: \"我们坚持选择自己的朋友\"，强调个体的自主选择权。\n\n### 3. 句子结构\n\n这是一个复合句，主要由两个部分组成：\n\n1. \"And that's the problem with a social cure engineered from the outside\" 是一个宣告句，主语是 \"that\"，谓语是 \"is the problem\"。\n2. \"in the real world, as in school, we insist on choosing our own friends\" 是一个描述句，主语是 \"we\"，谓语是 \"insist on choosing our own friends\"。\n\n两个部分通过冒号连接，表示后者是对前者的解释或具体化。\n\n### 4. 语法\n\n本句主要使用了一般现在时，表示一个普遍真理或习惯。此外，句子还使用了比较结构 \"as in school\" 来比较现实世界和学校。\n\n### 5. 知识点总结\n\n本句的关键知识点在于理解和使用冒号来连接两个相关的句子部分，以及理解和使用比较结构 \"as in school\" 来进行比较。此外，还需要理解 \"insist on\" 的含义和用法。\n\n### 6. 相似句子练习\n\n\"And that's the issue with top-down management: in the workplace, as in life, people prefer to make their own decisions.\"\n\n这就是自上而下的管理方式的问题：在职场中，就像在生活中一样，人们更喜欢做出自己的决定。"}]}],"title":""}