{"translate":"","paragraphs":[{"sentences":[{"text":"Pretty in pink: adult women do not remember being so obsessed with the colour, yet it is pervasive in our young girls’ lives.","explainMd":"1. **翻译**：\n\n   \"深陷粉色中：成年女性并不记得自己曾对这种颜色如此痴迷，然而在我们的小女孩生活中，这种颜色无处不在。\"\n\n1. **词汇和短语**：\n\n   - Pretty in pink: 深陷粉色中\n   - Adult women: 成年女性\n   - Do not remember: 并不记得\n   - Being so obsessed with: 如此痴迷\n   - The colour: 这种颜色\n   - Yet: 然而\n   - Pervasive: 无处不在\n   - Our young girls’ lives: 我们的小女孩的生活\n\n1. **句子结构**：\n\n   这是一个复杂句，其结构为：主句 + 并列句。具体分析如下：\n\n   - 主句：Adult women do not remember being so obsessed with the colour，这是句子的主要部分，表达的是成年女性并不记得自己曾对这种颜色如此痴迷这一观点。\n   - 并列句：Yet it is pervasive in our young girls’ lives，这部分并列于主句，进一步提出了然而在我们的小女孩生活中，这种颜色无处不在这一观点。\n\n   如果是简单句，主谓宾形式，主语是 \"Adult women\"，谓语是 \"do not remember\"，宾语是 \"being so obsessed with the colour\"。\n\n1. **语法分析**：\n\n   这句话的主语是 \"Adult women\"，谓语是 \"do not remember\"，宾语是 \"being so obsessed with the colour\"。主谓宾结构清晰，语法正确。另一部分的主语是 \"it\"，谓语是 \"is pervasive\"，宾语是 \"in our young girls’ lives\"。这是一个标准的主谓宾结构，语法也是正确的。\n\n1. **知识点总结**：\n\n   1. **\"Do not remember\" 的使用**：这是一个表示忘记或者不记得某事的短语。例如：\"I do not remember where I put my keys.\"（我不记得我把钥匙放在哪了。）\n\n   1. **\"Being so obsessed with\" 的使用**：这是一个表示对某事物或者某一行为过于痴迷的短语。例如：\"He is so obsessed with gaming that he neglects his studies.\"（他对游戏如此痴迷以至于他忽视了他的学业。）\n\n   1. **\"Pervasive\" 的使用**：这是一个表示某事物无处不在或者广泛存在的词汇。例如：\"Technology is pervasive in our lives.\"（科技在我们生活中无处不在。）\n\n1. **练习相似句子**：\n\n   \"Lost in music: many adults do not remember being so fascinated by it, yet it is omnipresent in our teenagers' lives.\"\n\n   \"沉浸在音乐中：许多成年人并不记得自己曾对音乐如此着迷，然而在我们的青少年生活中，音乐无处不在。\""},{"text":"It is not that pink is intrinsically bad, but it is such a tiny slice of the rainbow and, though it may celebrate girlhood in one way, it also repeatedly and firmly fuses girls’ identity to appearance.","explainMd":"1. **翻译**：\n\n   \"并不是说粉色本质上有什么不好，只是它在彩虹中只是一小片，虽然它可能以一种方式庆祝女孩子的成长，但它也反复而坚定地将女孩的身份与外貌联系在一起。\"\n\n1. **词汇和短语**：\n\n   - It is not that: 并不是说\n   - Pink: 粉色\n   - Intrinsically bad: 本质上有什么不好\n   - A tiny slice of: 只是一小片\n   - The rainbow: 彩虹\n   - Celebrate: 庆祝\n   - Girlhood: 女孩子的成长\n   - Repeatedly and firmly: 反复而坚定地\n   - Fuses: 将…连接\n   - Girls’ identity: 女孩的身份\n   - To appearance: 与外貌\n\n1. **句子结构**：\n\n   这是一个复杂句，其结构为：主句 + 并列句。具体分析如下：\n\n   - 主句：It is not that pink is intrinsically bad，这是句子的主要部分，表达的是并不是说粉色本质上有什么不好这一观点。\n   - 并列句：but it is such a tiny slice of the rainbow and, though it may celebrate girlhood in one way, it also repeatedly and firmly fuses girls’ identity to appearance，这部分并列于主句，进一步提出了只是它在彩虹中只是一小片，虽然它可能以一种方式庆祝女孩子的成长，但它也反复而坚定地将女孩的身份与外貌联系在一起这一观点。\n\n   如果是简单句，主谓宾形式，主语是 \"it\"，谓语是 \"is\"，宾语是 \"such a tiny slice of the rainbow\"。\n\n1. **语法分析**：\n\n   这句话的主语是 \"it\"（指粉色），谓语是 \"is\"，宾语是 \"a tiny slice of the rainbow\"。主谓宾结构清晰，语法正确。另一部分的主语是 \"it\"，谓语是 \"fuses\"，宾语是 \"girls’ identity to appearance\"。这是一个标准的主谓宾结构，语法也是正确的。\n\n1. **知识点总结**：\n\n   1. **\"It is not that\" 的使用**：这是一个表示否定一个观点的短语，强调并非是某事，而是另一事。例如：\"It is not that I don't like you, I just need some space.\"（并不是我不喜欢你，只是我需要一些空间。）\n\n   1. **\"Fuses\" 的使用**：这是一个表示将两个或更多的事物连接或融合在一起的词。例如：\"The chef fuses ingredients from different cuisines to create a unique dish.\"（厨师将来自不同菜系的食材融合在一起，创造出独特的菜肴。）\n\n   1. **\"Intrinsically\" 的使用**：这是一个表示事物的本质或者内在的词。例如：\"All human beings are intrinsically equal.\"（所有人本质上都是平等的。）\n\n1. **练习相似句子**：\n\n   \"It is not that blue is intrinsically sad, but it is just a small part of the emotional spectrum and, though it may symbolize tranquility in one way, it also consistently links boys' identity to stoicism.\"\n\n   \"并不是说蓝色本质上就是悲伤，只是它在情感谱系中只占一小部分，虽然它可能以一种方式象征着宁静，但它也始终将男孩的身份与坚忍不拔联系在一起。\""},{"text":"Then it presents that connection, even among two-year-olds, between girls as not only innocent but as evidence of innocence.","explainMd":"1. **翻译**：\n\n   \"然后，它呈现出这样一种联系，即即使在两岁的女孩中，她们不仅显得天真，而且她们的天真被视为天真的证据。\"\n\n1. **词汇和短语**：\n\n   - Presents: 呈现\n   - That connection: 那种联系\n   - Even among: 即使在…中\n   - Two-year-olds: 两岁的孩子们\n   - Girls: 女孩\n   - Not only: 不仅\n   - Innocent: 天真\n   - But as: 而且作为\n   - Evidence of innocence: 天真的证据\n\n1. **句子结构**：\n\n   这是一个复杂句，其结构为：主句 + 定语从句。具体分析如下：\n\n   - 主句：Then it presents that connection，这是句子的主要部分，表达的是\"然后它呈现出这样一种联系\"这一观点。\n   - 定语从句：even among two-year-olds, between girls as not only innocent but as evidence of innocence，这部分是对\"that connection\"的修饰，进一步解释了这种联系是\"即使在两岁的女孩中，她们不仅显得天真，而且她们的天真被视为天真的证据\"。\n\n   如果简化为简单句，主谓宾形式，主语是 \"it\"，谓语是 \"presents\"，宾语是 \"that connection\"。\n\n1. **语法分析**：\n\n   这句话的主语是\"it\"（指上文的粉色或者说社会对女孩的预设观念），谓语动词是\"presents\"，直接宾语是\"that connection\"。定语从句\"even among two-year-olds, between girls as not only innocent but as evidence of innocence\"修饰了\"that connection\"。整个句子的语法结构完整，符合英语语法规则。\n\n1. **知识点总结**：\n\n   1. **\"Presents\" 的使用**：这是一个表示展现或呈现某种状态、情况或结果的词。例如：\"The report presents a detailed analysis of the current situation.\"（报告展示了当前情况的详细分析。）\n\n   1. **\"Not only... but as\" 的使用**：这是一个表示\"不仅...而且...\"的结构，用于强调两个或更多的属性或特征。例如：\"He is not only intelligent, but also hard-working.\"（他不仅聪明，而且勤奋。）\n\n   1. **定语从句的使用**：定语从句是用来修饰某个名词或代词的从句。在这个句子中，\"even among two-year-olds, between girls as not only innocent but as evidence of innocence\"是一个定语从句，用来修饰\"that connection\"。\n\n1. **练习相似句子**：\n\n   \"Then it illustrates the link, even among preschoolers, between boys as not only brave but as evidence of bravery.\"\n\n   \"然后，它展示了这样一种联系，即即使在学龄前的男孩中，他们不仅显得勇敢，而且他们的勇敢被视为勇敢的证据。\""},{"text":"Looking around, I despaired at the singular lack of imagination about girls’ lives and interests.","explainMd":"1. **翻译**：\n\n   \"环顾四周，我对于人们对女孩的生活和兴趣的想象力的独特缺乏感到绝望。\"\n\n1. **词汇和短语**：\n\n   - Looking around: 环顾四周\n   - Despaired: 感到绝望\n   - Singular lack: 独特的缺乏\n   - Imagination: 想象力\n   - Girls' lives: 女孩的生活\n   - Interests: 兴趣\n\n1. **句子结构**：\n\n   这是一个简单句，其结构为：主语 + 谓语 + 宾语。具体分析如下：\n\n   - 主语：I，句子的主语是\"我\"。\n   - 谓语：despaired at，谓语是\"对...感到绝望\"。\n   - 宾语：the singular lack of imagination about girls’ lives and interests，宾语是\"对女孩的生活和兴趣的想象力的独特缺乏\"。\n\n1. **语法分析**：\n\n   这句话的主语是\"I\"，谓语是\"despaired at\"，宾语是\"the singular lack of imagination about girls’ lives and interests\"。整个句子的语法结构完整，符合英语语法规则。\n\n1. **知识点总结**：\n\n   1. **\"Despair at\"的使用**：这是一个表示对某种情况感到绝望的短语。例如：\"He despaired at the state of his business.\"（他对他的业务状况感到绝望。）\n\n   1. **\"Singular lack\"的使用**：这是一个表示某种事物特别缺乏的表达方式。例如：\"There is a singular lack of evidence supporting his claim.\"（他的主张缺乏有力的证据。）\n\n   1. **\"Imagination about\"的使用**：这种表达方式用来描述对某种事物的想象或理解。例如：\"She has a vivid imagination about the future.\"（她对未来有生动的想象。）\n\n1. **练习相似句子**：\n\n   \"Looking ahead, I am disappointed at the singular lack of vision for the company's future.\"\n\n   \"展望未来，我对于对公司未来的想象力的特别缺乏感到失望。\""}]},{"sentences":[{"text":"Girls’ attraction to pink may seem unavoidable, somehow encoded in their DNA, but according to Jo Paoletti, an associate professor of American Studies, it is not.","explainMd":"1. **翻译**：\n\n   \"女孩对粉色的喜爱似乎是无法避免的，就像是在她们的DNA中编码一样，但根据美国研究副教授乔·帕奥莱蒂的说法，事实并非如此。\"\n\n1. **词汇和短语**：\n\n   - Girls' attraction to pink: 女孩对粉色的喜爱\n   - Seem unavoidable: 似乎是无法避免的\n   - Encoded: 编码\n   - DNA: 脱氧核糖核酸，DNA\n   - According to: 根据\n   - Associate professor: 副教授\n   - American Studies: 美国研究\n\n1. **句子结构**：\n\n   这是一个复合句，其结构为：主句 + 从句。具体分析如下：\n\n   - 主句：Girls' attraction to pink may seem unavoidable, somehow encoded in their DNA，这部分是句子的主要部分，表达的是\"女孩对粉色的喜爱似乎是无法避免的，就像是在她们的DNA中编码一样\"的观点。\n   - 从句：but according to Jo Paoletti, an associate professor of American Studies, it is not，这部分是从句，进一步提出了\"但根据美国研究副教授乔·帕奥莱蒂的说法，事实并非如此\"的观点。\n\n1. **语法分析**：\n\n   这句话是一个复合句，由一个主句和一个并列的从句构成。主句中，\"Girls' attraction to pink\"是主语，\"may seem\"是谓语，\"unavoidable, somehow encoded in their DNA\"是宾语。从句中，\"it\"是主语，\"is\"是谓语，\"not\"是宾语。\"According to Jo Paoletti, an associate professor of American Studies\"是一个短语，用于引述乔·帕奥莱蒂的观点。\n\n1. **知识点总结**：\n\n   1. **\"Seem\"的使用**：这是一个表示某事物看起来如何的词汇。例如：\"He seems happy.\"（他看起来很开心。）\n\n   1. **引述语句的使用方法**：这句话中的\"according to Jo Paoletti, an associate professor of American Studies\"就是一种引述语句的使用方式。它直接引用了别人的观点或说法，而不是作者自己的观点。另一个例子可以是：\"According to the weather report, it will rain tomorrow.\"（根据天气预报，明天会下雨。）\n\n   1. **\"Encoded in DNA\"的理解**：这是一种比喻的表达方式，将DNA的编码比喻为某种行为或习性的固有属性。例如：\"His love for music seems to be encoded in his DNA.\"（他对音乐的热爱似乎是他DNA中的编码。）\n\n1. **练习相似句子**：\n\n   \"Boys' interest in cars may seem natural, as if it's in their DNA, but according to Jane Smith, a child psychologist, it's not.\"\n\n   \"男孩对汽车的兴趣可能看起来是自然的，就像是在他们的DNA中一样，但根据儿童心理学家简·史密斯的说法，事实并非如此。\""},{"text":"Children were not colour-coded at all until the early 20th century: in the era before domestic washing machines all babies wore white as a practical matter, since the only way of getting clothes clean was to boil them.","explainMd":"1. **翻译**：\n\n   \"在20世纪初之前，儿童并未被赋予特定的颜色：在家庭洗衣机出现之前的时代，所有的婴儿都会穿白色衣服，因为唯一能将衣服洗干净的方式就是煮它们。\"\n\n1. **词汇和短语**：\n\n   - Children: 儿童\n   - Colour-coded: 赋予特定的颜色\n   - Until the early 20th century: 在20世纪初之前\n   - In the era: 在...时代\n   - Before domestic washing machines: 在家庭洗衣机出现之前\n   - All babies: 所有的婴儿\n   - Wore white: 穿白色衣服\n   - As a practical matter: 出于实际考虑\n   - The only way: 唯一的方式\n   - Getting clothes clean: 将衣服洗干净\n   - To boil them: 煮它们\n\n1. **句子结构**：\n\n   这是一个复杂句，其结构为：主句 + 从句。具体分析如下：\n\n   - 主句：Children were not colour-coded at all until the early 20th century，这是句子的主要部分，表达的是\"在20世纪初之前，儿童并未被赋予特定的颜色\"这一观点。\n   - 从句：in the era before domestic washing machines all babies wore white as a practical matter, since the only way of getting clothes clean was to boil them，这部分是从句，进一步提出了\"在家庭洗衣机出现之前的时代，所有的婴儿都会穿白色衣服，因为唯一能将衣服洗干净的方式就是煮它们\"这一观点。\n\n1. **语法分析**：\n\n   这句话是一个复杂句，由一个主句和一个并列的从句构成。主句中，\"Children\"是主语，\"were not colour-coded\"是谓语，\"at all until the early 20th century\"是宾语。从句中，\"all babies\"是主语，\"wore\"是谓语，\"white as a practical matter\"是宾语。\"in the era before domestic washing machines\"和\"since the only way of getting clothes clean was to boil them\"是两个状语从句，分别描述了这一行为发生的时间和原因。\n\n1. **知识点总结**：\n\n   1. **\"Colour-coded\"的使用**：这是一个表示将特定的颜色赋予某个对象的词汇。例如：\"The files are colour-coded according to their importance.\"（文件按照其重要性用色彩编码。）\n\n   1. **时间状语从句的使用方法**：这句话中的\"in the era before domestic washing machines\"就是一种时间状语从句的使用方式。它描述了主句中行为发生的时间。另一个例子可以是：\"In the years before the Internet, people used to write letters to communicate.\"（在互联网出现之前的年代，人们习惯于通过写信进行交流。）\n\n   1. **\"As a practical matter\"的理解**：这是一种表示出于实际考虑的表达方式。例如：\"As a practical matter, we decided to drive rather than fly.\"（出于实际考虑，我们决定开车而不是坐飞机。）\n\n1. **练习相似句子**：\n\n   \"Before the invention of electric lights, all homes used candles for illumination at night, because the only source of light was fire.\"\n\n   \"在电灯发明之前，所有的家庭在夜晚都会用蜡烛来照明，因为唯一的光源就是火。\""},{"text":"What’s more, both boys and girls wore what were thought of as gender-neutral dresses.","explainMd":"1. **翻译**：\n\n   \"更重要的是，男孩和女孩都穿着被认为是中性的裙子。\"\n\n1. **词汇和短语**：\n\n   - What's more: 更重要的是\n   - Both: 两者都\n   - Boys and girls: 男孩和女孩\n   - Wore: 穿着\n   - What were thought of as: 被认为是\n   - Gender-neutral: 中性的\n   - Dresses: 裙子\n\n1. **句子结构**：\n\n   这是一种简单句，其结构为：主语 + 谓语 + 宾语。具体分析如下：\n\n   - 主语：Both boys and girls，这部分是句子的主体，表达的是\"男孩和女孩都\"这一观点。\n   - 谓语：wore，这部分是动词，表达的是\"穿着\"这一动作。\n   - 宾语：what were thought of as gender-neutral dresses，这部分是宾语，进一步提出了\"被认为是中性的裙子\"这一观点。\n\n1. **语法分析**：\n\n   这是一个简单句，结构清晰，没有复杂的从句。主语是\"Both boys and girls\"，谓语是\"wore\"，宾语是\"what were thought of as gender-neutral dresses\"。这个句子的特点是，宾语部分采用了\"what were thought of as\"的结构，形成了一个名词性从句作为宾语，对\"gender-neutral dresses\"进行了补充和说明。\n\n1. **知识点总结**：\n\n   1. **使用\"What's more\"导入新的信息**：这是一种常用的表达方式，用于在讨论的过程中引入更重要或者更深入的信息。例如：\"I'm not only good at math, what's more, I'm excellent at physics too.\"（我不仅擅长数学，更重要的是，我在物理上也非常出色。）\n\n   1. **\"both...and...\"的用法**：这是一种用于表达两个事物都具备某种属性或者做某种动作的表达方式。例如：\"Both my brother and I like playing football.\"（我和我哥哥都喜欢踢足球。）\n\n   1. **\"what were thought of as\"的理解**：这是一种表示\"被认为是\"的表达方式。例如：\"He was doing what was thought of as a man's job.\"（他在做被认为是男人的工作。）\n\n1. **练习相似句子**：\n\n   \"Interestingly, both men and women wore what were considered as unisex hats in the 19th century.\"\n\n   \"有趣的是，19世纪时，男性和女性都戴着被认为是中性的帽子。\""},{"text":"When nursery colours were introduced, pink was actually considered the more masculine colour, a pastel version of red, which was associated with strength.","explainMd":"1. **翻译**：\n\n   \"当儿童房间的颜色引入时，粉色实际上被认为是更男性化的颜色，它是红色的淡色版本，红色与力量有关。\"\n\n1. **词汇和短语**：\n\n   - Nursery colours: 儿童房间的颜色\n   - Were introduced: 被引入\n   - Pink: 粉色\n   - Was actually considered: 实际上被认为是\n   - The more masculine colour: 更男性化的颜色\n   - A pastel version of: 的淡色版本\n   - Red: 红色\n   - Was associated with: 与...有关\n   - Strength: 力量\n\n1. **句子结构**：\n\n   这是一个复杂句，其结构为：主句 + 定语从句。具体分析如下：\n\n   - 主句：\"Pink was actually considered the more masculine colour\"，这是句子的主要部分，表达的是粉色实际上被认为是更男性化的颜色这一观点。\n   - 定语从句：\"a pastel version of red, which was associated with strength\"，这部分是定语从句，修饰前面的\"a pastel version of red\"，进一步提出了红色与力量有关这一观点。\n\n1. **语法分析**：\n\n   这是一个复杂句，主句和定语从句的结构清晰。主句是\"Pink was actually considered the more masculine colour\"，定语从句是\"a pastel version of red, which was associated with strength\"。这个句子的特点是，定语从句中采用了\"which was associated with\"的结构，形成了一个关系从句，对\"a pastel version of red\"进行了修饰和说明。\n\n1. **知识点总结**：\n\n   1. **\"was considered\"的用法**：这是一种被动语态的使用方式，用于表达某个事物或行为被他人以某种方式看待或认为。例如：\"He was considered the best player in the team.\"（他被认为是队里最好的球员。）\n\n   1. **定语从句的使用**：定语从句是一个从句，用于修饰主句中的某个词语。在这个句子中，\"which was associated with strength\"就是一个定语从句，修饰\"a pastel version of red\"。例如：\"The man who lives next door is a doctor.\"（住在隔壁的那个人是医生。）\n\n1. **练习相似句子**：\n\n   \"When bicycles were introduced, they were actually considered a more masculine mode of transport, a faster version of walking, which was associated with freedom.\"\n\n   \"当自行车被引入时，它们实际上被认为是更男性化的交通工具，是行走的更快版本，与自由有关。\""},{"text":"Blue, with its intimations of the Virgin Mary, constancy and faithfulness, symbolised femininity.","explainMd":"1. **翻译**：\n\n   \"蓝色，因其暗示着圣母玛利亚、恒定和忠诚，象征着女性气质。\"\n\n1. **词汇和短语**：\n\n   - Blue: 蓝色\n   - Intimations: 暗示，预示\n   - Virgin Mary: 圣母玛利亚\n   - Constancy: 恒定，不变\n   - Faithfulness: 忠诚\n   - Symbolised: 象征\n   - Femininity: 女性气质\n\n1. **句子结构**：\n\n   这是一个简单句，其结构为：主语 + 谓语 + 宾语。具体分析如下：\n\n   - 主语：Blue，这是句子的主要部分，表达的是主题\"蓝色\"。\n   - 谓语：with its intimations of the Virgin Mary, constancy and faithfulness, symbolised，这部分是谓语，说明了蓝色的象征意义。\n   - 宾语：femininity，这部分是宾语，是蓝色所象征的具体内容，即女性气质。\n\n1. **语法分析**：\n\n   这是一个简单句，主语、谓语和宾语的结构清晰。\"Blue\"是主语，\"symbolised\"是谓语，\"femininity\"是宾语。\"with its intimations of the Virgin Mary, constancy and faithfulness\"是介词短语，作为状语，修饰谓语\"symbolised\"，详细说明了蓝色的象征意义。\n\n1. **知识点总结**：\n\n   1. **象征的用法**：在这个句子中，\"symbolised\"用作谓语，表示一种符号或象征的意义。例如：\"The dove is a bird that symbolises peace.\"（鸽子是象征和平的鸟。）\n\n   1. **介词短语作状语的用法**：在这个句子中，\"with its intimations of the Virgin Mary, constancy and faithfulness\"是介词短语，用作状语，修饰谓语\"symbolised\"，详细说明了蓝色的象征意义。例如：\"With his eyes closed, he listened to the music.\"（他闭着眼睛听音乐。）\n\n1. **练习相似句子**：\n\n   \"Green, with its associations of nature, renewal and life, symbolised vitality.\"\n\n   \"绿色，因其与自然、更新和生命的关联，象征着生命力。\""},{"text":"It was not until the mid-1980s, when amplifying age and sex differences became a dominant children’s marketing strategy, that pink fully came into its own, when it began to seem inherently attractive to girls, part of what defined them as female, at least for the first few critical years.","explainMd":"1. **翻译**：\n\n   \"直到20世纪80年代中期，当放大年龄和性别差异成为主导儿童市场的策略时，粉色才真正展现出其特性，开始对女孩具有内在的吸引力，这成为了定义她们作为女性的一部分，至少在最初的几个关键年份里是这样的。\"\n\n1. **词汇和短语**：\n\n   - It was not until: 直到...才\n   - The mid-1980s: 20世纪80年代中期\n   - Amplifying: 放大\n   - Age and sex differences: 年龄和性别差异\n   - Dominant: 主导的\n   - Children’s marketing strategy: 儿童市场策略\n   - Came into its own: 展现出其特性\n   - Inherently attractive: 内在的吸引力\n   - Defined: 定义\n   - Female: 女性\n   - The first few critical years: 最初的几个关键年份\n\n1. **句子结构**：\n\n   这是一个复合句，其结构为：主句 + 定语从句。具体分析如下：\n\n   - 主句：\"It was not until the mid-1980s, when amplifying age and sex differences became a dominant children’s marketing strategy, that pink fully came into its own,\" 这是句子的主要部分，表达的是直到20世纪80年代中期，粉色才开始展现出其特性。\n   - 定语从句：\"when it began to seem inherently attractive to girls, part of what defined them as female, at least for the first few critical years.\" 这部分是定语从句，修饰粉色开始展现出其特性的时间，即它开始对女孩具有内在的吸引力，这成为了定义她们作为女性的一部分，至少在最初的几个关键年份里是这样的。\n\n1. **语法分析**：\n\n   该句使用了\"It was not until...that...\"结构，用于强调某事直到某一时间点才发生。其中的\"when amplifying age and sex differences became a dominant children’s marketing strategy\"是时间状语从句，修饰主句中的时间点\"the mid-1980s\"。同时，\"when it began to seem inherently attractive to girls, part of what defined them as female, at least for the first few critical years.\"是定语从句，修饰\"pink fully came into its own\"这一主句部分。\n\n1. **知识点总结**：\n\n   1. **\"It was not until...that...\"结构的使用**：这是一种强调结构，用于强调某事直到某一时间点才发生。例如：\"It was not until she left home that she realized how much she missed her family.\"（直到她离家后，她才意识到自己多么想念家人。）\n\n   1. **从句的应用**：在这个句子中，时间状语从句和定语从句都被用来修饰主句中的部分。状语从句用于修饰主句中的动作或状态，而定语从句则用于修饰主句中的名词或代词。例如：\"The man who lives next door is a doctor.\"（住在隔壁的那个人是医生。）\n\n1. **练习相似句子**：\n\n   \"It was not until the emergence of digital technology, when traditional media started to decline, that social media truly took off, becoming an integral part of our daily lives.\"\n\n   \"直到数字技术的出现，当传统媒体开始衰退时，社交媒体才真正起飞，成为我们日常生活的重要部分。\""}]},{"sentences":[{"text":"I had not realised how profoundly marketing trends dictated our perception of what is natural to kids, including our core beliefs about their psychological development.","explainMd":"**1. 翻译**\n\n\"我并未意识到市场营销趋势如何深深地影响了我们对孩子们自然属性的认知，包括我们对他们心理发展的核心信念。\"\n\n**2. 词汇和短语**\n\n- Realised: 意识到\n- Profoundly: 深深地\n- Marketing trends: 市场营销趋势\n- Dictated: 影响，决定（在这个语境下）\n- Perception: 认知，看法\n- Natural: 自然的，天生的\n- Core beliefs: 核心信念\n- Psychological development: 心理发展\n\n**3. 句子结构**\n\n这是一个复杂句，其结构为：主句 + 宾语从句。具体分析如下：\n\n- 主句：\"I had not realised...\"，这是句子的主要部分，表达的是\"我并没有意识到...\"这个概念。\n- 宾语从句：\"how profoundly marketing trends dictated our perception of what is natural to kids, including our core beliefs about their psychological development.\"，这部分是主句的宾语，解释了作者没有意识到的具体内容，即市场营销趋势如何深深地影响了我们对孩子们自然属性的认知，包括我们对他们心理发展的核心信念。\n\n在宾语从句中，\"how profoundly marketing trends dictated our perception of what is natural to kids\"是主句，\"including our core beliefs about their psychological development\" 是这个主句的插入语，用来进一步解释和阐述前面的内容。\n\n**4. 语法分析**\n\n该句子的主体是\"I\"，谓语是\"had not realised\"，宾语是整个由\"how\"引导的宾语从句。这个宾语从句是一个复杂句，\"how profoundly marketing trends dictated our perception of what is natural to kids\" 是主要的句子，\"including our core beliefs about their psychological development\" 是这个主句的插入语，用来进一步解释和阐述前面的内容。\n\n**5. 知识点总结**\n\n1. **\"Had not realised\" 的使用**: 这是一个过去完成时的否定形式，用来表示过去某个时间点之前的事情。例如：\"I had not realised the importance of exercise until I got sick.\"\n1. **插入语的使用**: \"including our core beliefs about their psychological development\" 是一个插入语，用来补充前面句子的信息。例如：\"I bought a lot of fruits, including apples, bananas and oranges.\"\n1. **\"How\" 引导宾语从句**: 在这个句子中，\"how\" 引导了一个宾语从句，\"how\" 在这里相当于\"the way that\"。例如：\"I don't know how he solved the problem.\"\n\n**6. 练习相似句子**\n\n\"I had not realised how significantly social media influenced our daily life, including our communication and relationships.\"\n（\"我并未意识到社交媒体如何深刻地影响了我们的日常生活，包括我们的交流和人际关系。\"）"},{"text":"Take the toddler.","explainMd":"**1. 翻译**\n\n\"Take the toddler.\"\\\n\"以幼儿为例。\"\n\n**2. 词汇和短语**\n\n- Take: 在此语境下翻译为“以……为例”\n- The toddler: 幼儿\n\n**3. 句子结构**\n\n这是一个简单句，其结构为：主句。具体分析如下：\n\n主句：\"Take the toddler.\"，这是句子的主要部分，表达的是以幼儿为例这一命令或建议。\n\n主语：\"You\"（省略）\n谓语：\"Take\"\n宾语：\"the toddler\"\n\n**4. 语法分析**\n\n这个句子是一个祈使句，主语通常被省略（通常是指\"you\"），只含有谓语动词和其他必需的句子成分。在这种情况下，\"take\" 是谓语动词，表示命令或建议的动作，\"the toddler\" 是宾语，是被动作所作用的对象。\n\n**5. 知识点总结**\n\n1. **祈使句的使用**: 这是一个祈使句的例子，祈使句通常用来给出命令、建议、请求或指示。例如：\"Take a seat.\"（请坐）或\"Be quiet.\"（安静）。\n\n1. **\"Take\"的多重含义**: 在这个语境中，\"take\"的意思是“以……为例”，这是\"take\"的一个常见的搭配用法，其它常见用法还包括\"接受\"（例如：\"take a gift\"），\"采取\"（例如：\"take action\"）等。\n\n**6. 练习相似句子**\n\n\"Take the sunset, for example. It's a daily phenomenon, yet it never fails to amaze us with its beauty.\"\\\n\"以日落为例。这是日常现象，然而它的美丽总是让我们惊叹不已。\""},{"text":"I assumed that phase was something experts developed after years of research into children’s behaviour: wrong.","explainMd":"**1. 翻译**\n\n\"我原以为这个阶段是专家们在多年研究儿童行为后发展出来的：错了。\"\n\n**2. 词汇和短语**\n\n- Assume: 假设，以为\n- Phase: 阶段\n- Experts: 专家\n- Develop: 发展，演化\n- Years of research: 多年研究\n- Children's behaviour: 儿童行为\n- Wrong: 错误\n\n**3. 句子结构**\n\n这是一个复合句，其结构为：主句 + 并列句。具体分析如下：\n\n主句：\"I assumed that phase was something experts developed\"，这是句子的主要部分，表达的是作者原以为该阶段是专家们研究发展出来的这一假设。\n\n并列句：\"wrong\"，这部分并列于主句，进一步提出了作者的假设是错误的这一观点。\n\n主语：\"I\"\n谓语：\"assumed\"\n宾语：\"that phase was something experts developed\"\n\n**4. 语法分析**\n\n这个句子是一个复合句，其中，\"I assumed\"是主句，\"that phase was something experts developed\"是一个宾语从句，用来详细说明作者的假设。\"Wrong\"是一个并列句，用来对前面的主句提出对比或批评。\n\n**5. 知识点总结**\n\n1. **宾语从句的使用**: 这句话中的\"that phase was something experts developed\"是一个宾语从句，用来解释或详细说明主句中的某一部分。在这种情况下，宾语从句是解释“我假设”的具体内容。\n\n1. **\"assume\"的用法**: \"assume\"在这里用来表达作者的猜测或假设，其后常接宾语从句。例如：\"I assume that you are coming to the party.\"（我猜你会来参加聚会。）\n\n1. **并列句的使用**: \"wrong\"作为一个并列句，用来提出对前面主句的批评或对比，常用来表达与前句相反的观点或情况。\n\n**6. 练习相似句子**\n\n\"I believed that the project was well managed by the experienced team: incorrect.\"\\\n\"我以为这个项目被经验丰富的团队管理得很好：错了。\""},{"text":"Turns out, according to Daniel Cook, a historian of childhood consumerism, it was popularised as a marketing trick by clothing manufacturers in the 1930s.","explainMd":"**1. 翻译**\n\n\"事实证明，根据儿童消费主义历史学家丹尼尔·库克的说法，它是在1930年代被服装制造商作为一种营销技巧而流行起来的。\"\n\n**2. 词汇和短语**\n\n- Turns out: 事实证明\n- According to: 根据\n- Daniel Cook: 丹尼尔·库克（人名）\n- Historian: 历史学家\n- Childhood consumerism: 儿童消费主义\n- Popularised: 流行起来\n- Marketing trick: 营销技巧\n- Clothing manufacturers: 服装制造商\n- 1930s: 1930年代\n\n**3. 句子结构**\n\n这是一个简单句，其结构为：主句。具体分析如下：\n\n主句：\"Turns out, according to Daniel Cook, a historian of childhood consumerism, it was popularised as a marketing trick by clothing manufacturers in the 1930s.\"，这是句子的主要部分，表达的是作者在引述他人的观点来说明一件事实。\n\n主语：\"it\"\n谓语：\"was popularised\"\n宾语：\"as a marketing trick by clothing manufacturers in the 1930s\"\n\n**4. 语法分析**\n\n这个句子是一个简单句，其中，\"Turns out\"是一个插入语，用来引出一个事实或结果。\"According to Daniel Cook, a historian of childhood consumerism,\"则是一个状语从句，用来说明引述的来源。\"it was popularised as a marketing trick by clothing manufacturers in the 1930s\"则是主句，其中，\"by clothing manufacturers in the 1930s\"是一个状语，用来说明由谁在何时流行起来。\n\n**5. 知识点总结**\n\n1. **插入语的使用**: \"Turns out\" 在这里作为一个插入语，用于引出事实或结果。其常见的用法是在句首，后接逗号。例如：\"Turns out, he was right all along.\"（事实证明，他一直都是对的。）\n\n1. **\"According to\"的用法**: \"According to\"在这里是一个引述短语，用于引述他人的观点或研究结果。例如：\"According to the latest research, coffee can be beneficial to our health.\"（根据最新研究，咖啡对我们的健康有益。）\n\n1. **被动语态的使用**: 这个句子中的\"it was popularised as a marketing trick by clothing manufacturers in the 1930s\"使用了被动语态，表示某事被某人做了。例如：\"The book was written by a famous author.\"（这本书是由一位著名的作者写的。）\n\n**6. 练习相似句子**\n\n\"Surprisingly, according to Dr. Smith, a renowned psychologist, the theory was first introduced as a way to motivate employees in the 1980s.\"\\\n\"令人惊讶的是，根据著名心理学家史密斯博士的说法，该理论是在1980年代首次作为激励员工的方式被引入的。\""}]},{"sentences":[{"text":"Trade publications counselled department stores that, in order to increase sales, they should create a “third stepping stone” between infant wear and older kids’ clothes.","explainMd":"**1. 翻译**\n\n\"行业出版物建议百货店，为了增加销售，他们应在婴儿服装和older kids' clothes之间创建一个“第三个垫脚石”。\n\n**2. 词汇和短语**\n\n- Trade publications: 行业出版物\n- Counselled: 建议\n- Department stores: 百货店\n- In order to: 为了\n- Increase sales: 增加销售\n- Create: 创建\n- Third stepping stone: 第三个垫脚石\n- Between: 在...之间\n- Infant wear: 婴儿服装\n- Older kids' clothes: 更大孩子的衣服\n\n**3. 句子结构**\n\n这是一个复合句，其结构为：主句 + 状语从句。具体分析如下：\n\n主句：\"Trade publications counselled department stores\", 这是句子的主要部分，表达的是行业出版物给百货店的建议。\n状语从句：\"that, in order to increase sales, they should create a “third stepping stone” between infant wear and older kids’ clothes\", 这部分是状语从句，进一步描述了这个建议的具体内容。\n\n**4. 语法分析**\n\n这个句子使用了宾语从句，\"that, in order to increase sales, they should create a “third stepping stone” between infant wear and older kids’ clothes\" 是主句 \"Trade publications counselled department stores\" 的宾语。在这个从句中，\"in order to increase sales\" 是目的状语，说明创建“第三个垫脚石”的目的，\"between infant wear and older kids’ clothes\" 是地点状语，指明“第三个垫脚石”应在哪两个点之间。\n\n**5. 知识点总结**\n\n1. **宾语从句的使用**: 宾语从句在句子中作为动词或介词的宾语。在这个句子中，\"that, in order to increase sales, they should create a “third stepping stone” between infant wear and older kids’ clothes\" 是 \"Trade publications counselled department stores\" 的宾语从句。\n1. **目的状语的使用**: \"in order to\" 可以引导目的状语，说明动作的目的。例如：\"I study hard in order to pass the exam.\"（我努力学习以便通过考试。）\n1. **\"between...and...\"的使用**: \"between...and...\"用来表示两者之间。例如：\"The distance between New York and London is about 3,500 miles.\"（纽约和伦敦之间的距离大约是3500英里。）\n\n**6. 练习相似句子**\n\n\"Health experts advised schools that, in order to improve students' health, they should introduce a daily physical education class between academic subjects.\"\n\n\"健康专家建议学校，为了提高学生的健康，他们应在学术科目之间引入每日体育课。\""},{"text":"It was only after “toddler” became a common shoppers’ term that it evolved into a broadly accepted developmental stage.","explainMd":"**1. 翻译**\n\n\"只有当“toddler”（学步期儿童）成为常见的购物者术语后，它才演变成一个被广泛接受的发展阶段。\"\n\n**2. 词汇和短语**\n\n- Only after: 只有在...之后\n- Toddler: 学步期儿童\n- Became: 成为\n- Common shoppers’ term: 常见的购物者术语\n- Evolved into: 演变成\n- Broadly accepted: 广泛接受\n- Developmental stage: 发展阶段\n\n**3. 句子结构**\n\n这是一个带有倒装结构的复合句，其结构为：倒装句 + 主句。具体分析如下：\n\n倒装句：\"Only after 'toddler' became a common shoppers’ term\"，这是句子的前半部分，使用了倒装语序来强调“只有在…之后”的概念。\n主句：\"it evolved into a broadly accepted developmental stage\"，这是句子的主要部分，表达的是“toddler”一词演变成广泛接受的发展阶段的观点。\n\n**4. 语法分析**\n\n这个句子使用了倒装结构，即把句子的谓语动词放在主语之前，用于强调句子中的某一部分。在这个句子中，\"only after 'toddler' became a common shoppers’ term\" 是倒装的部分，用于强调\"只有在'toddler'成为常见的购物者术语之后\"的概念。主句\"it evolved into a broadly accepted developmental stage\" 则是正常的主谓宾语序，描述\"toddler\"一词如何演变的过程。\n\n**5. 知识点总结**\n\n1. **倒装句的使用**：倒装句是一种语序结构，把谓语动词放在主语之前，用于强调句子中的某一部分。例如：\"Only then did he realize his mistake.\"（只有那时他才意识到他的错误。）\n1. **“only after”的使用**： \"Only after\" 是一个常用的表达方式，用来强调某件事只有在另一件事发生后才会发生。例如：\"Only after the rain stopped did we go out.\"（只有在雨停后我们才出去。）\n1. **名词作为主语的用法**：\"Toddler\" 在这个句子中作为主语，指的是 \"学步期儿童\" 这个阶段。\n\n**6. 练习相似句子**\n\n\"Only after 'mobile phone' became a common term did it evolve into an essential item in our daily lives.\"\n\n\"只有当'手机'成为常见术语时，它才演变成我们日常生活中的必需品。\""},{"text":"Splitting kids, or adults, into ever-tinier categories has proved a sure-fire way to boost profits.","explainMd":"**1. 翻译**\n\n\"将儿童或成人划分为越来越细小的类别已被证明是提高利润的可靠方式。\"\n\n**2. 词汇和短语**\n\n- Splitting: 划分\n- Kids: 儿童\n- Adults: 成人\n- Into ever-tinier categories: 划分为越来越小的类别\n- Has proved: 已被证明\n- A sure-fire way: 一个可靠的方法\n- To boost: 提高\n- Profits: 利润\n\n**3. 句子结构**\n\n这是一个简单句，其结构为主+谓+宾。具体分析如下：\n\n主语：Splitting kids, or adults, into ever-tinier categories\n谓语：Has proved\n宾语：A sure-fire way to boost profits\n\n**4. 语法分析**\n\n这个句子的主语是“将儿童或成人划分为越来越细小的类别”，谓语是“已被证明”，宾语是“提高利润的可靠方式”。主语中使用了或连接的并列结构，将两个动作\"splitting kids\"和\"splitting adults\"并列在一起。同时，宾语中的\"to boost profits\"是一个不定式结构，用来表达目的。\n\n**5. 知识点总结**\n\n1. **并列结构的使用**：这个句子中，\"kids\"和\"adults\"是通过或连接词并列在一起的，这种结构可以同时描述多个主体或动作。例如：\"He likes apples and oranges.\"（他喜欢苹果和橙子。）\n\n1. **不定式表达目的**：在这个句子中，\"to boost profits\"是一个不定式结构，用来表达\"提高利润\"的目的。不定式常常用来表达目的，例如：\"He studies hard to pass the exam.\"（他努力学习以通过考试。）\n\n1. **动词“prove”的用法**：在这个句子中，\"has proved\"是用来表达“已被证明”这个概念的。\"prove\"可以用来表达某事被证明为真或者有效。例如：\"The experiment has proved his theory correct.\"（实验已经证明了他的理论是正确的。）\n\n**6. 练习相似句子**\n\n\"Creating unique experiences for each customer has proved a sure-fire way to boost sales.\"\n\n\"为每个客户创建独特的体验已被证明是提高销售的可靠方式。\""},{"text":"And one of the easiest ways to segment a market is to magnify gender differences—or invent them where they did not previously exist.","explainMd":"**1. 翻译**\n\n\"并且，放大性别差异或者在之前不存在的地方创造出性别差异是区分市场的最简单方法之一。\"\n\n**2. 词汇和短语**\n\n- And one of the easiest ways: 并且最简单的方法之一\n- To segment: 区分\n- A market: 市场\n- Is to magnify: 是放大\n- Gender differences: 性别差异\n- Or invent them: 或者创造出它们\n- Where they did not previously exist: 在它们之前不存在的地方\n\n**3. 句子结构**\n\n这是一个复合句，其结构为：主句。具体分析如下：\n\n主句：And one of the easiest ways to segment a market is to magnify gender differences or invent them where they did not previously exist.\n\n主语：And one of the easiest ways to segment a market\n谓语：is\n宾语：to magnify gender differences or invent them where they did not previously exist\n\n**4. 语法分析**\n\n这个句子的主语是\"并且最简单的方法之一是区分市场\"，谓语是\"is\"，宾语是\"放大性别差异或者在之前不存在的地方创造出性别差异\"。在宾语中，\"to magnify gender differences or invent them\"是一个并列结构，用来表示放大性别差异或者创造性别差异这两个动作。\n\n**5. 知识点总结**\n\n1. **并列结构的使用**：在这个句子中，\"to magnify gender differences\"和\"or invent them\"是通过连接词\"or\"并列在一起的，这种结构可以同时描述多个动作。例如：\"She studies hard and passes the exam.\"（她努力学习并且通过了考试。）\n\n1. **不定式的用法**：在这个句子中，\"to magnify gender differences\"和\"to invent them\"是两个不定式结构，用来表示动作。不定式在句子中可以作为主语、宾语、表语等。例如：\"To read is to learn.\"（读书就是学习。）\n\n1. **\"where\"引导的定语从句**：在这个句子中，\"where they did not previously exist\"是一个由\"where\"引导的定语从句，用来修饰前面的\"them\"，说明这些性别差异在哪里不存在。例如：\"This is the place where I grew up.\"（这是我长大的地方。）\n\n**6. 练习相似句子**\n\n\"One of the most effective ways to differentiate products is to emphasize the unique features, or invent them where they did not previously exist.\"\n\n\"区分产品的最有效方法之一是强调独特的特性，或者在它们之前不存在的地方创造出它们。\""}]}],"title":""}