{"translate":"","paragraphs":[{"sentences":[{"text":"A deal is a deal—except, apparently, when Entergy is involved.","explainMd":"### 1. 翻译\n\n一项协议就是一项协议——显然，除非涉及到Entergy公司。\n\n### 2. 词汇和短语\n\n- **A deal is a deal**: \"一项协议就是一项协议\"，这个表达强调了协议的不可更改性和双方的承诺。\n- **except**: \"除非\"，用来引出例外情况。\n- **apparently**: \"显然\"，用于表达说话人的观察或判断。\n- **when Entergy is involved**: \"涉及到Entergy公司\"，Entergy是新英格兰地区的一家主要能源供应商。\n\n### 3. 句子结构\n\n这是一个简单句，句子的主干是 \"A deal is a deal\"，然后通过破折号连接了一个例外情况 \"except, apparently, when Entergy is involved\"。\n\n### 4. 语法\n\n本句主要使用了一般现在时，表示一个普遍真理或常态。此外，句子还使用了破折号来连接主句和例外情况。\n\n### 5. 知识点总结\n\n本句的关键知识点在于理解和使用破折号来连接句子的主要部分和例外情况，以及理解 \"A deal is a deal\" 这种强调协议不可更改性的表达方式。\n\n### 6. 相似句子练习\n\n\"Rules are rules—except, seemingly, when John is in charge.\"\n\n规则就是规则——除非，看起来，当约翰负责的时候。"},{"text":"The company, a major energy supplier in New England, provoked justified outrage in Vermont last week when it announced it was reneging on a longstanding commitment to abide by the state’s strict nuclear regulations.","explainMd":"### 1. 翻译\n\n这家公司是新英格兰的主要能源供应商，上周它宣布要违背遵守该州严格的核规定的长期承诺，引发了佛蒙特州的公正愤怒。\n\n### 2. 词汇和短语\n\n- **The company**: 指的是Entergy公司，文章的主题。\n- **a major energy supplier**: 指的是主要的能源供应商，强调了公司的重要性。\n- **provoked justified outrage**: \"引发了公正的愤怒\"，这里的 \"justified\" 表示 \"有正当理由的\"，\"outrage\" 表示 \"愤怒\"。\n- **reneging on a longstanding commitment**: \"违背长期的承诺\"，这里的 \"reneging on\" 是一个短语，表示 \"违背，不履行\"，\"longstanding commitment\" 指的是长期的承诺。\n- **abide by the state’s strict nuclear regulations**: \"遵守州的严格核规定\"，\"abide by\" 是一个短语，表示 \"遵守\"。\n\n### 3. 句子结构\n\n这是一个复杂句，主句是 \"The company provoked justified outrage in Vermont last week\"，然后通过 \"when\" 引导的时间状语从句来解释引发愤怒的原因。\n\n### 4. 语法\n\n本句主要使用了一般过去时，描述了上周公司做出的决定以及引发的后果。此外，句子中使用了 \"when\" 引导的时间状语从句。\n\n### 5. 知识点总结\n\n本句的关键知识点在于理解和使用时间状语从句来解释主句事件的发生时间和原因，以及如何使用一般过去时来描述过去的事件。\n\n### 6. 相似句子练习\n\n\"The school, a prestigious institution in the city, faced widespread criticism last month when it declared it was breaking its promise to provide free education to all students.\"\n\n这所学校是城市里的一所著名机构，上个月当它宣布要打破向所有学生提供免费教育的承诺时，引发了广泛的批评。"}]},{"sentences":[{"text":"Instead, the company has done precisely what it had long promised it would not: challenge the constitutionality of Vermont’s rules in the federal court, as part of a desperate effort to keep its Vermont Yankee nuclear power plant running.","explainMd":"### 1. 翻译\n\n然而，该公司确实做了它长久以来承诺不会做的事情：在联邦法院挑战佛蒙特州规定的合宪性，这是其为了继续运行佛蒙特州的阴基核电站而拼命努力的一部分。\n\n### 2. 词汇和短语\n\n- **Instead**: 用于引出相反的情况或强调差异，此处翻译为“然而”。\n- **has done precisely what it had long promised it would not**: \"做了它长久以来承诺不会做的事情\"，此处的 \"precisely\" 表示 \"确切的\"，强调了公司的行为与其承诺的直接对立。\n- **challenge the constitutionality of Vermont’s rules**: \"挑战佛蒙特州规定的合宪性\"，\"challenge the constitutionality\" 是一个短语，表示 \"挑战……的合宪性\"。\n- **in the federal court**: \"在联邦法院\"，指的是公司的法律行动场所。\n- **as part of a desperate effort to keep its Vermont Yankee nuclear power plant running**: \"作为为了保持其阴基核电站运行而进行的拼命努力的一部分\"，描述了公司挑战合宪性行动的目的。\n\n### 3. 句子结构\n\n这是一个复杂句，主句是 \"the company has done precisely what it had long promised it would not\"，接着用冒号引出具体的内容，然后用 \"as part of\" 引导的短语进一步解释这个行为的目的。\n\n### 4. 语法\n\n本句主要使用了现在完成时和过去完成时。其中，主句采用现在完成时，表示公司已经做了某事。而在 \"what it had long promised it would not\" 这个宾语从句中，使用了过去完成时，表示公司过去做出的承诺。\n\n### 5. 知识点总结\n\n本句的关键知识点在于理解和使用现在完成时和过去完成时来描述事件的发生及其相对时间性，以及如何使用冒号和 \"as part of\" 等结构来详细解释主句内容。\n\n### 6. 相似句子练习\n\n\"Instead, the team did exactly what it had repeatedly assured it would not: change the game rules at the last minute, in a desperate bid to win the championship.\"\n\n然而，球队确实做了它反复保证不会做的事：在最后一刻改变比赛规则，这是他们为了赢得冠军而拼命的努力的一部分。"},{"text":"It’s a stunning move.","explainMd":"### 1. 翻译\n\n这是一个令人震惊的举动。\n\n### 2. 词汇和短语\n\n- **It's**: 是 \"it is\" 的缩写，\"it\" 在这里是虚指代词，指代的是上文提到的 Entergy 公司的行为。\n- **a stunning move**: \"令人震惊的举动\"，\"stunning\" 用来形容令人吃惊或震惊的事物，\"move\" 在此指的是行动或举动。\n\n### 3. 句子结构\n\n这是一个简单句，主语是 \"it\"，谓语是 \"is\"，宾语是 \"a stunning move\"。\n\n### 4. 语法\n\n在这个句子中，\"it's\" 是一个常见的缩写形式，代表 \"it is\"。\"stunning\" 是形容词，用来修饰名词 \"move\"。整个句子的语法结构非常简单，属于基础级别的英语句子。\n\n### 5. 知识点总结\n\n这个句子的知识点主要在于理解虚指代词 \"it\" 的用法和形容词 \"stunning\" 的含义，以及如何描述对某一行动或决定的反应。\n\n### 6. 相似句子练习\n\n\"It's an incredible achievement.\"\n\n这是一个不可思议的成就。"}]},{"sentences":[{"text":"The conflict has been surfacing since 2002, when the corporation bought Vermont’s only nuclear power plant, an aging reactor in Vernon.","explainMd":"### 1. 翻译\n\n这个冲突自2002年开始浮出水面，那时这个公司购买了佛蒙特州唯一的一个核电厂，一个位于弗农的老化反应堆。\n\n### 2. 词汇和短语\n\n- **The conflict**: 这里的 \"conflict\" 指的是文章所述的涉及 Entergy 公司和佛蒙特州的争端。\n- **has been surfacing**: \"surfacing\" 的意思是\"浮出水面，显现出来\"，\"has been surfacing\" 是现在完成进行时，表示这个冲突从过去某个时间点开始一直持续到现在，并可能仍在进行中。\n- **since 2002**: 表示这个冲突从2002年开始就显现出来了。\n- **when the corporation bought**: 这里的 \"when\" 引导的是时间状语从句，解释了冲突出现的时间和原因。\n- **Vermont’s only nuclear power plant, an aging reactor in Vernon**: 这部分是对 \"nuclear power plant\" 的进一步说明，\"an aging reactor in Vernon\" 是对 \"nuclear power plant\" 的同位语说明。\n\n### 3. 句子结构\n\n这是一个复合句，主句是 \"The conflict has been surfacing since 2002\"，从句是 \"when the corporation bought Vermont’s only nuclear power plant, an aging reactor in Vernon\"。\n\n### 4. 语法\n\n这个句子使用了现在完成进行时态 \"has been surfacing\" 来表示从过去某一时间点开始并持续到现在的动作或状态。此外，\"when\" 引导的时间状语从句解释了主句中 \"since 2002\" 的具体情况。\n\n### 5. 知识点总结\n\n这个句子的知识点主要在于理解现在完成进行时态的用法，以及 \"when\" 引导的时间状语从句和同位语的应用。\n\n### 6. 相似句子练习\n\n\"The problem has been existing since 2010, when the company started its overseas business.\"\n\n问题自2010年公司开始其海外业务时就一直存在着。"},{"text":"As a condition of receiving state approval for the sale, the company agreed to seek permission from state regulators to operate past 2012.","explainMd":"### 1. 翻译\n\n作为接收到州政府对销售的批准的条件，公司同意向州监管机构申请在2012年后继续运营。\n\n### 2. 词汇和短语\n\n- **As a condition of**: 这个短语的意思是 \"作为...的条件\"，在这个上下文中，它是说公司接收到州政府批准的条件。\n- **receiving state approval for the sale**: \"receiving\" 是 \"receive\" 的现在分词形式，表示 \"接收\"，\"state approval for the sale\" 指的是州政府对销售的批准。\n- **the company agreed to seek permission from state regulators**: \"the company agreed to\" 表示 \"公司同意...\"，\"seek permission from state regulators\" 的意思是 \"向州监管机构寻求许可\"。\n- **to operate past 2012**: \"to operate\" 是 \"operate\" 的不定式形式，表示 \"运营\"，\"past 2012\" 表示 \"在2012年过后\"。\n\n### 3. 句子结构\n\n这是一个复杂句，包含一个主句 \"the company agreed to seek permission from state regulators to operate past 2012\" 和一个以 \"as\" 引导的原因状语从句 \"As a condition of receiving state approval for the sale\"。\n\n### 4. 语法\n\n这个句子的主要语法点是 \"as\" 引导的原因状语从句的使用，以及 \"agree to\" 的用法，表示 \"同意做某事\"。此外，还使用了 \"seek permission from\" 这个短语，表示 \"向...寻求许可\"。\n\n### 5. 知识点总结\n\n这个句子的主要知识点包括 \"as\" 引导的原因状语从句的使用，\"agree to\" 的用法，以及 \"seek permission from\" 这个短语的使用。\n\n### 6. 相似句子练习\n\n\"As a requirement for graduation, students are required to complete a thesis project.\"\n\n作为毕业的要求，学生需要完成一个论文项目。"},{"text":"In 2006, the state went a step further, requiring that any extension of the plant’s license be subject to the Vermont legislature’s approval.","explainMd":"### 1. 翻译\n\n在2006年，州政府进一步要求，电厂许可证的任何延期都必须经过佛蒙特州立法机构的批准。\n\n### 2. 词汇和短语\n\n- **In 2006**: 指的是在2006年这个时间点。\n- **the state went a step further**: 这个短语的意思是 \"州政府进一步采取了行动\"。\n- **requiring that**: 这个短语的意思是 \"要求...\"。\n- **any extension of the plant’s license**: \"extension\" 在此处是 \"延期\" 的意思，\"the plant’s license\" 指的是 \"电厂的许可证\"。\n- **be subject to**: 这个短语的意思是 \"受制于\" 或 \"必须经过\"。\n- **the Vermont legislature’s approval**: \"the Vermont legislature\" 是 \"佛蒙特州的立法机构\"，\"approval\" 是 \"批准\" 的意思。\n\n### 3. 句子结构\n\n这是一个复杂句，主句是 \"the state went a step further\"，然后是一个由 \"requiring\" 引导的宾语从句 \"that any extension of the plant’s license be subject to the Vermont legislature’s approval\"。\n\n### 4. 语法\n\n这个句子使用了虚拟语气，\"requiring that\" 后面的宾语从句用的是 \"be\" 而不是 \"is\"，这是因为在某些表示要求、命令、建议的动词后的从句中，通常使用 \"should + 动词原形\" 或者省略 \"should\" 直接用动词原形。\n\n### 5. 知识点总结\n\n这个句子的主要知识点是 \"requiring that\" 后面的虚拟语气的使用，以及 \"be subject to\" 这个短语的使用。\n\n### 6. 相似句子练习\n\nIn 2020, the school board decided to implement a new policy, requiring that all students wear uniforms to school.\n\n在2020年，学校董事会决定实施一项新的政策，要求所有的学生都必须穿校服上学。"},{"text":"Then, too, the company went along.","explainMd":"### 1. 翻译\n\n那时，公司也同意了。\n\n### 2. 词汇和短语\n\n- **Then, too**: 这里的 \"too\" 是副词，表示 \"也\"， \"then\" 是时间副词，表示 \"那时\" 或 \"然后\"，所以 \"then, too\" 的意思是 \"那时也\"。\n- **the company**: 指的是文中所提的 Entergy 公司。\n- **went along**: 这是一个常用短语，表示 \"顺从\" 或 \"同意\"。\n\n### 3. 句子结构\n\n这是一个简单句，主语是 \"the company\"，谓语是 \"went along\"。\n\n### 4. 语法\n\n这个句子的语法并不复杂，主要是使用了副词 \"too\" 来表示 \"也\" 的意思，然后使用了短语 \"went along\" 来表示公司的行为。\n\n### 5. 知识点总结\n\n这个句子的主要知识点是 \"went along\" 这个短语的用法，以及副词 \"too\" 的使用。\n\n### 6. 相似句子练习\n\nShe was not fond of the idea initially, but eventually, she went along.\n\n她最初并不喜欢这个主意，但最终，她还是同意了。"}]},{"sentences":[{"text":"Either Entergy never really intended to live by those commitments, or it simply didn’t foresee what would happen next.","explainMd":"### 1. 翻译\n\nEntergy公司要么从未真正打算遵守那些承诺，要么就是无法预见接下来会发生什么。\n\n### 2. 词汇和短语\n\n- **Either...or...**: 这是一个表示选择的并列连词，意为 \"要么...要么...\"。\n- **never really intended**: 这是一个否定的表达方式，表示 \"从未真正打算\"。\n- **live by**: 这是一个短语，表示 \"遵守\" 或 \"按照...生活\"。\n- **commitments**: 这是一个名词，表示 \"承诺\" 或 \"义务\"。\n- **foresee**: 这是一个动词，表示 \"预见\" 或 \"预知\"。\n\n### 3. 句子结构\n\n这是一个复合句。主句是 \"Either Entergy never really intended to live by those commitments\"，从句是 \"or it simply didn’t foresee what would happen next\"。\n\n### 4. 语法\n\n这个句子的语法结构主要是 \"either...or...\" 的结构，表示两种可能性的选择。此外， \"never really intended\" 是一个否定的表达方式，表示 \"从未真正打算\"。\n\n### 5. 知识点总结\n\n这个句子主要的知识点是 \"either...or...\" 的语法结构，以及 \"never really intended\" 和 \"foresee\" 这两个短语的使用。\n\n### 6. 相似句子练习\n\nEither you didn't fully understand the instructions, or you chose to ignore them.\n\n你要么是没有完全理解这些指示，要么是选择忽视它们。"},{"text":"A string of accidents, including the partial collapse of a cooling tower in 2007 and the discovery of an underground pipe system leakage, raised serious questions about both Vermont Yankee’s safety and Entergy’s management—especially after the company made misleading statements about the pipe.","explainMd":"### 1. 翻译\n\n一连串的事故，包括2007年一座冷却塔的部分倒塌和一个地下管道系统的泄漏发现，引发了对Vermont Yankee的安全性和Entergy公司管理的严重质疑——尤其是在该公司对管道情况做出误导性陈述之后。\n\n### 2. 词汇和短语\n\n- **A string of**: 这是一个常用的短语，表示 \"一连串的\" 或 \"一系列的\"。\n- **accidents**: 这是一个名词，表示 \"事故\"。\n- **including**: 这是一个介词，表示 \"包括\"。\n- **partial collapse**: 这是一个名词短语，表示 \"部分倒塌\"。\n- **raised serious questions**: 这是一个动词短语，表示 \"引起严重的质疑\"。\n- **misleading statements**: 这是一个名词短语，表示 \"误导性的陈述\"。\n\n### 3. 句子结构\n\n这是一个复合句。主句是 \"A string of accidents raised serious questions about both Vermont Yankee’s safety and Entergy’s management\"，而 \"including the partial collapse of a cooling tower in 2007 and the discovery of an underground pipe system leakage\" 是一个介词短语作为补充说明，\"especially after the company made misleading statements about the pipe\" 是一个状语从句。\n\n### 4. 语法\n\n这个句子的语法结构主要包含了一种并列结构 \"both...and...\"，表示 \"既...又...\"，以及 \"including\" 和 \"especially\" 这两个词的使用。\n\n### 5. 知识点总结\n\n这个句子主要的知识点是 \"both...and...\" 的并列结构，以及 \"including\" 和 \"especially\" 这两个词的使用。\n\n### 6. 相似句子练习\n\nA series of mistakes, including incorrect calculations and inaccurate data, raised serious doubts about the project's feasibility, especially after the team made conflicting statements about the results.\n\n一系列的错误，包括错误的计算和不准确的数据，引起了对项目可行性的严重怀疑，尤其是在团队对结果做出冲突性陈述之后。"},{"text":"Enraged by Entergy’s behavior, the Vermont Senate voted 26 to 4 last year against allowing an extension.","explainMd":"### 1. 翻译\n\n对Entergy的行为感到愤怒，佛蒙特州参议院在去年以26比4的投票结果反对允许其延期。\n\n### 2. 词汇和短语\n\n- **Enraged by**: 这是一个短语，表示 \"对...感到愤怒\"。\n- **behavior**: 这是一个名词，表示 \"行为\"。\n- **the Vermont Senate**: 这是一个专有名词，表示 \"佛蒙特州的参议院\"。\n- **voted**: 这是一个动词，表示 \"投票\"。\n- **against allowing an extension**: 这是一个短语，表示 \"反对允许延期\"。\n\n### 3. 句子结构\n\n这是一个简单句，主句是 \"the Vermont Senate voted 26 to 4 last year against allowing an extension\"，\"Enraged by Entergy’s behavior\" 是一个状语从句。\n\n### 4. 语法\n\n这个句子的语法结构主要包含了一个状语从句 \"Enraged by...\"，表示原因或理由，以及 \"voted...against...\" 这个结构，表示投票反对某事。\n\n### 5. 知识点总结\n\n这个句子主要的知识点是 \"Enraged by...\" 的状语从句用法，以及 \"voted...against...\" 这个结构的使用。\n\n### 6. 相似句子练习\n\nDisturbed by the company's lack of transparency, the board of directors voted 10 to 2 last month against renewing the CEO's contract.\n\n对公司透明度的缺乏感到不安，董事会在上个月以10比2的投票结果反对续签首席执行官的合同。"}]},{"sentences":[{"text":"Now the company is suddenly claiming that the 2002 agreement is invalid because of the 2006 legislation, and that only the federal government has regulatory power over nuclear issues.","explainMd":"### 1. 翻译\n\n现在这家公司突然声称，由于2006年的立法，2002年的协议无效，并且只有联邦政府有权对核问题进行监管。\n\n### 2. 词汇和短语\n\n- **Now**: 这是一个副词，表示 \"现在\"。\n- **the company**: 这是一个名词短语，表示 \"这家公司\"。\n- **is suddenly claiming**: 这是一个动词短语，表示 \"突然声称\"。\n- **invalid**: 这是一个形容词，表示 \"无效的\"。\n- **because of**: 这是一个短语，表示 \"因为\"。\n- **legislation**: 这是一个名词，表示 \"立法\"。\n- **only the federal government**: 这是一个短语，表示 \"只有联邦政府\"。\n- **has regulatory power over nuclear issues**: 这是一个短语，表示 \"对核问题有监管权\"。\n\n### 3. 句子结构\n\n这是一个复合句，包含两个并列的主句：\"the company is suddenly claiming that the 2002 agreement is invalid because of the 2006 legislation\" 和 \"only the federal government has regulatory power over nuclear issues\"。\n\n### 4. 语法\n\n- 第一部分的语法结构主要是 \"is claiming that...\"，表示某人声称某事。在这里，\"that the 2002 agreement is invalid because of the 2006 legislation\" 是一个宾语从句。\n- 第二部分的语法结构是 \"only...has...\"，表示只有...有...。\n\n### 5. 知识点总结\n\n这个句子的知识点主要是 \"is claiming that...\" 的句型用法，以及 \"only...has...\" 的结构。\n\n### 6. 相似句子练习\n\nNow the school is suddenly announcing that the old curriculum is obsolete because of the new educational reform, and that only the Ministry of Education has authority over curriculum changes.\n\n现在这所学校突然宣布，由于新的教育改革，旧的课程已经过时，只有教育部有权对课程进行修改。"},{"text":"The legal issues in the case are obscure: whereas the Supreme Court has ruled that states do have some regulatory authority over nuclear power, legal scholars say the Vermont case will offer a precedent-setting test of how far those powers extend.","explainMd":"### 1. 翻译\n\n此案中的法律问题并不明确：尽管最高法院已经裁定各州具有对核电的某些监管权力，但法律学者们认为佛蒙特州的案件将提供一个判断这些权力延伸多远的先例。\n\n### 2. 词汇和短语\n\n- **The legal issues**: 法律问题，这是一个名词短语。\n- **are obscure**: 是模糊的，是一个动词短语。\n- **whereas**: 然而，是一个连词，用来引导对比的从句。\n- **the Supreme Court has ruled**: 最高法院已经裁定，是一个动词短语。\n- **that states do have some regulatory authority over nuclear power**: 各州对核电有一些监管权，是一个宾语从句。\n- **legal scholars say**: 法学家们说，是一个动词短语。\n- **the Vermont case will offer a precedent-setting test of how far those powers extend**: 佛蒙特州的案件将提供一个判断这些权力延伸多远的创例测试，是另一个宾语从句。\n\n### 3. 句子结构\n\n这是一个复合句，主要由两个部分组成：\"The legal issues in the case are obscure: whereas the Supreme Court has ruled that states do have some regulatory authority over nuclear power\" 和 \"legal scholars say the Vermont case will offer a precedent-setting test of how far those powers extend\"。\n\n### 4. 语法\n\n这个句子的语法中，\"whereas\" 引导的是对比的从句，\"the Supreme Court has ruled that...\" 是一个宾语从句，\"legal scholars say that...\" 也是一个宾语从句。\n\n### 5. 知识点总结\n\n这个句子的知识点主要是 \"whereas\" 的使用和对比从句的构造，以及 \"say that...\" 结构的使用和宾语从句的构造。\n\n### 6. 相似句子练习\n\nThe safety issues in the construction site are serious: whereas the management has claimed that all necessary precautions have been taken, workers say the site will present a real test of how far those safety measures extend.\n\n建筑工地上的安全问题非常严重：尽管管理层已经声称采取了所有必要的预防措施，但工人们说这个工地将提供一个真正的测试，看这些安全措施能延伸多远。"},{"text":"Certainly, there are valid concerns about the patchwork regulations that could result if every state sets its own rules.","explainMd":"### 1. 翻译\n\n诚然，如果每个州都制定自己的规则，可能会导致各种混杂的监管出现，这个问题是值得关注的。\n\n### 2. 词汇和短语\n\n- **Certainly**: 诚然，是一个副词，用于强调句子的确切性。\n- **there are valid concerns**: 存在正当的关注，是一个主语加谓语的结构。\n- **about the patchwork regulations**: 关于混杂的规定，是一个前置介词短语。\n- **that could result if every state sets its own rules**: 如果每个州都制定自己的规则所可能产生的，是一个条件从句。\n\n### 3. 句子结构\n\n这个句子的结构是：主语(\"there\") + 谓语(\"are\") + 宾语(\"valid concerns\") + 状语(\"about the patchwork regulations that could result if every state sets its own rules\")。\n\n### 4. 语法\n\n这句话的语法主要涉及到的是条件从句（\"if\"引导的从句），以及介词短语的使用。\n\n### 5. 知识点总结\n\n本句的知识点主要集中在条件从句的使用以及介词短语的构造上。\"if\"引导的条件从句用于描述可能的情况，而介词短语则用来修饰前面的名词。\n\n### 6. 相似句子练习\n\nCertainly, there are valid concerns about the diverse strategies that could emerge if every company designs its own business model.\n\n诚然，如果每家公司都设计自己的商业模式，可能会出现各种不同的策略，这个问题值得关注。"},{"text":"But had Entergy kept its word, that debate would be beside the point.","explainMd":"### 1. 翻译\n\n但是，如果安特吉公司信守其承诺，那么这场争论就会变得无关紧要。\n\n### 2. 词汇和短语\n\n- **But**: 但是，一个转折连词，用来引入对前面内容的对比或反驳。\n- **had Entergy kept its word**: 如果安特吉公司信守其承诺，是一个虚拟语气的条件句（过去完成时）。\n- **that debate**: 那场争论，一个指代前文中提到的争论的代词短语。\n- **would be beside the point**: 将会变得无关紧要，一个表示假设结果的虚拟语气句（将来时）。\n\n### 3. 句子结构\n\n这个句子的结构是：转折连词(\"But\") + 条件从句(\"had Entergy kept its word\") + 主句(\"that debate would be beside the point\")。\n\n### 4. 语法\n\n这句话的语法主要涉及到的是虚拟语气的使用。这里的虚拟语气是对过去的假设，因此使用过去完成时（had + 过去分词）。而假设的结果则用would + 动词原形来表示。\n\n### 5. 知识点总结\n\n本句的知识点主要集中在虚拟语气的使用上，特别是对过去事情的假设。此外，\"be beside the point\"是一个常用的表达，意为\"无关紧要\"。\n\n### 6. 相似句子练习\n\nBut had you studied harder, the test would have been a piece of cake.\n\n但是，如果你学习得更努力，那么这个测试就会变得非常简单。"}]},{"sentences":[{"text":"The company seems to have concluded that its reputation in Vermont is already so damaged that it has nothing left to lose by going to war with the state.","explainMd":"### 1. 翻译\n\n公司似乎已经得出结论，其在佛蒙特州的声誉已经受到如此严重的损害，以至于它没有什么可失去的，可以和州政府进行对抗。\n\n### 2. 词汇和短语\n\n- **The company**: 公司，指的是上文中提到的 Entergy 公司。\n- **seems to have concluded**: 似乎已经得出结论，一个表达推测或推断的短语。\n- **its reputation in Vermont**: 它在佛蒙特州的声誉，\"reputation\" 指一个人或组织在公众中的形象或评价。\n- **is already so damaged**: 已经受到如此严重的损害，\"damaged\" 是形容词，表示受到伤害或损害的状态。\n- **that it has nothing left to lose**: 以至于它没有什么可失去的，一个结果从句，用来表达由于其声誉受损的结果。\n- **by going to war with the state**: 通过和州政府进行对抗，\"go to war with\" 是一个比喻短语，表示与某人或某组织产生严重冲突或争执。\n\n### 3. 句子结构\n\n这个句子的结构是：主语(\"The company\") + 谓语(\"seems to have concluded\") + 宾语从句(\"that its reputation in Vermont is already so damaged that it has nothing left to lose by going to war with the state\")。\n\n### 4. 语法\n\n这句话的语法主要涉及到的是结果从句的使用。\"so...that...\" 结构用来表达\"如此...以至于...\"，在这里用来强调公司声誉的损害程度以及由此产生的结果。\n\n### 5. 知识点总结\n\n本句的知识点主要集中在结果从句的使用上，特别是 \"so...that...\" 结构的运用。此外，\"go to war with\" 是一个常用的表达，用于形象地描绘严重的冲突或争执。\n\n### 6. 相似句子练习\n\nHe seems to have realized that his relationship with his boss is so bad that he has nothing left to lose by quitting the job.\n\n他似乎已经意识到他和他的老板的关系已经如此糟糕，以至于他没有什么可以失去的，可以辞掉这份工作。"},{"text":"But there should be consequences.","explainMd":"### 1. 翻译\n\n但是，应该有相应的后果。\n\n### 2. 词汇和短语\n\n- **But**: 但是，用于表示对前面句子或观点的转折。\n- **there**: 在这里用于引导非人称主语的句子，翻译为\"应该\"。\n- **should**: 应该，表示一种推测或者期待。\n- **be consequences**: 有后果，\"consequences\" 指的是一种行为或决策的结果或影响。\n\n### 3. 句子结构\n\n这个句子的结构是：转折连接词(\"But\") + 非人称主语(\"there\") + 谓语动词(\"should\") + 宾语(\"be consequences\")。\n\n### 4. 语法\n\n这句话的语法主要涉及到的是非人称主语句子的使用。非人称主语句子是以 \"there\" 作为主语的句子，常用来表示存在或发生的概念。\n\n### 5. 知识点总结\n\n本句的知识点主要集中在非人称主语句子的使用上。此外，\"should\" 用于表示一种推测或期待，常用于建议，提议或者期望的情况。\n\n### 6. 相似句子练习\n\nBut there should be improvements.\n\n但是，应该有所改进。\n\n本句同样是一个非人称主语的句子，\"there\" 引导句子，\"should\" 表示一种期待或推测，\"be improvements\" 表示\"有所改进\"。"},{"text":"Permission to run a nuclear plant is a public trust.","explainMd":"### 1. 翻译\n\n运营核电厂的许可是公众的信托。\n\n### 2. 词汇和短语\n\n- **Permission**: 许可，允许。指的是获得的权力或许可去做某事。\n- **to run**: 经营，运营。在这里指的是管理和运行核电厂。\n- **a nuclear plant**: 核电厂。这是一个固定搭配，泛指使用核能进行发电的设施。\n- **is**: 是，用于连接主语和表语。\n- **a public trust**: 公众的信任。\"public\" 指的是公众，\"trust\" 在这里表示信托。\n\n### 3. 句子结构\n\n这个句子的结构是：主语(\"Permission to run a nuclear plant\") + 谓语动词(\"is\") + 表语(\"a public trust\")。\n\n### 4. 语法\n\n本句主要涉及的语法点是主谓表结构。主语是 \"Permission to run a nuclear plant\"，谓语动词是 \"is\"，表语是 \"a public trust\"。\n\n### 5. 知识点总结\n\n- 使用 \"Permission to\" 表示许可做某事。\n- \"run\" 在此处的意思是运营或管理。\n- 主谓表结构的使用，其中 \"is\" 作为链接动词连接主语和表语。\n\n### 6. 相似句子练习\n\nPermission to operate a hospital is a public responsibility.\n\n运营医院的许可是公众的责任。\n\n这句话中，\"Permission to operate a hospital\" 作为主语，\"is\" 是谓语动词，\"a public responsibility\" 是表语，表达的意思是获得运营医院的许可是承担了一项公众责任。"},{"text":"Entergy runs 11 other reactors in the United States, including Pilgrim Nuclear station in Plymouth.","explainMd":"### 1. 翻译\n\n安特吉在美国运营着其他11个反应堆，包括位于普利茅斯的朝圣者核电站。\n\n### 2. 词汇和短语\n\n- **Entergy**: 安特吉，这是一家在美国的大型能源公司的名称。\n- **runs**: 运营，管理。在这里指的是公司管理和运行这些核电站。\n- **11 other reactors**: 其他11个反应堆。\"other\" 是指这些反应堆以外的，\"11\" 是数量，\"reactors\" 是反应堆，通常在这里指的是核反应堆。\n- **in the United States**: 在美国。指的是这些反应堆的地理位置。\n- **including**: 包括。介词，用于列举出具体的例子。\n- **Pilgrim Nuclear station in Plymouth**: 位于普利茅斯的朝圣者核电站。这是具体的一个核电站的名称和位置。\n\n### 3. 句子结构\n\n这个句子的结构是：主语(\"Entergy\") + 谓语动词(\"runs\") + 宾语(\"11 other reactors in the United States\") + 介词短语(\"including Pilgrim Nuclear station in Plymouth\")。\n\n### 4. 语法\n\n这个句子的语法结构是主谓宾结构。主语是“Entergy”，谓语动词是“runs”，宾语是“11 other reactors in the United States”，在句尾的“including Pilgrim Nuclear station in Plymouth”是一个介词短语，用来进一步说明宾语。\n\n### 5. 知识点总结\n\n- 使用 \"run\" 表示运营或管理某事物。\n- \"including\" 用来列举具体的例子或者详细信息。\n- 主谓宾结构的使用。\n\n### 6. 相似句子练习\n\nApple sells products in many countries, including China.\n\n苹果在许多国家销售产品，包括中国。\n\n这句话中，“Apple” 作为主语，“sells” 是谓语动词，“products in many countries” 是宾语，“including China” 是介词短语，用来进一步说明宾语。"},{"text":"Pledging to run Pilgrim safely, the company has applied for federal permission to keep it open for another 20 years.","explainMd":"### 1. 翻译\n\n承诺将安全运营朝圣者核电站，公司已申请联邦许可，以便将其开放运营另外20年。\n\n### 2. 词汇和短语\n\n- **Pledging**: 承诺。表示对某事的承诺或保证。\n- **to run Pilgrim safely**: 安全运营朝圣者核电站。\"run\" 在此表示管理或运营，\"safely\" 是副词，修饰 \"run\"，表示安全地运营。\n- **the company**: 公司。指的是前文提到的 \"Entergy\"。\n- **has applied for**: 已申请。表示公司已经进行了某项申请。\n- **federal permission**: 联邦许可。\"federal\" 在此表示由美国联邦政府授予的，\"permission\" 是许可或批准。\n- **to keep it open for another 20 years**: 以便将其开放运营另外20年。\"keep it open\" 在此表示继续运营，\"another 20 years\" 表示额外的20年时间。\n\n### 3. 句子结构\n\n这个句子的结构是：主语(\"the company\") + 谓语(\"has applied for federal permission\") + 目的状语从句(\"to keep it open for another 20 years\")。句首的 \"Pledging to run Pilgrim safely,\" 是修饰整个句子，表示公司的承诺。\n\n### 4. 语法\n\n- 这个句子使用了现在完成时态(\"has applied for\")，表示在过去发生的动作对现在的影响或结果。\n- 句子使用了目的状语从句(\"to keep it open for another 20 years\")，表示公司申请联邦许可的目的。\n\n### 5. 知识点总结\n\n- 使用 \"pledge to do something\" 来表示对某事的承诺。\n- 现在完成时态的使用，表示过去发生的动作对现在的影响或结果。\n- 目的状语从句的使用，表示动作的目的。\n\n### 6. 相似句子练习\n\nCommitted to delivering products on time, the company has asked for an additional workforce.\n\n承诺准时交付产品，公司已申请增加员工人数。\n\n在这个句子中，\"Committed to delivering products on time\" 是修饰整个句子，表示公司的承诺，\"the company\" 是主语，\"has asked for\" 是现在完成时，表示过去发生的动作对现在的影响，\"an additional workforce\" 是宾语，表示公司申请的内容。"},{"text":"But as the Nuclear Regulatory Commission (NRC) reviews the company’s application, it should keep in mind what promises from Entergy are worth.","explainMd":"### 1. 翻译\n\n但是，在核能监管委员会（NRC）审查公司的申请时，它应记住，恩特吉的承诺到底值多少。\n\n### 2. 词汇和短语\n\n- **But**: 然而，表示转折。\n- **as**: 当…时候，引导时间状语从句。\n- **the Nuclear Regulatory Commission (NRC)**: 核能监管委员会（NRC），是美国的一个独立机构，负责监管民用核能的使用。\n- **reviews**: 审查，对某事进行评估或检查。\n- **the company's application**: 公司的申请，指的是前文提到的 \"Entergy\" 提出的申请。\n- **it should keep in mind**: 它应该记住，表示某事应被记住或考虑。\n- **what promises from Entergy are worth**: 恩特吉的承诺到底值多少，这里 \"what\" 是引导的宾语从句，表示 \"Entergy\" 的承诺的价值。\n\n### 3. 句子结构\n\n这个句子的结构是：连词(\"But\") + 时间状语从句(\"as the Nuclear Regulatory Commission (NRC) reviews the company's application\") + 主语(\"it\") + 谓语(\"should keep in mind\") + 宾语从句(\"what promises from Entergy are worth\")。\n\n### 4. 语法\n\n- 这个句子使用了时间状语从句(\"as the Nuclear Regulatory Commission (NRC) reviews the company's application\")，表示在某个时间或动作进行时的情况。\n- 句子使用了宾语从句(\"what promises from Entergy are worth\")，作为 \"keep in mind\" 的宾语。\n\n### 5. 知识点总结\n\n- 使用 \"as\" 引导的时间状语从句表示在某个时间或动作进行时的情况。\n- 宾语从句的使用，作为动词或介词的宾语。\n\n### 6. 相似句子练习\n\nBut as the board reviews the project proposal, it should consider what benefits the community will get.\n\n但是，在董事会审查项目提案时，它应该考虑社区将得到什么好处。\n\n在这个句子中，\"But\" 是表示转折的连词，\"as the board reviews the project proposal\" 是时间状语从句，表示在某个时间或动作进行时的情况，\"it should consider\" 是主语和谓语，\"what benefits the community will get\" 是宾语从句，作为 \"consider\" 的宾语。"}]}],"title":""}