{"translate":"","paragraphs":[{"sentences":[{"text":"Up until a few decades ago, our visions of the future were largely—though by no means uniformly—glowingly positive.","explainMd":"**1. 翻译**\n\n\"直到几十年前，我们对未来的看法大多数情况下——尽管绝不是一致的——都是充满积极乐观的想象。\"\n\n\n**2. 词汇和短语**\n\n- `Up until a few decades ago`：直到几十年前\n- `our visions of the future`：我们对未来的看法\n- `were largely`：大多数情况下是\n- `though by no means uniformly`：尽管并不一直\n- `glowingly positive`：充满积极乐观的\n\n**3. 句子结构**\n\n这是一个主从复合句。主句是\"Our visions of the future were largely glowingly positive\"，从句是\"though by no means uniformly\"，用来修饰主句。\n\n**4. 语法**\n\n- `Up until a few decades ago`，这是一个时间状语从句，用来修饰整个主句。\n- `though by no means uniformly`，这是一个让步状语从句，表示虽然...但是...的意思。\n- `were largely`，这是一个系表结构，`were`是系动词，`largely`是副词，修饰后面的形容词`positive`。\n\n**5. 知识点总结**\n\n- 让步状语从句的使用：让步状语从句用来表达某种对比或冲突的情况，通常由although，though，even though等词引导。\n- 系表结构的理解：系动词后面通常跟形容词作表语，一起构成了系表结构，描述主语的状态或特征。\n\n**6. 练习相似句子**\n\n\"Up until the end of the last century, our understanding of the universe was largely—though by no means uniformly—limited and basic.\"\n\n\"直到上个世纪末，我们对宇宙的理解大多数情况下—尽管并不一直—都是有限的和基础的。\""},{"text":"Science and technology would cure all the ills of humanity, leading to lives of fulfillment and opportunity for all.","explainMd":"**1. 翻译**\n\n\"科学和技术将治愈人类的所有病痛，这将为所有人带来充实和机会的生活。\"\n\n**2. 词汇和短语**\n\n- `Science and technology`：科学和技术\n- `would cure`：将治愈\n- `all the ills of humanity`：人类的所有病痛\n- `leading to`：导致，引领\n- `lives of fulfillment and opportunity for all`：所有人的充实和机会的生活\n\n**3. 句子结构**\n\n这是一句复合句。主句是\"Science and technology would cure all the ills of humanity\"，\"leading to lives of fulfillment and opportunity for all\"是一个现在分词短语作状语，描述主句动作的结果。\n\n**4. 语法**\n\n- `Science and technology would cure`：这里使用了\"would\"来表示对未来的推测。\n- `leading to`：这是一个现在分词短语作状语，用来表示结果。\n\n**5. 知识点总结**\n\n- 对未来的推测可以使用\"would\"来表达。\n- 现在分词短语可以作状语，表示原因、条件、方式、结果等。\n\n**6. 练习相似句子**\n\n\"Education and knowledge would eliminate ignorance, leading to a society of wisdom and understanding for all.\"\n\n\"教育和知识将消除无知，这将为所有人带来一个充满智慧和理解的社会。\""}]},{"sentences":[{"text":"Now utopia has grown unfashionable, as we have gained a deeper appreciation of the range of threats facing us, from asteroid strike to epidemic flu and to climate change.","explainMd":"**1. 翻译**\n\n\"现在，乌托邦的想法已经不再流行，因为我们对面临的各种威胁，从小行星撞击到流感大流行，再到气候变化，有了更深的理解。\"\n\n**2. 词汇和短语**\n\n- `Now`：现在。用来表示当前的时间点。\n- `utopia`：乌托邦。这是一个名词，表示理想的社会或社区。\n- `has grown unfashionable`：已经变得不再流行。`has grown`表达了一种逐渐变化的状态，`unfashionable`是形容词，表示\"不流行的，不合时宜的\"。\n- `as we have gained a deeper appreciation`：因为我们对...有了更深的理解。`as`在此处是连词，表示原因；`have gained a deeper appreciation`是现在完成时态，表示对某事的理解增加了。\n- `the range of threats facing us`：面临我们的各种威胁。`range`表示范围，`threats`是威胁，`facing us`表示\"面临我们\"，即我们面临的。\n- `from asteroid strike to epidemic flu and to climate change`：从小行星撞击，到流行性感冒，再到气候变化。这是一个并列结构，列举了我们面临的几种威胁。\n\n**3. 句子结构**\n\n这是一个复合句。主句是\"Now utopia has grown unfashionable\"，而\"as we have gained a deeper appreciation of the range of threats facing us, from asteroid strike to epidemic flu and to climate change\"是一个原因状语从句。\n\n**4. 语法**\n\n- `has grown unfashionable`：这是一个现在完成时态的动词短语，用来表示过去开始的动作或状态在现在仍然持续或有影响。\n- `as we have gained a deeper appreciation`：这是一个原因状语从句，`as`在这里是连词，用来表示原因。\n\n**5. 知识点总结**\n\n- 本句使用了现在完成时(`has grown`)，这在英语中常用来描述从过去某个时间开始的行为或变化，并对现在产生了某种影响或结果。\n\n- 本句使用了 \"as\" 来引导原因状语从句，\"as\" 在这种结构中表示原因或理由，强调主句和从句之间的因果关系。\n\n- 本句使用了 \"from...to...\" 结构来列举一系列事物，这是一种常见的并列结构，用来表示一系列相似或相关的事物。在这个句子中，它列举了我们面临的一系列威胁。\n\n**6. 练习相似句子**\n\n\"Now traditional media has grown less influential, as we have gained a deeper understanding of the power of social media, from online campaigns to viral videos and to digital activism.\"\n\n\"现在，传统媒体的影响力已经减弱，因为我们对社交媒体的力量有了更深的理解，从在线活动，到病毒视频，再到数字激进主义。\""},{"text":"You might even be tempted to assume that humanity has little future to look forward to.","explainMd":"**1. 翻译**\n\n\"你甚至可能会被诱导去认为，人类几乎无未来可期。\"\n\n**2. 词汇和短语**\n\n- `You might even be tempted`：你甚至可能会被诱导\n- `to assume`：去认为\n- `that humanity has little future`：人类几乎无未来\n- `to look forward to`：期待\n\n**3. 句子结构**\n\n这是一句主从复合句。主句是\"You might even be tempted to assume\"，从句是\"that humanity has little future to look forward to\"，从句在这里作为动词\"assume\"的宾语。\n\n**4. 语法**\n\n- `might be tempted`：这是一个表示可能性的模态动词结构，\"might\"表示可能性，\"be tempted\"表示被诱导。\n- `to assume`：这是一个不定式结构，用来表示目的或意图。\n- `that humanity has little future to look forward to`：这是一个由\"that\"引导的宾语从句。\n\n**5. 知识点总结**\n\n- 模态动词的使用：模态动词\"might\"可以用来表示可能性，这是英语中表达可能性的一种常见方式。\n- 宾语从句的构建：宾语从句通常跟在某些动词后面，用来进一步解释或说明动词的内容，\"that\"是引导宾语从句的常见连词。\n\n**6. 练习相似句子**\n\n\"You might even be tempted to believe that there is little hope for solving the global warming problem.\"\n\n\"你甚至可能会被诱导去认为，几乎没有希望解决全球变暖的问题。\""}]},{"sentences":[{"text":"But such gloominess is misplaced.","explainMd":"**1. 翻译**\n\n\"但是，这样的悲观情绪是不合时宜的。\"\n\n**2. 词汇和短语**\n\n- `But`：但是，用作转折连词。\n- `such gloominess`：这样的悲观情绪，\"such\"用作形容词，表示\"这样的\"，\"gloominess\"是名词，表示\"悲观情绪\"。\n- `is misplaced`：错位的，\"is\"是系动词，\"misplaced\"是形容词，表示\"错位的\"“不合时宜的”。\n\n**3. 句子结构**\n\n这是一个简单句，包含一个主语（`such gloominess`）和一个谓语（`is misplaced`）。\n\n**4. 语法**\n\n本句使用了系表结构（`is misplaced`），其中`is`是系动词，`misplaced`是形容词作表语，描述主语`such gloominess`的状态。\n\n**5. 知识点总结**\n\n- 使用`but`作为转折连词，表示句子中的对比或转折关系。\n- 使用系表结构来描述主语的状态或特性，系动词`is`后面跟形容词`misplaced`作表语。\n\n**6. 练习相似句子**\n\n\"But such pessimism is uncalled for.\"\n\n\"但是，这样的悲观情绪是不必要的。\""},{"text":"The fossil record shows that many species have endured for millions of years—so why shouldn’t we?","explainMd":"**1. 翻译**\n\n\"化石记录表明，许多物种已经存在了数百万年——那么我们为什么不能呢？\"\n\n**2. 词汇和短语**\n\n- `The fossil record`：化石记录\n- `shows`：显示，表明\n- `that many species`：许多物种\n- `have endured`：已经存在，已经持续\n- `for millions of years`：数百万年\n- `so why shouldn’t we?`：那么我们为什么不能呢？\n\n**3. 句子结构**\n\n这是一个包含主句和宾语从句的复合句。主句是 \"The fossil record shows\"，`that many species have endured for millions of years` 是宾语从句，用来说明主句中的 \"shows\"；`so why shouldn’t we?` 是一个疑问句，表示对比和疑问。\n\n**4. 语法**\n\n- `The fossil record shows`：这里使用了现在时态，表示一个客观事实。\n- `have endured`：这是现在完成时态，表示从过去某个时间开始一直持续到现在的动作或状态。\n- `so why shouldn’t we?`：这是一个反问句，用来表达对比和疑问。\n\n**5. 知识点总结**\n\n- 现在时态的使用：表示客观事实。\n- 现在完成时的使用：表示从过去某个时间开始一直持续到现在的动作或状态。\n- 反问句的构造和使用：反问句用来表达一种强烈的感情，或者对某种情况的质疑。\n\n**6. 练习相似句子**\n\n\"The historical record shows that civilizations have risen and fallen over thousands of years—so why shouldn't ours?\"\n\n\"历史记录表明，文明在数千年的时间里兴盛和衰落——那么我们的文明为什么不能呢？\""},{"text":"Take a broader look at our species’ place in the universe, and it becomes clear that we have an excellent chance of surviving for tens, if not hundreds, of thousands of years.","explainMd":"**1. 翻译**\n\n\"从更宽广的角度看待我们物种在宇宙中的位置，我们可以清楚地看到，我们有极大的可能性能够存活数十万年，甚至几百万年。\"\n\n**2. 词汇和短语**\n\n- `Take a broader look at`：从更宽广的角度看待\n- `our species’ place in the universe`：我们物种在宇宙中的位置\n- `it becomes clear`：可以清楚地看到\n- `that we have an excellent chance of surviving`：我们有极大的可能性能够存活\n- `for tens, if not hundreds, of thousands of years`：数十万年，甚至几百万年\n\n**3. 句子结构**\n\n这是一个复合句，主句是\"it becomes clear that we have an excellent chance of surviving for tens, if not hundreds, of thousands of years\"，并且这句话的开始部分\"Take a broader look at our species’ place in the universe,\"是一个独立的短语，作为对主句的修饰。\n\n**4. 语法**\n\n- `Take a broader look at`：这是一个命令句式的短语，用来引导读者从一个更宽广的角度去看待一个问题。\n- `it becomes clear`：这是一个系表结构，\"becomes\"是系动词，\"clear\"是形容词作表语，表示主语\"it\"的状态。\n- `that we have an excellent chance of surviving`：这是一个由\"that\"引导的宾语从句，用来进一步说明主句中的\"becomes clear\"。\n\n**5. 知识点总结**\n\n- 命令句式的短语的使用：在句子中用作引导，带领读者从一个特定的角度去考虑问题。\n- 系表结构的使用：系动词后跟形容词作表语，用来表示主语的状态或特征。\n- 宾语从句的使用：\"that\"引导的宾语从句，用来进一步说明主句中的内容。\n\n**6. 练习相似句子**\n\n\"Take a deeper look at our society's development, and it becomes obvious that we have made remarkable progress in the past century.\"\n\n\"从更深入的角度看待我们社会的发展，我们可以清楚地看到，我们在过去的一个世纪里取得了显著的进步。\""},{"text":"Look up Homo sapiens in the “Red List” of threatened species of the International Union for the Conversation of Nature (IUCN) and you will read: “Listed as Least Concern as the species is very widely distributed, adaptable, currently increasing, and there are no major threats resulting in an overall population decline.”","explainMd":"**1. 翻译**\n\n\"在国际自然保护联盟（IUCN）的“红色名录”中查找智人，你会看到：“被列为最不受关注，因为该物种分布广泛，适应性强，当前正在增长，并且没有导致整体人口下降的主要威胁。”\"\n\n**2. 词汇和短语**\n\n- `Look up`：查找\n- `Homo sapiens`：智人\n- `in the “Red List” of threatened species of the International Union for the Conservation of Nature (IUCN)`：在国际自然保护联盟（IUCN）的“红色名录”中\n- `you will read`：你会看到\n- `Listed as Least Concern`：被列为最不受关注\n- `the species is very widely distributed, adaptable, currently increasing`：该物种分布广泛，适应性强，当前正在增长\n- `and there are no major threats resulting in an overall population decline`：并且没有导致整体人口下降的主要威胁\n\n**3. 句子结构**\n\n这是一个复合句。主句是\"Look up Homo sapiens in the “Red List” of threatened species of the International Union for the Conservation of Nature (IUCN) and you will read\"。之后的部分是引述内容，列出了智人在IUCN红色名录中的描述。\n\n**4. 语法**\n\n- `Look up`：这是一个动词短语，表示查找的动作。\n- `in the “Red List” of threatened species`：这是一个介词短语，表示在哪里进行查找。\n- `you will read`：这是一个一般将来时的动词结构，表示你将会看到的结果。\n\n**5. 知识点总结**\n\n- 动词短语的使用：例如 \"look up\"，表示查找的动作。\n- 介词短语的使用：例如 \"in the “Red List” of threatened species\"，表示在哪里进行查找。\n- 一般将来时的使用：例如 \"you will read\"，表示将要发生的动作或状态。\n\n**6. 练习相似句子**\n\n\"Look up the Great Wall in the World Heritage List of the United Nations Educational, Scientific and Cultural Organization (UNESCO) and you will read: 'Listed as a World Heritage Site due to its outstanding universal value and the testimony it provides of the architectural and technological achievements of ancient China.'\"\n\n\"在联合国教科文组织（UNESCO）的世界遗产名录中查找长城，你会看到：“因其卓越的普世价值和它为古代中国的建筑和技术成就提供的证明，被列为世界遗产。”\""}]},{"sentences":[{"text":"So what does our deep future hold?","explainMd":"**1. 翻译**\n\n\"那么，我们深远的未来会是怎样的呢？\"\n\n**2. 词汇和短语**\n\n- `So`：那么，用于引导问题或总结。\n- `what does our deep future hold?`：我们深远的未来会是怎样的呢？这是一个疑问句，用于询问未来的情况。\n\n**3. 句子结构**\n\n这是一个简单的疑问句，主要包含了一个主语（`our deep future`）和一个谓语（`does hold`）。\n\n**4. 语法**\n\n- `So`：这是一个副词，用于引导问题或总结。\n- `what does our deep future hold?`：这是一个特殊疑问句，`what` 是疑问词，`does hold` 是谓语动词。\n\n**5. 知识点总结**\n\n- 使用`so`作为副词引导问题或总结。\n- 特殊疑问句的构造和使用：特殊疑问句以疑问词开头，用来询问特定的信息。\n\n**6. 练习相似句子**\n\n\"So what does the future of technology look like?\"\n\n\"那么，科技的未来会是怎样的呢？\""},{"text":"A growing number of researchers and organisations are now thinking seriously about that question.","explainMd":"**1. 翻译**\n\n\"越来越多的研究者和组织现在正在认真地思考这个问题。\"\n\n**2. 词汇和短语**\n\n- `A growing number of`：越来越多的\n- `researchers and organisations`：研究者和组织\n- `are now thinking seriously`：现在正在认真地思考\n- `about that question`：关于这个问题\n\n**3. 句子结构**\n\n这是一个简单句，包含一个主语（`A growing number of researchers and organisations`）和一个谓语（`are now thinking seriously about that question`）。\n\n**4. 语法**\n\n- `A growing number of`：这是一个表示数量递增的表达方式。\n- `are now thinking seriously`：这是一个现在进行时的谓语动词短语，表示正在进行的动作。\n\n**5. 知识点总结**\n\n- 表示数量递增的表达方式：例如 \"A growing number of\"。\n- 现在进行时的使用：例如 \"are now thinking seriously\"，表示正在进行的动作。\n\n**6. 练习相似句子**\n\n\"A growing number of scientists and institutions are now focusing intensely on this issue.\"\n\n\"越来越多的科学家和机构现在正在集中关注这个问题。\""},{"text":"For example, the Long Now Foundation has as its flagship project a mechanical clock that is designed to still be marking time thousands of years hence.","explainMd":"**1. 翻译**\n\n\"例如，Long Now 基金会的标志性项目是一座机械钟，它被设计成能够在几千年后仍然标记时间。\"\n\n**2. 词汇和短语**\n\n- `For example`：例如\n- `the Long Now Foundation`：Long Now基金会\n- `has as its flagship project`：有一个标志性的项目\n- `a mechanical clock`：一座机械钟\n- `that is designed to`：被设计成\n- `still be marking time`：仍然标记时间\n- `thousands of years hence`：几千年后\n\n**3. 句子结构**\n\n这是一个复杂句，主句是\"the Long Now Foundation has as its flagship project a mechanical clock\"，后面的\"that is designed to still be marking time thousands of years hence\"是一个定语从句，用来修饰\"mechanical clock\"。\n\n**4. 语法**\n\n- `For example`：这是一个副词短语，用于引出例子。\n- `has as its flagship project`：这是一个表示具有某种特性的表达方式。\n- `that is designed to`：这是一个被动语态的结构，表示\"被设计成\"。\n- `still be marking time`：这是一个现在进行时的表达方式，表示持续的动作。\n- `thousands of years hence`：这是一个表示未来时间的短语。\n\n**5. 知识点总结**\n\n- 使用`for example`引出例子。\n- 表示具有某种特性的表达方式。\n- 被动语态的使用。\n- 现在进行时的使用，表示持续的动作。\n- 表示未来时间的短语的使用。\n\n**6. 练习相似句子**\n\n\"For example, the World Wildlife Fund has as its flagship project a global conservation initiative that is designed to still be protecting endangered species hundreds of years from now.\"\n\n\"例如，世界野生动物基金会的标志性项目是一项全球保护计划，被设计成在几百年后仍然保护濒危物种。\""}]},{"sentences":[{"text":"Perhaps willfully, it may be easier to think about such lengthy timescales than about the more immediate future.","explainMd":"**1. 翻译**\n\n\"也许是故意的，想象如此漫长的时间尺度可能比考虑更即刻的未来要容易一些。\"\n\n**2. 词汇和短语**\n\n- `Perhaps willfully`：也许是故意的\n- `it may be easier to`：可能更容易\n- `think about such lengthy timescales`：考虑如此漫长的时间尺度\n- `than about the more immediate future`：而不是更即刻的未来\n\n**3. 句子结构**\n\n这是一个比较句，主要包含了两个部分，即 \"it may be easier to think about such lengthy timescales\" 和 \"than about the more immediate future\"，它们之间用 \"than\" 连接，表示比较。\n\n**4. 语法**\n\n- `Perhaps willfully`：这是一个副词短语，表示可能的情况或态度。\n- `it may be easier to`：这是一个可能性表达，表示可能更容易去做某事。\n- `think about such lengthy timescales`：这是一个动词短语，表示考虑的动作。\n- `than about the more immediate future`：这是一个比较结构，表示与 \"think about such lengthy timescales\" 的比较。\n\n**5. 知识点总结**\n\n- 副词短语的使用：表示可能的情况或态度。\n- 可能性表达的使用：表示可能更容易去做某事。\n- 动词短语的使用：表示考虑的动作。\n- 比较结构的使用：表示两个事物或情况的比较。\n\n**6. 练习相似句子**\n\n\"Perhaps surprisingly, it may be easier to grasp complex scientific theories than understand human emotions.\"\n\n\"也许令人惊讶，理解复杂的科学理论可能比理解人类的情感要容易一些。\""},{"text":"The potential evolution of today’s technology, and its social consequences, is dazzlingly complicated, and it’s perhaps best left to science fiction writers and futurologists to explore the many possibilities we can envisage.","explainMd":"**1. 翻译**\n\n\"今天的技术可能会有的演变和其社会后果极其复杂，可能最好交给科幻作家和未来学家去探索我们能想象的各种可能性。\"\n\n**2. 词汇和短语**\n\n- `The potential evolution of today’s technology`：今天的技术可能会有的演变\n- `and its social consequences`：和其社会后果\n- `is dazzlingly complicated`：极其复杂\n- `and it’s perhaps best left to`：可能最好交给\n- `science fiction writers and futurologists`：科幻作家和未来学家\n- `to explore the many possibilities we can envisage`：去探索我们能想象的各种可能性\n\n**3. 句子结构**\n\n这是一个复合句子。首先，\"The potential evolution of today’s technology, and its social consequences, is dazzlingly complicated\" 是一个主句。然后 \"it’s perhaps best left to science fiction writers and futurologists to explore the many possibilities we can envisage\" 作为并列的另一个主句。\n\n**4. 语法**\n\n- `The potential evolution of today’s technology and its social consequences`：这是一个主语，两个名词短语通过并列连词 \"and\" 连接。\n- `is dazzlingly complicated`：这是谓语部分，\"is\" 是系动词，\"dazzlingly complicated\" 是形容词短语作表语，描述主语的特征。\n- `it’s perhaps best left to`：这是一个被动语态的表达方式，表示把某个任务交给别人去做。\n- `science fiction writers and futurologists`：这是一个并列的名词短语，作为被动语态动词 \"left\" 的宾语。\n- `to explore the many possibilities we can envisage`：这是一个不定式短语，作为目的状语，表明 \"leave\" 的目的。\n\n**5. 知识点总结**\n\n- 名词短语的并列使用：两个名词短语通过并列连词 \"and\" 连接，作为主语。\n- 形容词短语作表语：描述主语的特征。\n- 被动语态的使用：表示把某个任务交给别人去做。\n- 不定式短语作目的状语：表明动作的目的。\n\n**6. 练习相似句子**\n\n\"The potential impact of climate change and its environmental consequences is incredibly complex, and it’s perhaps best left to environmental scientists and researchers to examine the many scenarios we can predict.\"\n\n\"气候变化可能会有的影响和其环境后果极其复杂，可能最好交给环境科学家和研究人员去检验我们能预测的各种情况。\""},{"text":"That’s one reason why we have launched Arc, a new publication dedicated to the near future.","explainMd":"**1. 翻译**\n\n\"这就是我们为什么推出Arc的一个原因，这是一份致力于近期未来的新出版物。\"\n\n**2. 词汇和短语**\n\n- `That’s one reason why`：这就是为什么\n- `we have launched`：我们推出了\n- `Arc`：Arc（特指这里的出版物）\n- `a new publication`：新的出版物\n- `dedicated to the near future`：致力于近期未来\n\n**3. 句子结构**\n\n这是一个简单句，主要包含一个主语（`That`）和一个谓语（`is one reason why we have launched Arc, a new publication dedicated to the near future`）。\n\n**4. 语法**\n\n- `That’s one reason why`：这是一个引导原因状语从句的连接词。\n- `we have launched`：这是一个现在完成时态的动词短语，表示已经完成的动作。\n- `Arc, a new publication dedicated to the near future`：这是一个带有同位语的名词短语，\"a new publication dedicated to the near future\" 对 \"Arc\" 进行解释。\n\n**5. 知识点总结**\n\n- 引导原因状语从句的连接词的使用。\n- 现在完成时态的使用，表示已经完成的动作。\n- 同位语的使用，对名词进行解释或补充。\n\n**6. 练习相似句子**\n\n\"That's one reason why we have established Green Planet, a new initiative dedicated to environmental protection.\"\n\n\"这就是我们为什么建立了Green Planet的一个原因，这是一个致力于环境保护的新倡议。\""}]},{"sentences":[{"text":"But take a longer view and there is a surprising amount that we can say with considerable assurance.","explainMd":"**1. 翻译**\n\n\"但是，从长远来看，我们可以以相当的确定性说出很多令人惊讶的事情。\"\n\n**2. 词汇和短语**\n\n- `But take a longer view`：但是，从长远来看\n- `and there is a surprising amount`：存在很多令人惊讶的事情\n- `that we can say`：我们可以说出\n- `with considerable assurance`：以相当的确定性\n\n**3. 句子结构**\n\n这是一个并列句，包括两个部分，即 \"take a longer view\" 和 \"there is a surprising amount that we can say with considerable assurance\"，它们之间用 \"and\" 连接。\n\n**4. 语法**\n\n- `But take a longer view`：这是一个祈使句，用于表达建议或命令。\n- `and there is a surprising amount`：这是一个存在句的主句部分，表示有某种事物存在。\n- `that we can say`：这是一个定语从句，用来修饰 \"a surprising amount\"。\n- `with considerable assurance`：这是一个介词短语，用来修饰动词 \"say\"，表示说话的方式或态度。\n\n**5. 知识点总结**\n\n- 祈使句的使用：用于表达建议或命令。\n- 存在句的构造和使用：表示有某种事物存在。\n- 定语从句的使用：修饰名词，提供更多信息。\n- 介词短语的使用：修饰动词，表示动作的方式或态度。\n\n**6. 练习相似句子**\n\n\"But take a broader perspective and there is a surprising amount of diversity that we can observe with considerable confidence.\"\n\n\"但是，从更广阔的角度来看，我们可以以相当的确定性观察到很多令人惊讶的多样性。\""},{"text":"As so often, the past holds the key to the future: we have now identified enough of the long-term patterns shaping the history of the planet, and our species, to make evidence-based forecasts about the situations in which our descendants will find themselves.","explainMd":"**1. 翻译**\n\n\"正如往常一样，过去握住了未来的钥匙：我们现在已经识别出了足够多的影响地球和我们种族历史的长期模式，以便根据证据对我们的后代所处的情况做出预测。\"\n\n**2. 词汇和短语**\n\n- `As so often`：正如往常一样\n- `the past holds the key to the future`：过去握住了未来的钥匙\n- `we have now identified enough`：我们现在已经识别出了足够多的\n- `of the long-term patterns shaping the history of the planet, and our species`：影响地球和我们种族历史的长期模式\n- `to make evidence-based forecasts about`：以便根据证据对...做出预测\n- `the situations in which our descendants will find themselves`：我们的后代所处的情况\n\n**3. 句子结构**\n\n这是一个复杂句。主句是 \"the past holds the key to the future\"，然后 \"we have now identified enough of the long-term patterns shaping the history of the planet, and our species\" 是一个并列句，最后 \"to make evidence-based forecasts about the situations in which our descendants will find themselves\" 是一个不定式短语，用来表示目的。\n\n**4. 语法**\n\n- `As so often`：这是一个引导方式状语的短语，表示情况通常如此。\n- `the past holds the key to the future`：这是一个主句，其中 \"holds the key to\" 是一个固定搭配，表示 \"握有...的关键\"。\n- `we have now identified enough`：这是一个现在完成时的谓语短语，表示已经完成的动作。\n- `of the long-term patterns shaping the history of the planet, and our species`：这是一个介词短语，用来修饰 \"enough\"。\n- `to make evidence-based forecasts about`：这是一个不定式短语，用来表示目的。\n\n**5. 知识点总结**\n\n- 引导方式状语的短语的使用：表示情况通常如此。\n- 固定搭配的使用：例如 \"holds the key to\"，表示 \"握有...的关键\"。\n- 现在完成时的使用：表示已经完成的动作。\n- 介词短语的使用：修饰名词或代词，提供更多信息。\n- 不定式短语的使用：表示目的。\n\n**6. 练习相似句子**\n\n\"As so often, experience forms the basis for wisdom: we have now gathered enough of the life lessons to make informed decisions about the paths our lives will take.\"\n\n\"正如往常一样，经验构成了智慧的基础：我们现在已经汲取了足够多的生活教训，以便根据信息对我们生活的道路做出决定。\""}]},{"sentences":[{"text":"This long perspective makes the pessimistic view of our prospects seem more likely to be a passing fad.","explainMd":"**1. 翻译**\n\n\"这种长远的视角使我们对未来的悲观看法更像是一种昙花一现的潮流。\"\n\n**2. 词汇和短语**\n\n- `This long perspective`：这种长远的视角\n- `makes`：使得\n- `the pessimistic view of our prospects`：我们对未来的悲观看法\n- `seem more likely to be`：更像是\n- `a passing fad`：一种昙花一现的潮流\n\n**3. 句子结构**\n\n这是一个简单句，主语是 \"This long perspective\"，谓语是 \"makes the pessimistic view of our prospects seem more likely to be a passing fad\"。\n\n**4. 语法**\n\n- `This long perspective`：这是一个代词+形容词+名词构成的名词短语，作为主语。\n- `makes`：这是一个使役动词，后面接宾语和宾语补足语，构成 \"make...seem...\" 结构，表示使...看起来像...。\n- `the pessimistic view of our prospects`：这是一个名词短语，作为 \"makes\" 的宾语。\n- `seem more likely to be`：这是一个 \"seem + to be\" 结构，作为宾语补足语，用来描述宾语的特性。\n- `a passing fad`：这是一个名词短语，作为 \"to be\" 的宾语。\n\n**5. 知识点总结**\n\n- 代词+形容词+名词构成的名词短语的使用：作为主语。\n- 使役动词 \"make\" 的使用：后面接宾语和宾语补足语，构成 \"make...seem...\" 结构。\n- \"seem + to be\" 结构的使用：作为宾语补足语，用来描述宾语的特性。\n\n**6. 练习相似句子**\n\n\"This global perspective makes the negative impacts of climate change seem more likely to be a universal concern.\"\n\n\"这种全球视角使得气候变化的负面影响更像是一种全球关注的问题。\""},{"text":"To be sure, the future is not all rosy.","explainMd":"**1. 翻译**\n\n\"可以肯定的是，未来并非都是美好的。\"\n\n**2. 词汇和短语**\n\n- `To be sure`：可以肯定的是\n- `the future`：未来\n- `is not all rosy`：并非都是美好的\n\n**3. 句子结构**\n\n这是一个简单句，主语是 \"the future\"，谓语是 \"is not all rosy\"。同时，句首的 \"To be sure\" 是一个插入语，用于强调或者解释。\n\n**4. 语法**\n\n- `To be sure`：这是一个插入语，用于强调或者解释，它不参与句子的主谓结构。\n- `the future`：这是一个名词，用作主语。\n- `is not all rosy`：这是一个系动词结构（be + 形容词），用于描述主语的状态或特征。\n\n**5. 知识点总结**\n\n- 插入语的使用：用于强调或者解释，它不参与句子的主谓结构。\n- 系动词结构的使用：be + 形容词，用于描述主语的状态或特征。\n\n**6. 练习相似句子**\n\n\"To be sure, the path to success is not all smooth.\"\n\n\"可以肯定的是，成功的道路并非都是坦途。\""},{"text":"But we are now knowledgeable enough to reduce many of the risks that threatened the existence of earlier humans, and to improve the lot of those to come.","explainMd":"**1. 翻译**\n\n\"但是，我们现在已经足够知识渊博，可以减少许多威胁到早期人类生存的风险，并改善未来人们的生活条件。\"\n\n**2. 词汇和短语**\n\n- `But we are now knowledgeable enough`：但是，我们现在已经足够知识渊博\n- `to reduce many of the risks`：可以减少许多风险\n- `that threatened the existence of earlier humans`：威胁到早期人类生存的\n- `and to improve the lot of those to come`：并改善未来人们的生活条件\n\n**3. 句子结构**\n\n这是一个复合句，主要包含了两个部分，即 \"we are now knowledgeable enough to reduce many of the risks that threatened the existence of earlier humans\" 和 \"to improve the lot of those to come\"，它们之间用 \"and\" 连接，表示并列关系。\n\n**4. 语法**\n\n- `But we are now knowledgeable enough`：这是一个主句，其中 \"we are now knowledgeable enough\" 是现在时态的谓语结构。\n- `to reduce many of the risks`：这是一个不定式短语，作为目的状语，说明 \"we are now knowledgeable enough\" 的目的。\n- `that threatened the existence of earlier humans`：这是一个定语从句，用来修饰 \"the risks\"，指出是哪些风险。\n- `and to improve the lot of those to come`：这是另一个不定式短语，作为目的状语，说明改善的目标。\n\n**5. 知识点总结**\n\n- 现在时态的谓语结构的使用：用来描述当前的状态。\n- 不定式短语作目的状语的使用：说明动作的目的。\n- 定语从句的使用：修饰名词，提供更多信息。\n\n**6. 练习相似句子**\n\n\"But we are now experienced enough to overcome many of the challenges that hindered the development of earlier societies, and to enhance the quality of life for future generations.\"\n\n\"但是，我们现在已经足够经验丰富，可以克服许多阻碍早期社会发展的挑战，并提高未来几代人的生活质量。\""}]}],"title":""}