{"translate":"","paragraphs":[{"sentences":[{"text":"“The Heart of the Matter,” the just-released report by the American Academy of Arts and Sciences (AAAS), deserves praise for affirming the importance of the humanities and social sciences to the prosperity and security of liberal democracy in America.","explainMd":"**1. 翻译**\n\n\"美国艺术与科学学会（AAAS）刚刚发布的报告《问题的核心》为肯定人文与社会科学对美国自由民主繁荣和安全的重要性而值得赞扬。\"\n\n**2. 词汇和短语**\n\n- `The Heart of the Matter`：《问题的核心》，这是该报告的名称。\n- `the just-released report`：刚刚发布的报告，\"just-released\" 是形容词，表示刚刚发布的。\n- `by the American Academy of Arts and Sciences (AAAS)`：由美国艺术与科学学会（AAAS）发布，\"by\" 是介词，表示由...完成或发布。\n- `deserves praise`：值得赞扬，\"deserves\" 是动词，表示应得或值得，\"praise\" 是名词，表示赞扬。\n- `for affirming the importance of the humanities and social sciences`：为了肯定人文和社会科学的重要性，\"for\" 是介词，表示原因或目的，\"affirming\" 是动词，表示肯定的行为。\n- `to the prosperity and security of liberal democracy in America`：对美国自由民主的繁荣和安全，\"to\" 是介词，表示目标或方向。\n\n**3. 句子结构**\n\n这是一个复合句，主句是 \"The Heart of the Matter, the just-released report by the American Academy of Arts and Sciences (AAAS), deserves praise\"，原因状语从句是 \"for affirming the importance of the humanities and social sciences to the prosperity and security of liberal democracy in America\"。\n\n**4. 语法**\n\n- `The Heart of the Matter`：这是一个名词短语，表示特定的报告名称。\n- `the just-released report`：这是一个形容词 + 名词的结构，表示特定的报告。\n- `by the American Academy of Arts and Sciences (AAAS)`：这是一个表示完成或发布动作的介词短语。\n- `deserves praise`：这是一个动词 + 宾语的结构，表示应得的赞扬。\n- `for affirming the importance of the humanities and social sciences`：这是一个表示原因或目的的介词短语。\n- `to the prosperity and security of liberal democracy in America`：这是一个表示目标或方向的介词短语。\n\n**5. 知识点总结**\n\n- **名词短语的使用**：如 \"The Heart of the Matter\"，表示特定的报告名称。\n- **形容词 + 名词的结构**：如 \"the just-released report\"，表示特定的报告。\n- **介词短语的使用**：如 \"by the American Academy of Arts and Sciences (AAAS)\"，表示完成或发布动作；\"for affirming the importance of the humanities and social sciences\"，表示原因或目的；\"to the prosperity and security of liberal democracy in America\"，表示目标或方向。\n- **动词 + 宾语的结构**：如 \"deserves praise\"，表示应得的赞扬。\n\n**6. 练习相似句子**\n\n\"The New Horizon, the newly published book by the National Literature Association, deserves recognition for highlighting the importance of literature to the growth and development of society.\"\n\n\"《新地平线》，国家文学协会新出版的书籍，因强调文学对社会增长和发展的重要性而值得认可。\""},{"text":"Regrettably, however, the report’s failure to address the true nature of the crisis facing liberal education may cause more harm than good.","explainMd":"**1. 翻译**\n\n\"然而，令人遗憾的是，这份报告未能解决自由教育面临的危机的真正性质，可能带来的危害大于益处。\"\n\n**2. 词汇和短语**\n\n- `Regrettably`：然而，令人遗憾的是，用于引出不好的事实或情况。\n- `however`：然而，用于引出对比或转折。\n- `the report’s failure to address`：报告未能解决，\"failure to\" 表示未能做到的事情。\n- `the true nature of the crisis facing liberal education`：自由教育面临的危机的真正性质，\"the true nature of\" 表示...的真正性质，\"crisis facing\" 表示面临的危机。\n- `may cause more harm than good`：可能带来的危害大于益处，\"may cause\" 表示可能导致的结果，\"more...than\" 表示比较级，表示程度的比较。\n\n**3. 句子结构**\n\n这是一个简单句，句子的主语是 \"the report’s failure to address the true nature of the crisis facing liberal education\"，谓语是 \"may cause more harm than good\"，转折状语是 \"Regrettably, however\"。\n\n**4. 语法**\n\n- `Regrettably`：这是一个副词，用于引出不好的事实或情况。\n- `however`：这是一个转折连词，用于引出对比或转折。\n- `the report’s failure to address`：这是一个名词短语，表示未能做到的事情。\n- `the true nature of the crisis facing liberal education`：这是一个名词短语，表示特定的性质和危机。\n- `may cause more harm than good`：这是一个模态动词 + 动词 + 比较级的结构，表示可能的结果和程度的比较。\n\n**5. 知识点总结**\n\n- **副词的使用**：如 \"Regrettably\"，用于引出不好的事实或情况。\n- **转折连词的使用**：如 \"however\"，用于引出对比或转折。\n- **名词短语的使用**：如 \"the report’s failure to address\" 和 \"the true nature of the crisis facing liberal education\"，表示特定的事情和性质。\n- **模态动词 + 动词 + 比较级的结构的使用**：如 \"may cause more harm than good\"，表示可能的结果和程度的比较。\n\n**6. 练习相似句子**\n\n\"Unfortunately, however, the plan's inability to address the real issues of climate change might result in more negative effects than positive ones.\"\n\n\"然而，遗憾的是，该计划未能解决气候变化的真正问题，可能带来的负面影响大于正面影响。\""}]},{"sentences":[{"text":"In 2010, leading congressional Democrats and Republicans sent letters to the AAAS asking that it identify actions that could be taken by “federal, state and local governments, universities, foundations, educators, individual benefactors and others” to “maintain national excellence in humanities and social scientific scholarship and education.” In response, the American Academy formed the Commission on the Humanities and Social Sciences.","explainMd":"**1. 翻译**\n\n\"2010年，主要的国会民主党员和共和党员致信给美国艺术与科学学会（AAAS），要求其确定“联邦、州和地方政府、大学、基金会、教育者、个人捐赠者和其他人”可以采取的行动，以“保持人文和社会科学学术和教育的国家优秀水平”。作为回应，美国学会成立了人文和社会科学委员会。\"\n\n**2. 词汇和短语**\n\n- `In 2010`：在2010年，表示时间的介词短语。\n- `leading congressional Democrats and Republicans`：主要的国会民主党员和共和党员，\"leading\" 是形容词，表示主导或领先的。\n- `sent letters to the AAAS`：给美国艺术与科学学会（AAAS）发信，\"sent letters to\" 是动词短语，表示发信的行为。\n- `asking that it identify actions`：要求其确定行动，\"asking that\" 是表示要求的动词短语，\"identify\" 是动词，表示确定或识别的行动。\n- `that could be taken by`：可以由...采取，\"could be taken by\" 是被动语态的动词短语，表示可能被...采取的行动。\n- `to “maintain national excellence in humanities and social scientific scholarship and education.”`：以“保持人文和社会科学学术和教育的国家优秀水平”，\"maintain\" 是动词，表示保持的行为，\"national excellence in humanities and social scientific scholarship and education\" 是宾语，表示要保持的目标。\n- `In response`：作为回应，表示回应的短语。\n- `the American Academy formed the Commission on the Humanities and Social Sciences`：美国学会成立了人文和社会科学委员会，\"formed\" 是动词，表示成立的行为。\n\n**3. 句子结构**\n\n这是一个复合句，主句是 \"In 2010, leading congressional Democrats and Republicans sent letters to the AAAS asking that it identify actions that could be taken by “federal, state and local governments, universities, foundations, educators, individual benefactors and others” to “maintain national excellence in humanities and social scientific scholarship and education.”\"，状语从句是 \"In response, the American Academy formed the Commission on the Humanities and Social Sciences.\"\n\n**4. 语法**\n\n- `In 2010`：这是一个表示时间的介词短语。\n- `leading congressional Democrats and Republicans`：这是一个形容词 + 名词的结构，表示特定的人。\n- `sent letters to the AAAS`：这是一个动词 + 宾语 + 介词短语的结构，表示发信的行为。\n- `asking that it identify actions`：这是一个表示要求的动词 + 宾语从句的结构。\n- `that could be taken by`：这是一个表示可能性的从句。\n- `to “maintain national excellence in humanities and social scientific scholarship and education.”`：这是一个表示目的的不定式短语。\n- `In response`：这是一个表示回应的短语。\n- `the American Academy formed the Commission on the Humanities and Social Sciences`：这是一个主语 + 动词 + 宾语的结构，表示成立的行为。\n\n**5. 知识点总结**\n\n- **表示时间的介词短语的使用**：如 \"In 2010\"。\n- **形容词 + 名词的结构的使用**：如 \"leading congressional Democrats and Republicans\"。\n- **动词 + 宾语 + 介词短语的结构的使用**：如 \"sent letters to the AAAS\"。\n- **表示要求的动词 + 宾语从句的结构的使用**：如 \"asking that it identify actions\"。\n- **表示可能性的从句的使用**：如 \"that could be taken by\"。\n- **表示目的的不定式短语的使用**：如 \"to 'maintain national excellence in humanities and social scientific scholarship and education.'\"\n- **表示回应的短语的使用**：如 \"In response\"。\n- **主语 + 动词 + 宾语的结构的使用**：如 \"the American Academy formed the Commission on the Humanities and Social Sciences\"。\n\n**6. 练习相似句子**\n\n\"In 2015, major technology companies sent a proposal to the government, asking that it identify measures that could be taken by \"federal, state and local governments, universities, foundations, educators, individual benefactors and others\" to \"promote national excellence in technology education and innovation.\" In response, the government established the Technology Education and Innovation Committee.\"\n\n\"2015年，主要的科技公司向政府提交了一个提案，要求其确定“联邦、州和地方政府、大学、基金会、教育者、个人捐赠者和其他人”可以采取的措施，以“推动国家在科技教育和创新方面的卓越”。作为回应，政府成立了科技教育和创新委员会。\""},{"text":"Among the commission’s 51 members are top-tier-university presidents, scholars, lawyers, judges, and business executives, as well as prominent figures from diplomacy, filmmaking, music and journalism.","explainMd":"**1. 翻译**\n\n\"该委员会的51名成员中包括一流大学的校长、学者、律师、法官和商业高管，以及来自外交、电影制作、音乐和新闻界的知名人士。\"\n\n**2. 词汇和短语**\n\n- `Among the commission’s 51 members`：在委员会的51名成员中，\"among\" 是介词，表示在一组或多个人或事物中。\n- `are top-tier-university presidents, scholars, lawyers, judges, and business executives`：是一流大学的校长、学者、律师、法官和商业高管，\"are\" 是动词，表示是，后面接的是一系列的职业或角色。\n- `as well as prominent figures from diplomacy, filmmaking, music and journalism`：以及来自外交、电影制作、音乐和新闻界的知名人士，\"as well as\" 是连接词，表示并且或以及，\"prominent figures\" 表示知名人士。\n\n**3. 句子结构**\n\n这是一个简单句，句子的主语是 \"the commission’s 51 members\"，谓语是 \"are top-tier-university presidents, scholars, lawyers, judges, and business executives, as well as prominent figures from diplomacy, filmmaking, music and journalism\"。\n\n**4. 语法**\n\n- `Among the commission’s 51 members`：这是一个介词短语，表示在一组或多个人或事物中。\n- `are top-tier-university presidents, scholars, lawyers, judges, and business executives`：这是一个动词 + 宾语的结构，表示是的行为。\n- `as well as prominent figures from diplomacy, filmmaking, music and journalism`：这是一个并列连词短语，表示并且或以及的关系。\n\n**5. 知识点总结**\n\n- **介词短语的使用**：如 \"Among the commission’s 51 members\"，表示在一组或多个人或事物中的位置关系。\n- **动词 + 宾语的结构的使用**：如 \"are top-tier-university presidents, scholars, lawyers, judges, and business executives\"，表示是的行为。\n- **并列连词短语的使用**：如 \"as well as prominent figures from diplomacy, filmmaking, music and journalism\"，表示并且或以及的关系。\n\n**6. 练习相似句子**\n\n\"Among the team's 20 players are world-class athletes, trainers, and coaches, as well as prominent figures from sports media and marketing.\"\n\n\"球队的20名球员中包括世界级的运动员、教练和教练，以及来自体育媒体和营销界的知名人士。\""}]},{"sentences":[{"text":"The goals identified in the report are generally admirable.","explainMd":"**1. 翻译**\n\n\"报告中确定的目标一般来说都是令人钦佩的。\"\n\n**2. 词汇和短语**\n\n- `The goals`：目标，\"goals\" 是复数名词，表示目标或目的。\n- `identified in the report`：在报告中确定的，\"identified\" 是动词过去分词，表示确定或识别的行为，\"in the report\" 是介词短语，表示位置或范围。\n- `are generally admirable`：一般来说都是令人钦佩的，\"are\" 是动词，表示是，\"generally\" 是副词，表示一般或通常，\"admirable\" 是形容词，表示令人钦佩或赞赏的。\n\n**3. 句子结构**\n\n这是一个简单句，句子的主语是 \"The goals identified in the report\"，谓语是 \"are generally admirable\"。\n\n**4. 语法**\n\n- `The goals`：这是一个名词短语，表示特定的目标。\n- `identified in the report`：这是一个被动语态的动词短语，表示被确定或识别的行为。\n- `are generally admirable`：这是一个动词 + 副词 + 形容词的结构，表示是的行为和一般的程度。\n\n**5. 知识点总结**\n\n- **名词短语的使用**：如 \"The goals\"，表示特定的目标。\n- **被动语态的动词短语的使用**：如 \"identified in the report\"，表示被确定或识别的行为。\n- **动词 + 副词 + 形容词的结构的使用**：如 \"are generally admirable\"，表示是的行为和一般的程度。\n\n**6. 练习相似句子**\n\n\"The strategies outlined in the plan are generally efficient.\"\n\n\"计划中概述的策略一般来说都是有效的。\""},{"text":"Because representative government presupposes an informed citizenry, the report supports full literacy; stresses the study of history and government, particularly American history and American government; and encourages the use of new digital technologies.","explainMd":"**1. 翻译**\n\n\"因为代议制政府需要有知情的公民，因此该报告支持全民识字；强调历史和政府的研究，特别是美国历史和美国政府；并鼓励使用新的数字技术。\"\n\n**2. 词汇和短语**\n\n- \"presupposes\" 是动词，表示预设或假设的行为。\n-\"supports\" 是动词，表示支持的行为，\"full literacy\" 是名词，表示全面的读写能力或识字。\n-\"stresses\" 是动词，表示强调的行为。\n-\"particularly\" 是副词，表示特别或尤其的意思。\n- \"encourages\" 是动词，表示鼓励的行为，\"the use of new digital technologies\" 是宾语，表示要鼓励的对象。\n\n**3. 句子结构**\n\n这是一个并列句，主句是 \"the report supports full literacy\"，并列句一是 \"stresses the study of history and government, particularly American history and American government\"，并列句二是 \"and encourages the use of new digital technologies\"，前置状语从句是 \"Because representative government presupposes an informed citizenry\"。\n\n**4. 语法**\n\n- `Because representative government presupposes an informed citizenry`：这是一个原因状语从句，表示因果关系。\n- `the report supports full literacy`：这是一个主谓宾结构的句子，表示支持的行为。\n- `stresses the study of history and government`：这是一个主谓宾结构的句子，表示强调的行为。\n- `particularly American history and American government`：这是一个副词修饰的结构，表示特别或尤其的意思。\n- `and encourages the use of new digital technologies`：这是一个并列连词连接的结构，表示并列关系。\n\n**5. 知识点总结**\n\n- **原因状语从句的使用**：如 \"Because representative government presupposes an informed citizenry\"，表示因果关系。\n- **主谓宾结构的使用**：如 \"the report supports full literacy\" 和 \"stresses the study of history and government\"，表示支持和强调的行为。\n- **副词修饰的结构的使用**：如 \"particularly American history and American government\"，表示特别或尤其的意思。\n- **并列连词连接的结构的使用**：如 \"and encourages the use of new digital technologies\"，表示并列关系。\n\n**6. 练习相似句子**\n\n\"Because a successful company requires efficient employees, the policy promotes continuous training; emphasizes the importance of skill development, particularly technical and communication skills; and encourages the adoption of advanced software tools.\"\n\n\"因为成功的公司需要高效的员工，所以这项政策推广持续的培训；强调技能发展的重要性，特别是技术和沟通技能；并鼓励采用先进的软件工具。\""},{"text":"To encourage innovation and competition, the report calls for increased investment in research, the crafting of coherent curricula that improve students’ ability to solve problems and communicate effectively in the 21st century, increased funding for teachers and the encouragement of scholars to bring their learning to bear on the great challenges of the day.","explainMd":"**1. 翻译**\n\n\"为了鼓励创新和竞争，报告呼吁增加对研究的投资，制定连贯的课程来提高学生在21世纪解决问题和有效沟通的能力，增加对教师的资助，鼓励学者将他们的知识用于应对当下的重大挑战。\"\n\n**2. 词汇和短语**\n\n- `encourage`：鼓励\n- `innovation and competition`：创新和竞争\n- `calls for`：呼吁\n- `increased investment`：增加投资\n- `crafting of coherent curricula`：制定连贯的课程\n- `improve students’ ability`：提高学生的能力\n- `increased funding for teachers`：增加对教师的资助\n- `encouragement of scholars`：鼓励学者\n- `bring their learning to bear on`：将他们的知识应用于...\n\n**3. 句子结构**\n\n这是一个复杂的句子，由一系列的并列句子构成，并以 \"To encourage innovation and competition\" 作为引导短语。这个句子可以被分解为以下几个部分：\n\n引导短语：\"To encourage innovation and competition\"，短语中的 \"to\" 是不定式，表示目的，而 \"encourage innovation and competition\" 是动词短语，作为不定式的补语。\n\n主句：\"the report calls for increased investment in research\"，这是一个标准的主谓宾结构，其中 \"the report\" 是主语，\"calls for\" 是谓语，\"increased investment in research\" 是宾语。\n\n并列句子一：\"the crafting of coherent curricula that improve students’ ability to solve problems and communicate effectively in the 21st century\"，这个句子的主干是 \"the crafting of coherent curricula\"，其中 \"the crafting of\" 是动名词短语，\"coherent curricula\" 是宾语。此外，\"that improve students’ ability to solve problems and communicate effectively in the 21st century\" 是一个定语从句，修饰 \"coherent curricula\"。\n\n并列句子二：\"increased funding for teachers\"，这是一个简单的名词短语。\n\n并列句子三：\"the encouragement of scholars to bring their learning to bear on the great challenges of the day\"，这个句子的主干是 \"the encouragement of scholars\"，其中 \"the encouragement of\" 是动名词短语，\"scholars\" 是宾语。另外，\"to bring their learning to bear on the great challenges of the day\" 是一个不定式短语，作为 \"scholars\" 的后置定语，描述了 \"scholars\" 的动作或状态。\n\n**4. 语法**\n\n这个句子使用了一些关键的语法结构，如并列句结构、动词短语（如 \"calls for\"）、名词短语（如 \"increased investment in research\"）以及非谓语动词结构（如 \"to improve students’ ability\"）。\n\n**5. 知识点总结**\n\n- **并列句结构**：用于连接两个或多个相关的思想或信息。\n- **动词短语**：如 \"calls for\"，用于表示特定的动作或行为。\n- **名词短语**：如 \"increased investment in research\"，提供具体的信息或细节。\n- **非谓语动词结构**：如 \"to improve students’ ability\"，用于表示目的或结果。\n\n**6. 练习相似句子**\n\n\"To promote creativity and teamwork, the organization advocates for increased investment in learning resources, the development of engaging activities that boost employees' problem-solving and communication skills, additional support for team leaders, and the motivation of team members to apply their knowledge to solve current business challenges.\"\n\n\"为了促进创造力和团队合作，该组织倡导增加对学习资源的投资，开展能提高员工解决问题和沟通技巧的吸引人的活动，为团队领导提供额外的支持，并激励团队成员将他们的知识应用到解决当前的商业挑战中。\""},{"text":"The report also advocates greater study of foreign languages, international affairs and the expansion of study abroad programs.","explainMd":"**1. 翻译**\n\n\"报告还倡导更多的外语学习、国际事务研究以及扩大留学项目。\"\n\n**2. 词汇和短语**\n\n- `The report`：报告，\"The report\" 指的是前文提到的报告。\n- `advocates`：倡导，\"advocates\" 是动词，表示支持或提倡的行为。\n- `greater study of foreign languages`：更多的外语学习，\"greater study\" 表示更多的学习，\"of foreign languages\" 表示外语的学习。\n- `international affairs`：国际事务，是一个名词短语。\n- `and the expansion of study abroad programs`：以及扩大留学项目，\"and\" 是连接词，\"the expansion of\" 表示扩大的行为，\"study abroad programs\" 表示留学项目。\n\n**3. 句子结构**\n\n这是一个简单句，句子的主语是 \"The report\"，谓语是 \"advocates greater study of foreign languages, international affairs and the expansion of study abroad programs\"。\n\n**4. 语法**\n\n- `The report`：这是一个名词短语，作为句子的主语。\n- `advocates`：这是一个动词，表示倡导的行为。\n- `greater study of foreign languages, international affairs and the expansion of study abroad programs`：这是一个并列的宾语，表示被倡导的事物。\n\n**5. 知识点总结**\n\n- **名词短语作为主语的使用**：如 \"The report\"，表示句子的主语。\n- **动词表示行为的使用**：如 \"advocates\"，表示倡导的行为。\n- **并列的宾语表示被倡导的事物的使用**：如 \"greater study of foreign languages, international affairs and the expansion of study abroad programs\"。\n\n**6. 练习相似句子**\n\n\"该政策还倡导更多的环保行动、社区参与以及扩大社区治理项目。\"\n\n\"The policy also advocates greater action on environmental protection, community involvement, and the expansion of community governance projects.\""}]},{"sentences":[{"text":"Unfortunately, despite 2½ years in the making, “The Heart of the Matter” never gets to the heart of the matter: the illiberal nature of liberal education at our leading colleges and universities.","explainMd":"**1. 翻译**\n\n\"遗憾的是，尽管报告耗时2年半的时间编制，但是“重中之重”从未触及到问题的核心：我们主要的学院和大学的自由教育的非自由性质。\"\n\n**2. 词汇和短语**\n\n- `Unfortunately`：不幸的是，表示一种遗憾或者不满意的情绪。\n- `despite`：尽管，表示一种转折或者对比的关系。\n- `2½ years in the making`：用两年半的时间编写，\"in the making\" 是一个固定短语，表示制作或者创建的过程。\n- `never gets to the heart of the matter`：从未触及问题的核心，\"get to the heart of\" 是一个固定短语，表示触及或者了解某事的核心或者实质。\n- `the illiberal nature of liberal education`：自由教育的非自由性质，\"illiberal\" 是一个形容词，表示非自由的，\"nature\" 在这里表示性质或者特性。\n- `at our leading colleges and universities`：在我们主要的学院和大学，\"leading\" 是一个形容词，表示主要的或者领先的。\n\n**3. 句子结构**\n\n这是一个复杂句，主句是 \"“The Heart of the Matter” never gets to the heart of the matter\"，前置状语是 \"Unfortunately, despite 2½ years in the making\"，后置定语是 \"the illiberal nature of liberal education at our leading colleges and universities\"。\n\n**4. 语法**\n\n- `Unfortunately`：这是一个副词，用来表达一种情绪或者态度。\n- `despite`：这是一个转折连词，用来表示一种对比或者转折的关系。\n- `2½ years in the making`：这是一个时间状语，用来表示动作的持续时间。\n- `“The Heart of the Matter” never gets to the heart of the matter`：这是一个主谓宾结构的句子，表示主语的行为或者状态。\n- `the illiberal nature of liberal education`：这是一个名词短语，用来表示特定的性质或者特性。\n- `at our leading colleges and universities`：这是一个地点状语，用来表示动作发生的地点。\n\n**5. 知识点总结**\n\n- **副词的使用**：如 \"Unfortunately\"，用来表达一种情绪或者态度。\n- **转折连词的使用**：如 \"despite\"，用来表示一种对比或者转折的关系。\n- **时间状语的使用**：如 \"2½ years in the making\"，用来表示动作的持续时间。\n- **主谓宾结构的使用**：如 \"“The Heart of the Matter” never gets to the heart of the matter\"，表示主语的行为或者状态。\n- **名词短语的使用**：如 \"the illiberal nature of liberal education\"，用来表示特定的性质或者特性。\n- **地点状语的使用**：如 \"at our leading colleges and universities\"，用来表示动作发生的地点。\n\n**6. 练习相似句子**\n\n\"遗憾的是，尽管项目花费了三年的时间，但“绿色转型”从未真正实现：我们主要的工厂和企业的环保行动并不到位。\"\n\n\"Unfortunately, despite three years in the making, the \"Green Transition\" never really happens: the environmental actions at our leading factories and businesses are not in place.\""},{"text":"The commission ignores that for several decades America’s colleges and universities have produced graduates who don’t know the content and character of liberal education and are thus deprived of its benefits.","explainMd":"**1. 翻译**\n\n\"委员会忽视了几十年来，美国的学院和大学培养出的毕业生并不了解自由教育的内容和特性，因此被剥夺了其应有的益处。\"\n\n**2. 词汇和短语**\n\n- `The commission`：委员会，\"The commission\" 指的是前文提到的委员会。\n- `ignores`：忽视，\"ignores\" 是动词，表示忽视或者忽略的行为。\n- `that for several decades`：几十年来，\"for several decades\" 表示一段时间，\"that\" 是连接词，引导一个宾语从句。\n- `America’s colleges and universities have produced graduates`：美国的学院和大学培养出的毕业生，\"have produced\" 是一个现在完成时态的动词，表示过去发生的对现在有影响的动作。\n- `who don’t know the content and character of liberal education`：并不了解自由教育的内容和特性，\"who\" 是一个关系代词，引导一个定语从句。\n- `and are thus deprived of its benefits`：因此被剥夺了其应有的益处，\"and are thus deprived of\" 是一个并列连词和动词短语的结构，表示并列关系和被剥夺的行为。\n\n**3. 句子结构**\n\n这是一个复杂句，主句是 \"The commission ignores that for several decades America’s colleges and universities have produced graduates\"，宾语从句是 \"who don’t know the content and character of liberal education and are thus deprived of its benefits\"。\n\n**4. 语法**\n\n- `The commission`：这是一个名词短语，作为句子的主语。\n- `ignores`：这是一个动词，表示忽视的行为。\n- `that for several decades America’s colleges and universities have produced graduates`：这是一个宾语从句，表示被忽视的事实。\n- `who don’t know the content and character of liberal education`：这是一个定语从句，表示毕业生的情况或者状态。\n- `and are thus deprived of its benefits`：这是一个并列连词和动词短语的结构，表示并列关系和被剥夺的行为。\n\n**5. 知识点总结**\n\n- **名词短语作为主语的使用**：如 \"The commission\"，表示句子的主语。\n- **动词表示行为的使用**：如 \"ignores\"，表示忽视的行为。\n- **宾语从句表示被忽视的事实的使用**：如 \"that for several decades America’s colleges and universities have produced graduates\"。\n- **定语从句表示情况或者状态的使用**：如 \"who don’t know the content and character of liberal education\"。\n- **并列连词和动词短语的结构的使用**：如 \"and are thus deprived of its benefits\"，表示并列关系和被剥夺的行为。\n\n**6. 练习相似句子**\n\n\"研究团队忽视了这样一个事实，即过去的几十年间，我国的学校和大学培养出的学生并不了解科技教育的重要性，因此被剥夺了其应有的机会。\"\n\n\"The research team overlooks the fact that for several decades, our schools and universities have produced students who do not understand the importance of science and technology education and are thus deprived of their opportunities.\""},{"text":"Sadly, the spirit of inquiry once at home on campus has been replaced by the use of the humanities and social sciences as vehicles for publicizing “progressive,” or left-liberal propaganda.","explainMd":"**1. 翻译**\n\n\"令人遗憾的是，曾经在校园里盛行的探究精神已被人文社科的使用所取代，用作宣传“进步”或左倾自由主义的宣传工具。\"\n\n**2. 词汇和短语**\n\n- `Sadly`：令人遗憾地，表示情绪的副词。\n- `the spirit of inquiry`：探究精神，\"spirit\" 在这里指的是一种精神或态度。\n- `once at home on campus`：曾经在校园里盛行，\"once\" 表示过去的某个时刻，\"at home\" 是一个固定短语，表示在某地很常见或者自然。\n- `has been replaced by`：已被...取代，这是被动语态的一种表达方式。\n- `the use of the humanities and social sciences`：人文社科的使用，\"the use of\" 是一个固定短语，表示使用或者利用。\n- `as vehicles for publicizing`：作为宣传的工具，\"vehicles\" 在这里比喻为传播或者宣传的工具。\n- `\"progressive,\" or left-liberal propaganda`：\"进步\"或左倾自由主义的宣传，\"propaganda\" 是名词，表示宣传或者鼓吹。\n\n**3. 句子结构**\n\n这是一个复杂句，主句是 \"the spirit of inquiry once at home on campus has been replaced by the use of the humanities and social sciences\"，定语从句是 \"as vehicles for publicizing “progressive,” or left-liberal propaganda\"。\n\n**4. 语法**\n\n- `Sadly`：这是一个副词，用来修饰整个句子，表示情绪或者态度。\n- `the spirit of inquiry once at home on campus`：这是一个主语，由名词短语 \"the spirit of inquiry\" 和定语 \"once at home on campus\" 组成。\n- `has been replaced by`：这是一个被动语态的谓语，表示主语的状态或者经历。\n- `the use of the humanities and social sciences`：这是一个宾语，由 \"the use of\" 和 \"the humanities and social sciences\" 组成。\n- `as vehicles for publicizing “progressive,” or left-liberal propaganda`：这是一个定语从句，用 \"as\" 引导，表示目的或者结果。\n\n**5. 知识点总结**\n\n- **副词修饰整个句子的使用**：如 \"Sadly\"，表示情绪或者态度。\n- **名词短语和定语构成的主语的使用**：如 \"the spirit of inquiry once at home on campus\"，表示主语的具体内容或者状态。\n- **被动语态的谓语的使用**：如 \"has been replaced by\"，表示主语的状态或者经历。\n- **名词短语作为宾语的使用**：如 \"the use of the humanities and social sciences\"，表示被动语态的谓语的对象。\n- **定语从句表示目的或者结果的使用**：如 \"as vehicles for publicizing “progressive,” or left-liberal propaganda\"。\n\n**6. 练习相似句子**\n\n\"遗憾的是，曾经在社区普遍的互助精神已被自我中心的行为所取代，作为推动“我行我素”或个人主义的工具。\"\n\n\"Sadly, the spirit of mutual aid once at home in the community has been replaced by self-centered behavior, as vehicles for publicizing 'doing things my own way' or individualistic propaganda.\""}]},{"sentences":[{"text":"Today, professors routinely treat the progressive interpretation of history and progressive public policy as the proper subject of study while portraying conservative or classical liberal ideas —such as free markets and self-reliance—as falling outside the boundaries of routine, and sometimes legitimate, intellectual investigation.","explainMd":"**1. 翻译**\n\n\"如今，教授们通常将“进步”历史观和“进步”公共政策视为正当的研究对象，同时描绘保守或古典自由主义思想——比如自由市场和自力更生——为超越常规，有时甚至超越合理的知识探索的边界。\"\n\n**2. 词汇和短语**\n\n- `Today`：今天，表示现在的时间。\n- `professors`：教授，指的是大学的教师。\n- `routinely`：通常，表示某种行为的频繁或习惯性。\n- `treat`：对待，指的是对待或处理的行为。\n- `the progressive interpretation of history and progressive public policy`：“进步”历史观和“进步”公共政策，\"interpretation\" 指的是解释或理解，\"public policy\" 指的是公共政策。\n- `as the proper subject of study`：作为正当的研究对象，\"proper\" 指的是合适的或正确的。\n- `while portraying conservative or classical liberal ideas`：同时描绘保守或古典自由主义思想，\"portraying\" 指的是描绘或描述的行为。\n- `as falling outside the boundaries of routine, and sometimes legitimate, intellectual investigation`：作为超出常规，有时甚至超出合理的知识探索的边界，\"boundaries\" 指的是边界或限制。\n\n**3. 句子结构**\n\n这是一个复杂句，主句是 \"Today, professors routinely treat the progressive interpretation of history and progressive public policy as the proper subject of study\"，并列句是 \"while portraying conservative or classical liberal ideas as falling outside the boundaries of routine, and sometimes legitimate, intellectual investigation\"。\n\n**4. 语法**\n\n- `Today`：这是一个时间状语，用来表示时间。\n- `professors routinely treat`：这是一个主谓宾结构，表示主语的行为。\n- `the progressive interpretation of history and progressive public policy`：这是一个并列的宾语，表示被对待的对象。\n- `as the proper subject of study`：这是一个作宾语补足语的短语，表示宾语的状态或性质。\n- `while portraying conservative or classical liberal ideas`：这是一个并列连词和动词短语的结构，表示并列的行为。\n- `as falling outside the boundaries of routine, and sometimes legitimate, intellectual investigation`：这是一个作宾语补足语的短语，表示宾语的状态或性质。\n\n**5. 知识点总结**\n\n- **时间状语的使用**：如 \"Today\"，表示时间。\n- **主谓宾结构的使用**：如 \"professors routinely treat\"，表示主语的行为。\n- **并列的宾语的使用**：如 \"the progressive interpretation of history and progressive public policy\"，表示被对待的对象。\n- **作宾语补足语的短语的使用**：如 \"as the proper subject of study\" 和 \"as falling outside the boundaries of routine, and sometimes legitimate, intellectual investigation\"，表示宾语的状态或性质。\n- **并列连词和动词短语的结构的使用**：如 \"while portraying conservative or classical liberal ideas\"，表示并列的行为。\n\n**6. 练习相似句子**\n\n\"如今，医生通常将新的医疗技术视为正确的治疗手段，同时描绘传统或古老的医疗方法作为超出常规，有时甚至超出合理的医疗研究的边界。\"\n\n\"Today, doctors routinely treat new medical techniques as the proper means of treatment while portraying traditional or ancient medical methods as falling outside the boundaries of routine\""}]},{"sentences":[{"text":"The AAAS displays great enthusiasm for liberal education.","explainMd":"**1. 翻译**\n\n\"美国艺术与科学学院（AAAS）对自由教育表现出极大的热情。\"\n\n**2. 词汇和短语**\n\n- `The AAAS`：美国艺术与科学学院，这是一个专有名词，指的是特定的机构。\n- `displays`：展示，这是一个动词，表示展示或者显示的行为。\n- `great enthusiasm`：极大的热情，\"great\" 是一个形容词，表示大的，\"enthusiasm\" 是一个名词，表示热情或者激情。\n- `for liberal education`：对自由教育，\"for\" 是一个介词，表示目的或者方向，\"liberal education\" 是一个名词，表示自由教育。\n\n**3. 句子结构**\n\n这是一个简单句，句子的主语是 \"The AAAS\"，谓语是 \"displays great enthusiasm\"，宾语是 \"for liberal education\"。\n\n**4. 语法**\n\n- `The AAAS`：这是一个名词短语，作为句子的主语。\n- `displays`：这是一个动词，表示展示的行为。\n- `great enthusiasm`：这是一个名词短语，表示被展示的对象。\n- `for liberal education`：这是一个介词短语，表示目的或者方向。\n\n**5. 知识点总结**\n\n- **名词短语作为主语的使用**：如 \"The AAAS\"，表示句子的主语。\n- **动词表示行为的使用**：如 \"displays\"，表示展示的行为。\n- **名词短语表示被展示的对象的使用**：如 \"great enthusiasm\"。\n- **介词短语表示目的或者方向的使用**：如 \"for liberal education\"。\n\n**6. 练习相似句子**\n\n\"这个组织对环保工作表现出极大的热情。\"\n\n\"The organization displays great enthusiasm for environmental work.\""},{"text":"Yet its report may well set back reform by obscuring the depth and breadth of the challenge that Congress asked it to illuminate.","explainMd":"**1. 翻译**\n\n\"然而，其报告可能会阻碍改革，因为它模糊了国会要求其阐明的挑战的深度和广度。\"\n\n**2. 词汇和短语**\n\n- `Yet`：然而，是一个转折连词，用于连接表达对比或者转折的句子。\n- `its report`：它的报告，\"its\" 是一个代词，指代前文提到的 \"AAAS\"，\"report\" 是一个名词，指代报告。\n- `may well`：可能，这是一个固定短语，用于表达可能性。\n- `set back`：阻碍，这是一个短语动词，表示阻碍或者延缓的行为。\n- `reform`：改革，这是一个名词，表示改革或者改善的行为。\n- `by obscuring`：通过模糊，\"by\" 是一个介词，表示方式或者手段，\"obscuring\" 是一个动词，表示模糊或者隐藏的行为。\n- `the depth and breadth of the challenge`：挑战的深度和广度，\"depth and breadth\" 是一个固定短语，表示深度和广度。\n- `that Congress asked it to illuminate`：国会要求它阐明的，\"that\" 是一个连接词，引导一个宾语从句。\n\n**3. 句子结构**\n\n这是一个复杂句，主句是 \"Yet its report may well set back reform\"，方式状语是 \"by obscuring the depth and breadth of the challenge\"，定语从句是 \"that Congress asked it to illuminate\"。\n\n**4. 语法**\n\n- `Yet`：这是一个转折连词，用于连接表达对比或者转折的句子。\n- `its report`：这是一个名词短语，作为句子的主语。\n- `may well`：这是一个模态动词短语，表示可能的行为。\n- `set back`：这是一个短语动词，表示阻碍的行为。\n- `reform`：这是一个名词，作为动词的宾语。\n- `by obscuring`：这是一个方式状语，表示行为的方式或者手段。\n- `the depth and breadth of the challenge`：这是一个名词短语，作为动词的宾语。\n- `that Congress asked it to illuminate`：这是一个定语从句，表示名词的具体内容。\n\n**5. 知识点总结**\n\n- **转折连词的使用**：如 \"Yet\"，用于连接表达对比或者转折的句子。\n- **名词短语作为主语的使用**：如 \"its report\"，表示句子的主语。\n- **模态动词短语表示可能的行为的使用**：如 \"may well\"。\n- **短语动词表示行为的使用**：如 \"set back\"，表示阻碍的行为。\n- **名词作为动词的宾语的使用**：如 \"reform\"。\n- **方式状语表示行为的方式或者手段的使用**：如 \"by obscuring\"。\n- **名词短语作为动词的宾语的使用**：如 \"the depth and breadth of the challenge\"。\n- **定语从句表示名词的具体内容的使用**：如 \"that Congress asked it to illuminate\"。\n\n**6. 练习相似句子**\n\n\"然而，这个计划可能会阻碍进步，因为它模糊了我们需要面对的问题的复杂性和广泛性。\"\n\n\"Yet, this plan may well set back progress by obscuring the complexity and breadth of the issues we need to address.\""}]}],"title":""}