{"translate":"","paragraphs":[{"sentences":[{"text":"Two years ago, Rupert Murdoch’s daughter, Elisabeth, spoke of the “unsettling dearth of integrity across so many of our institutions.” Integrity had collapsed, she argued, because of a collective acceptance that the only “sorting mechanism” in society should be profit and the market.","explainMd":"\n1. **翻译**\n    > \"两年前，鲁珀特·默多克的女儿，伊丽莎白，说到我们许多机构中令人不安的诚信匮乏。她辩称，诚信已经崩溃，因为大家都接受了一个观点，那就是社会的唯一\"筛选机制\"应该是利润和市场。\"\n\n2. **词汇和短语**\n    - unsettling: 令人不安的\n    - dearth: 匮乏，缺乏\n    - integrity: 诚信，正直\n    - institution: 机构，制度\n    - collapse: 崩溃，瓦解\n    - collective acceptance: 集体接受，共同认同\n    - sorting mechanism: 筛选机制\n    - profit: 利润\n    - market: 市场\n\n3. **句子结构**\n    - 主句：\"Two years ago, Rupert Murdoch’s daughter, Elisabeth, spoke of the 'unsettling dearth of integrity across so many of our institutions.'\"\n    - 从句：\"Integrity had collapsed, she argued, because of a collective acceptance that the only 'sorting mechanism' in society should be profit and the market.\"\n\n4. **语法**\n    - 该句子中出现了直接引语和间接引语的使用，\"unsettling dearth of integrity across so many of our institutions.\" 是直接引语，表示伊丽莎白确切的话语，而 \"Integrity had collapsed, she argued, because of a collective acceptance that the only 'sorting mechanism' in society should be profit and the market.\" 是间接引语，表示伊丽莎白之前的观点或论述。\n    - 该句子使用了过去完成时的 \"had collapsed\"，表示在过去某个时间点之前已经完成的动作或状态。\n\n5. **知识点总结**\n    - 该句子展示了直接引语和间接引语的使用方法，以及过去完成时的使用场景。\n    - 它也表明了如何使用复杂的句子结构来清晰、准确地表达复杂的思想和信息。\n\n6. **相似句子练习**\n    > \"Last month, Elon Musk, the CEO of Tesla, stated that 'autonomous vehicles will dominate the roads.' He believed that this is inevitable because of the rapid advancement of AI technology in recent years.\"  \n    > \"上个月，特斯拉的CEO埃隆·马斯克表示，'自动驾驶车辆将主导道路。'他相信，由于近年来AI技术的快速发展，这是不可避免的。\""},{"text":"But “it’s us, human beings, we the people who create the society we want, not profit.”","explainMd":"1. **翻译**\n    > \"但是，是我们，人类，我们这些人创造了我们想要的社会，而不是利润。\"\n\n2. **词汇和短语**\n    - human beings: 人类\n    - we the people: 我们这些人（常用于强调集体的力量和责任）\n    - create: 创造\n    - society: 社会\n    - profit: 利润\n\n3. **句子结构**\n    - \"it’s us, human beings\"：这是主句的主语部分。\"it’s\" 是 \"it is\" 的缩写形式，这里的 \"it\" 是形式主语，真正的主语是 \"us, human beings\"。\n\n   -\"we the people who create the society we want\"：这部分是一个含有定语从句的复合名词短语。\"we the people\" 是名词短语，\"who create the society we want\" 是定语从句，用来修饰和描述 \"we the people\"。\n\n   -\"not profit\"：这部分是主句的谓语部分，\"not\" 是否定词，\"profit\" 是谓语的宾语。\n\n4. **语法**\n    - 该句子使用了强调句型 \"It is ... that ...\" 的省略形式，强调的是主语 \"us, human beings, we the people\"。\n    - 该句子中使用了关系代词 \"who\" 引导的定语从句，修饰 \"we the people\"，说明是 \"we the people\" 创造了我们想要的社会，而不是利润。\n    - 该句子中使用了 \"not ... but ...\" 的结构，强调了创造我们想要的社会的主体应该是我们，而不是利润。\n\n5. **知识点总结**\n    - 该句子展示了强调句型、定语从句和 \"not ... but ...\" 结构的使用方法，它们都是用于强调或者突出某部分信息的语法结构。\n    - 该句子使用了直接的方式表达了作者的观点，即应该是人类来创造我们想要的社会，而不是利润。这也反映在全文中作者对于过度追求利润和缺乏道德目标的批评。\n\n6. **相似句子练习**\n    > \"But it’s us, the consumers, who determine the trend of the market, not the manufacturers.\"  \n    > \"但是，是我们，消费者，决定市场的趋势，而不是制造商。\""}]},{"sentences":[{"text":"Driving her point home, she continued: “It’s increasingly apparent that the absence of purpose, of a moral language within government, media or business could become one of the most dangerous goals for capitalism and freedom.” This same absence of moral purpose was wounding companies such as News International, she thought, making it more likely that it would lose its way as it had with widespread illegal telephone hacking.","explainMd":"**1.翻译**\n> \"她继续强调自己的观点：“越来越明显的是，政府、媒体或商业中道德目标、道德语言的缺失可能成为资本主义和自由最危险的目标。”她认为，这种道德目标的缺失正在伤害新闻国际等公司，使其更可能在广泛的非法电话窃听中迷失方向。\"\n\n**2.词汇和短语**\n- Driving her point home: 强调自己的观点\n- increasingly apparent: 越来越明显\n- absence of purpose: 目标的缺失\n- a moral language: 道德语言\n- dangerous goals: 危险的目标\n- capitalism and freedom: 资本主义和自由\n- wounding companies: 伤害公司\n- lose its way: 迷失方向\n- widespread illegal telephone hacking: 广泛的非法电话窃听\n\n**3.句子结构**\n- 主句：\"Driving her point home, she continued\"，\"她继续强调自己的观点\"。\n- 宾语从句：\"It’s increasingly apparent that the absence of purpose, of a moral language within government, media or business could become one of the most dangerous goals for capitalism and freedom.\"，\"越来越明显的是，政府、媒体或商业中道德目标、道德语言的缺失可能成为资本主义和自由最危险的目标。\"\n\n**4.语法**\n- 该句子使用了宾语从句，\"that...\"引导的是一个表示观点的宾语从句，用来说明主句中的情况。\n- 在宾语从句里，使用了\"absence of\"来表示\"缺乏\"的含义。\n\n**5.知识点总结**\n- 本句主要展示了如何使用宾语从句来表达复杂的观点，同时也使用了一些描述和评价的词汇和短语，如\"increasingly apparent\"、\"absence of purpose\"和\"dangerous goals\"等。\n- 通过本句我们可以看出，作者在批评政府、媒体和商业中道德目标和道德语言的缺失，认为这可能成为资本主义和自由的最大威胁。\n\n**6.相似句子练习**\n> \"Highlighting her concerns, she added: 'It's becoming clear that the lack of ethical guidance in politics, media, or business could turn into a serious threat to democracy and justice.'\"  \n> \"她强调自己的担忧，并补充说：'越来越明显的是，政治、媒体或商业中道德指导的缺失可能会成为对民主和公正的严重威胁。'\""}]},{"sentences":[{"text":"As the hacking trial concludes—finding guilty one ex-editor of the News of the World, Andy Coulson, for conspiring to hack phones, and finding his predecessor, Rebekah Brooks, innocent of the same charge—the wider issue of dearth of integrity still stands.","explainMd":"**1. 翻译**\n> \"随着黑客审判的结束，前《世界新闻报》编辑安迪·库尔森因密谋窃听电话被判有罪，而他的前任丽贝卡·布鲁克斯在同样的指控下被判无罪，诚信匮乏的更广泛问题仍然存在。\"\n\n**2. 词汇和短语**\n- hacking trial: 黑客审判\n- concludes: 结束\n- finding guilty: 判有罪\n- ex-editor: 前编辑\n- News of the World: 《世界新闻报》，英国已停刊的一份周日报纸\n- conspiring to hack phones: 密谋窃听电话\n- predecessor: 前任\n- innocent of the same charge: 在同样的指控下被判无罪\n- dearth of integrity: 诚信匮乏\n\n**3. 句子结构**\n- 主句：\"As the hacking trial concludes\"，\"随着黑客审判的结束\"。\n- 宾语从句：\"finding guilty one ex-editor of the News of the World, Andy Coulson, for conspiring to hack phones, and finding his predecessor, Rebekah Brooks, innocent of the same charge\"，\"前《世界新闻报》编辑安迪·库尔森因密谋窃听电话被判有罪，而他的前任丽贝卡·布鲁克斯在同样的指控下被判无罪\"。\n- 结论：\"the wider issue of dearth of integrity still stands\"，\"诚信匮乏的更广泛问题仍然存在\"。\n\n**4. 语法**\n- 该句子使用了时间状语从句，\"As...\"引导的是一个时间状语从句，用来表示主句中的情况发生的时间。\n- 在宾语从句里，使用了现在分词\"finding\"来表示并列的动作。\n\n**5. 知识点总结**\n- 本句主要展示了如何使用时间状语从句和现在分词来表达复杂的观点，同时也使用了一些描述和评价的词汇和短语，如\"hacking trial\"、\"finding guilty\"和\"innocent of the same charge\"等。\n- 通过本句我们可以看出，作者在叙述一个关于黑客审判的事件，同时也强调了诚信匮乏的问题仍然存在。\n\n**6. 相似句子练习**\n> \"As the trial of the bribery case concludes, finding the former CEO guilty of taking bribes and his associate innocent of the same charges, the broader issue of corruption in businesses still persists.\"    \n> \"随着贿赂案审判的结束，前CEO因接受贿赂被判有罪，而他的合作伙伴在同样的指控下被判无罪，商业腐败的更广泛问题仍然存在。\""},{"text":"Journalists are known to have hacked the phones of up to 5,500 people.","explainMd":"**1. 翻译**：\n\"据所知，新闻记者被曝出已经黑进多达5500人的电话。\"\n\n**2. 词汇和短语**：\n\n- Journalists：记者，这是一个名词，指从事新闻工作的人。\n- are known to have：被知道已经，这是一个被动态的短语，表示某人或某事已经被公众或一部分人所知道。\n- hacked：黑进，这是一个动词，原义是砍，这里表示通过非法手段获取他人电脑或电话等电子设备的访问权限。\n- the phones：电话，这是一个名词，这里指的是电话设备或电话通信系统。\n- of up to：多达，这是一个短语，表示某个数量或范围的最大值。\n- 5,500 people：5500人，这是一个名词短语，表示被影响或遭受某种行为的人的数量。\n\n**3. 句子结构**：\n\n这个句子是一个简单句。主语是 \"journalists\"（记者们），谓语是 \"are known to have hacked\"（被知道已经黑进），宾语是 \"the phones of up to 5,500 people\"（多达5500人的电话）。\n\n**4. 语法**：\n\n这个句子主要采用了被动语态和现在完成时。\n\n- 被动语态：在这个句子中，\"are known to have\" 是一个被动语态的结构，表示记者们的行为已经被公众所知道。\n- 现在完成时：在这个句子中，\"have hacked\" 是一个现在完成时的结构，表示记者们的这个行为在过去某个时间开始，可能一直持续到现在。\n\n**5. 知识点总结**：\n\n这个句子虽然是一个简单句，但是它使用了被动语态和现在完成时，使得句子表达了更复杂的含义。此外，它使用了 \"up to\" 这个短语来表示一个可能的最大数量，这是一个常见的英语表达方式。在全文的上下文中，这个句子揭示了新闻行业的一种违法行为——非法窃听电话，从而提出了对道德和公正的深刻质疑。\n\n**6. 相似句子练习**：\n\n\"Scientists are known to have researched the habits of up to 10,000 species.\"\n\"据知，科学家们已经研究了多达10000种物种的习性。\""},{"text":"This is hacking on an industrial scale, as was acknowledged by Glenn Mulcaire, the man hired by the News of the World in 2001 to be the point person for phone hacking.","explainMd":"**1. 翻译**：\n\n\"这是在工业规模上的黑客攻击，正如2001年被《世界新闻报》雇佣，作为电话黑客攻击的主要负责人的Glenn Mulcaire所承认的那样。\"\n\n**2. 词汇和短语**：\n\n- Hacking on an industrial scale：在工业规模上的黑客攻击\n- Acknowledged：承认\n- The man hired by：被...雇佣的人\n- The point person for：...的主要负责人\n\n**3. 句子结构**：\n\n这是一个包含了主句和两个从句的复合句。具体结构如下：\n\n- 主句：`This is hacking on an industrial scale`\n- 同位语从句：`as was acknowledged by Glenn Mulcaire`，对`hacking on an industrial scale`进行补充说明\n- 并列从句：`the man hired by the News of the World in 2001 to be the point person for phone hacking`，补充说明 Glenn Mulcaire 的行为和角色\n\n**4. 语法**：\n\n主要使用了被动语态和过去时。\n\n- 被动语态：`was hired`是被动语态，表示Glenn Mulcaire是被《世界新闻报》雇佣的\n- 过去时：`acknowledged`是过去时，表示Glenn Mulcaire已经承认了这个事实\n\n**5. 知识点总结**：\n\n这个句子通过被动语态和过去时，清晰地描绘了 Glenn Mulcaire 如何被雇佣，并承认他在电话黑客攻击中的主要角色。句子中的 \"on an industrial scale\" 强调了黑客攻击的规模和严重程度。\n\n**6. 相似句子练习**：\n\n\"This is pollution on a global scale, as was admitted by the company responsible for the oil spill.\"\n\n\"这是全球范围内的污染，正如那个负责石油泄漏的公司所承认的那样。\""},{"text":"Others await trial.","explainMd":"**1. 翻译**：\n\n\"其他人正在等待审判。\"\n\n**2. 词汇和短语**：\n\n- Others：其他人\n- Await：等待\n- Trial：审判\n\n**3. 句子结构**：\n\n这是一个简单句，结构如下： \n\n- 主语：`Others`\n- 谓语：`await`\n- 宾语：`trial`\n\n**4. 语法**：\n\n这个句子使用了现在进行时，表示正在发生的动作。`Await` 是一个及物动词，后面直接跟宾语，不需要使用介词 \"for\"。\n\n**5. 知识点总结**：\n\n这个句子简洁明了，展示了现在进行时态的用法，并使用了及物动词 \"await\"。它在语境中传达了关于黑客攻击审判的持续进行，暗示了这个问题的严重性和广泛影响。\n\n**6. 相似句子练习**：\n\n\"Students await results.\"\n\n\"学生们正在等待结果。\""},{"text":"This long story still unfolds.","explainMd":"**1. 翻译**：\n\n\"这个长故事仍在展开中。\"\n\n**2. 词汇和短语**：\n\n- This：这个\n- Long story：长故事\n- Still：仍然\n- Unfolds：展开\n\n**3. 句子结构**：\n\n这是一个简单句，结构如下： \n\n- 主语：`This long story`\n- 谓语：`still unfolds`\n\n**4. 语法**：\n\n这个句子使用了现在进行时，表示正在发生的动作。\"Unfolds\" 是一个不及物动词，表示\"展开\"或\"逐渐展现\"，常用于讲述故事或事件。\n\n**5. 知识点总结**：\n\n这个句子展示了现在进行时态的用法，特别是在描述正在进行或发展的事件或故事时。同时，\"unfold\" 这个动词的使用也是一个重要的知识点，常用于讲述故事或事件的发展过程。\n\n**6. 相似句子练习**：\n\n\"The mystery still unfolds.\"\n\n\"谜团仍在揭开中。\""}]},{"sentences":[{"text":"In many respects, the dearth of moral purpose frames not only the fact of such widespread phone hacking but the terms on which the trial took place.","explainMd":"**1. 翻译**：\n\n\"在很多方面，道德目的的缺失不仅框定了如此广泛的电话黑客行为的事实，而且还决定了审判的条款。\"\n\n**2. 词汇和短语**：\n\n- In many respects：在很多方面\n- Dearth：缺乏\n- Moral purpose：道德目的\n- Frames：框定\n- Not only...but also...：不仅...而且...\n- Fact：事实\n- Widespread：广泛的\n- Phone hacking：电话黑客行为\n- Terms：条款\n- Trial：审判\n\n**3. 句子结构**：\n\n这是一个复合句，结构如下：\n\n- 主句：`In many respects, the dearth of moral purpose frames...`\n- 宾语从句(并列结构)：`not only the fact of such widespread phone hacking but the terms on which the trial took place`\n\n**4. 语法**：\n\n这个句子使用了“not only...but also...”结构，表达的是并列关系，强调两个或两组事物都有或都没有某种性质或特征。这种结构在英语中非常常见。\n\n**5. 知识点总结**：\n\n这个句子的重要知识点包括“not only...but also...”的并列结构，以及\"frames\"这个动词的使用，后者在此上下文中表示“决定”或“塑造”。另外，\"dearth\"是个相对生僻的词，表示“缺乏”。\n\n**6. 相似句子练习**：\n\n\"In many respects, the lack of discipline not only affects the students' academic performance but also their personal growth.\"\n\n\"在很多方面，缺乏纪律不仅影响学生的学业成绩，也影响他们的个人成长。\""},{"text":"One of the astonishing revelations was how little Rebekah Brooks knew of what went on in her newsroom, how little she thought to ask and the fact that she never inquired how the stories arrived.","explainMd":"**1. 翻译**：\n\n\"其中一个令人惊讶的揭示是，瑞贝卡·布鲁克斯对她的新闻编辑部发生的事情知之甚少，她很少去问，她从未询问过这些报道是如何到来的。\"\n\n**2. 词汇和短语**：\n\n- One of the astonishing revelations：其中一个令人惊讶的揭示\n- Knew：知道\n- What went on：发生的事情\n- Newsroom：新闻编辑部\n- Thought to ask：去问\n- Inquired：询问\n- Stories：报道\n- Arrived：到来\n\n**3. 句子结构**：\n\n这是一个并列句，主要包含三个部分：\n\n- 主句：`One of the astonishing revelations was...`\n- 并列子句1：`how little Rebekah Brooks knew of what went on in her newsroom`\n- 并列子句2：`how little she thought to ask and the fact that she never inquired how the stories arrived`\n\n**4. 语法**：\n\n这个句子主要是使用了并列句的语法，通过使用`and`连接了两个等同重要的子句。然后，`how little`这个结构用来表达对量的评估，强调了\"瑞贝卡·布鲁克斯\"了解和询问的程度很低。\n\n**5. 知识点总结**：\n\n这个句子的重要知识点包括并列句的使用以及`how little`的结构。并列句用于连接两个等重要的子句，而`how little`用于强调某事物的量或程度。\n\n**6. 相似句子练习**：\n\n\"One of the surprising findings was how little the manager knew about the project, how little he sought to understand, and the fact that he never asked how the problems arose.\"\n\n\"其中一个令人惊讶的发现是，经理对项目的了解如此之少，他很少寻求理解，而且他从未询问过问题是如何产生的。\""},{"text":"The core of her successful defence was that she knew nothing.","explainMd":"**1. 翻译**：\n\n\"她成功辩护的核心是她什么都不知道。\"\n\n**2. 词汇和短语**：\n\n- The core：核心\n- Her successful defence：她成功的辩护\n- Was that：是那个\n- She knew nothing：她什么都不知道\n\n**3. 句子结构**：\n\n这个句子的结构比较简单，主要由以下几个部分构成：\n\n- 主语：`The core of her successful defence`\n- 谓语：`was`\n- 宾语（补语）：`that she knew nothing`\n\n**4. 语法**：\n\n这个句子主要使用了一个名词性从句作为补语（宾语）。\"that she knew nothing\"是一个名词性从句，用来补充说明\"她成功辩护的核心\"是什么。\n\n**5. 知识点总结**：\n\n这个句子的重要知识点是名词性从句的使用。在这个句子中，名词性从句\"that she knew nothing\"作为补语（宾语）来完善句子的意思，告诉我们\"她成功辩护的核心\"是什么。\n\n**6. 相似句子练习**：\n\n\"The key to his successful presentation was that he prepared well.\"\n\n\"他成功演讲的关键是他准备得很充分。\""}]},{"sentences":[{"text":"In today’s world, it has become normal that well-paid executives should not be accountable for what happens in the organisations that they run.","explainMd":"**1. 翻译**：\n\n\"在今天的世界里，高薪的执行官们不需要为他们所管理的组织中发生的事情负责已经变得正常。\"\n\n**2. 词汇和短语**：\n\n- In today's world：在今天的世界里\n- It has become normal：已经变得正常\n- Well-paid executives：高薪的执行官们\n- Should not be accountable for：不需要为...负责\n- What happens in the organisations：组织中发生的事情\n- That they run：他们所管理\n\n**3. 句子结构**：\n\n这个句子的主要结构是：\n\n- 主语：“It”\n- 谓语：“has become normal”\n- 宾语：“that well-paid executives should not be accountable for what happens in the organisations that they run.”\n\n宾语部分是一个由\"that\"引导的宾语从句。\n\n**4. 语法**：\n\n这个句子中的主要语法点是宾语从句的使用。\"that well-paid executives should not be accountable for what happens in the organisations that they run\" 是一个由\"that\"引导的宾语从句，作为\"It has become normal\"的宾语，用来详细说明成为常态的具体内容。\n\n**5. 知识点总结**：\n\n这个句子的重要知识点是宾语从句的使用。在这个句子中，宾语从句\"that well-paid executives should not be accountable for what happens in the organisations that they run\" 作为宾语，详细说明了\"成为常态\"的具体内容。\n\n**6. 相似句子练习**：\n\n\"In this era, it's becoming common for students not to take responsibility for their own learning.\"\n\n\"在这个时代，学生不为自己的学习负责变得越来越普遍。\""},{"text":"Perhaps we should not be so surprised.","explainMd":"**1. 翻译**：\n\n\"也许我们不应该感到如此惊讶。\"\n\n**2. 词汇和短语**：\n\n- Perhaps：也许\n- We should not be：我们不应该\n- So surprised：如此惊讶\n\n**3. 句子结构**：\n\n这个句子的主要结构是：\n\n- 主语：“We”\n- 谓语：“should not be”\n- 表语：“so surprised”\n\n这是一个简单句，只包含一个主语和一个谓语。\n\n**4. 语法**：\n\n这个句子中的主要语法点是应该使用\"should not\"来表示应该不做某事或不应该发生某事。此外，\"so\"用作副词，用来强调形容词\"surprised\"的程度。\n\n**5. 知识点总结**：\n\n这个句子的重要知识点是如何使用\"should not\"来表达应该不做某事，以及如何使用\"so\"来强调形容词的程度。\n\n**6. 相似句子练习**：\n\n\"Perhaps we shouldn't be so worried.\"\n\n\"也许我们不应该如此忧虑。\""},{"text":"For a generation, the collective doctrine has been that the sorting mechanism of society should be profit.","explainMd":"**1. 翻译**：\n\n\"对于一代人来说，社会的集体信条就是社会的筛选机制应该是利润。\"\n\n**2. 词汇和短语**：\n\n- For a generation：对于一代人来说\n- Collective doctrine：集体信条\n- Sorting mechanism：筛选机制\n- Society：社会\n- Profit：利润\n\n**3. 句子结构**：\n\n这个句子的主要结构是：\n\n- 状语：“For a generation”\n- 主语：“the collective doctrine”\n- 谓语：“has been”\n- 宾语：“that the sorting mechanism of society should be profit”\n\n这是一个复合句，其中含有一个宾语从句\"that the sorting mechanism of society should be profit\"。\n\n**4. 语法**：\n\n这个句子中的主要语法点是使用\"has been\"来表示过去某个时间段内一直持续的状态或行为。\"That\"引导的宾语从句用来详细说明主句的内容。\n\n**5. 知识点总结**：\n\n这个句子的重要知识点是如何使用\"has been\"来表示过去到现在的持续状态，以及如何使用\"that\"引导宾语从句。\n\n**6. 相似句子练习**：\n\n\"For a century, the universal belief has been that the key to happiness is wealth.\"\n\n\"对于一个世纪来说，普遍的信念一直是幸福的关键是财富。\""},{"text":"The words that have mattered are efficiency, flexibility, shareholder value, business-friendly, wealth generation, sales, impact and, in newspapers, circulation.","explainMd":"**1. 翻译**：\n\n\"重要的词汇包括效率、灵活性、股东价值、对商业友好、财富生成、销售、影响力，以及在报纸中，发行量。\"\n\n**2. 词汇和短语**：\n\n- The words that have mattered：重要的词汇\n- Efficiency：效率\n- Flexibility：灵活性\n- Shareholder value：股东价值\n- Business-friendly：对商业友好\n- Wealth generation：财富生成\n- Sales：销售\n- Impact：影响力\n- Circulation：发行量\n\n**3. 句子结构**：\n\n这个句子的基本结构是：\n\n- 主语：“The words that have mattered”\n- 谓语：“are”\n- 宾语：“efficiency, flexibility, shareholder value, business-friendly, wealth generation, sales, impact and, in newspapers, circulation”\n\n它是一个简单句，主语和谓语之间的关系是\"is/are\"。\n\n**4. 语法**：\n\n这个句子的主要语法点是使用\"is/are\"来连接主语和宾语，显示它们之间的关系。另一个重要的语法点是使用逗号分隔开宾语中的各个元素，每一个元素都是单独的，构成一个并列的结构。\n\n**5. 知识点总结**：\n\n这个句子的主要知识点是如何使用\"is/are\"来连接主语和宾语，以及如何使用逗号来分隔并列结构中的各个元素。\n\n**6. 相似句子练习**：\n\n\"The skills that are highly valued are creativity, leadership, teamwork, communication, and problem-solving.\"\n\n\"高度重视的技能包括创新、领导力、团队合作、沟通和解决问题的能力。\""},{"text":"Words degraded to the margin have been justice, fairness, tolerance, proportionality and accountability.","explainMd":"**1. 翻译**：\n\n\"被边缘化的词汇包括公正、公平、宽容、比例和责任。\"\n\n**2. 词汇和短语**：\n\n- Words degraded to the margin：被边缘化的词汇\n- Justice：公正\n- Fairness：公平\n- Tolerance：宽容\n- Proportionality：比例\n- Accountability：责任\n\n**3. 句子结构**：\n\n这个句子的基本结构是：\n\n- 主语：“Words degraded to the margin”\n- 谓语：“have been”\n- 宾语：“justice, fairness, tolerance, proportionality and accountability”\n\n这是一个被动语态的句子，主语和谓语之间的关系是\"have been\"。\n\n**4. 语法**：\n\n这个句子的主要语法点是使用\"have been\"来建立主语和宾语之间的被动关系。另一个重要的语法点是使用逗号分隔开宾语中的各个元素，每一个元素都是单独的，构成一个并列的结构。\n\n**5. 知识点总结**：\n\n这个句子的主要知识点是如何使用\"have been\"来构建被动语态，以及如何使用逗号来分隔并列结构中的各个元素。\n\n**6. 相似句子练习**：\n\n\"Values forgotten in the conversation have been empathy, compassion, understanding, and respect.\"\n\n\"在对话中被忽视的价值观包括同理心、同情心、理解和尊重。\""}]},{"sentences":[{"text":"The purpose of editing the News of the World was not to promote reader understanding, to be fair in what was written or to betray any common humanity.","explainMd":"**1. 翻译**：\n\n\"编辑《世界新闻报》的目的并非是提升读者理解，公正地撰写文章，或是展示任何普遍的人性。\"\n\n**2. 词汇和短语**：\n\n- The purpose of editing the News of the World：编辑《世界新闻报》的目的\n- Promote reader understanding：提升读者理解\n- To be fair in what was written：公正地撰写文章\n- Betray any common humanity：展示任何普遍的人性\n\n**3. 句子结构**：\n\n这个句子的基本结构是：\n\n主语：“The purpose of editing the News of the World”\n谓语：“was”\n宾语：“not to promote reader understanding, to be fair in what was written or to betray any common humanity”\n\n这是一个否定句，谓语后面的宾语部分由三个并列的不定式短语组成。\n\n**4. 语法**：\n\n这个句子的主要语法点是如何使用\"not to\"来构造否定句，并且在否定句中使用并列的不定式短语。\n\n**5. 知识点总结**：\n\n这个句子的主要知识点是如何构造否定句，以及如何在否定句中使用并列的不定式短语。\n\n**6. 相似句子练习**：\n\n\"The goal of taking this course is not to get an easy A, to gain superficial knowledge or to impress others.\"\n\n\"选修这门课程的目的并非是轻松拿到A，获取肤浅的知识，或是给他人留下深刻印象。\""},{"text":"It was to ruin lives in the quest for circulation and impact.","explainMd":"**1. 翻译**：\n\n\"它是为了在追求发行量和影响力的过程中，毁掉人们的生活。\"\n\n**2. 词汇和短语**：\n\n- It was to ruin lives：它是为了毁掉人们的生活\n- In the quest for：在追求…的过程中\n- Circulation and impact：发行量和影响力\n\n**3. 句子结构**：\n\n这个句子的基本结构是：\n\n主语：“It”\n谓语：“was to”\n宾语：“ruin lives”\n状语：“in the quest for circulation and impact”\n\n这是一个简单的句子，主干部分由主语、谓语和宾语组成，状语部分描述了动作的具体情况。\n\n**4. 语法**：\n\n这个句子的主要语法点是如何使用\"be to\"来表示某事的目的或结果，并且如何在句子中使用\"the quest for\"这个短语来表示追求或目标。\n\n**5. 知识点总结**：\n\n这个句子的主要知识点是如何构造简单的句子，以及如何在句子中使用\"be to\"和\"the quest for\"这两个语法结构。\n\n**6. 相似句子练习**：\n\n\"It was to improve health in the quest for longevity and vitality.\"\n\n\"这是为了在追求长寿和活力的过程中，改善健康状况。\""},{"text":"Ms Brooks may or may not have had suspicions about how her journalists got their stories, but she asked no questions, gave no instructions—nor received traceable, recorded answers.","explainMd":"**1. 翻译**：\n\n\"布鲁克斯女士可能对她的记者们是如何获取他们的报道有所怀疑，但她并未提出任何问题，也没有给出任何指示--也没有收到可追溯的、记录下来的答案。\"\n\n**2. 词汇和短语**：\n\n-May or may not: 表示某事可能发生也可能不发生。\n\n-Have had suspicions: 表示有过怀疑。\n\n-About how...: 关于如何...，用于引导宾语从句。\n\n-Asked no questions, gave no instructions: 表示没有提问也没有给予指示。\n\n-Nor received traceable, recorded answers: 表示也没有收到可追溯的、已记录的答案。\n\n**3. 句子结构**：\n\n句子的基本结构是：\n\n主语：“Ms Brooks”\n谓语：“may or may not have had suspicions”，“asked”，“gave”，“received”\n宾语：“suspicions”，“questions”，“instructions”，“answers”\n状语：“about how her journalists got their stories”，“traceable, recorded”\n\n这是一个复合句，其中包含多个动词和宾语，并使用并列连词\"nor\"连接。\n\n**4. 语法**：\n\n此句主要的语法点是如何使用\"may or may not have\"来表示可能性或疑虑，以及如何使用\"nor\"来连接两个否定句。\n\n**5. 知识点总结**：\n\n这个句子的主要知识点是如何构造复合句，以及如何使用\"may or may not have\"和\"nor\"这两个语法结构。\n\n**6. 相似句子练习**：\n\n\"Teachers may or may not have had doubts about how students completed their assignments, but they asked no questions, gave no instructions—nor received verifiable, recorded answers.\"\n\n\"教师可能对学生们是如何完成他们的作业有所怀疑，但他们并未提出任何问题，也没有给出任何指示--也没有收到可以验证的、记录下来的答案。\""}]}],"title":""}