{"translate":"","paragraphs":[{"sentences":[{"text":"Many people talked of the 288,000 new jobs the Labor Department reported for June, along with the drop in the unemployment rate to 6.1 percent, as good news.","explainMd":"**1. 翻译**\n\n\"许多人谈论到，劳工部为六月份报告的288,000个新工作岗位，以及失业率下降到6.1%，这是个好消息。\"\n\n**2. 词汇和短语**\n\n- Many people：许多人，这是一个常见的短语，用来表示大量的人。\n- Talked of：谈论到，这是一个动词短语，表示讨论某个主题或者问题。\n- The Labor Department：劳工部，这是一个专有名词，表示美国的一个政府部门。\n- Reported：报告，这是一个动词，常用来表示发布官方信息或数据。\n- Unemployment rate：失业率，这是一个经济学术语，用来衡量劳动力市场的状况。\n\n**3. 句子结构**\n\n这是一个复杂句，其结构为：主句 + 并列句。具体分析如下：\n\n主句：Many people talked of the 288,000 new jobs the Labor Department reported for June，这是句子的主要部分，表达的是许多人谈论到劳工部为六月份报告的288,000个新工作岗位这一观点。其中 \"Many people\" 是主语，\"talked of\" 是谓语，\"the 288,000 new jobs the Labor Department reported for June\" 是宾语。\n\n并列句：along with the drop in the unemployment rate to 6.1 percent, as good news，这部分并列于主句，进一步提出了失业率下降到6.1%，这是个好消息这一观点。\n\n**4. 语法分析**\n\n这个句子主要使用了并列结构和倒装句式，\"along with the drop in the unemployment rate to 6.1 percent\" 是一个并列结构，表示与前面的内容并列的另一项内容。\"as good news\" 是一个倒装句式，正常的句子应该是 \"it is good news\"，但为了强调，将 \"as good news\" 放在了开头。\n\n**5. 知识点总结**\n\n1. **并列结构的使用**：并列结构是一种常见的句子结构，用于连接两个或多个相同类型的句子成分，比如主语、谓语、宾语等。在这句话中，\"the 288,000 new jobs the Labor Department reported for June\" 和 \"the drop in the unemployment rate to 6.1 percent\" 就是两个并列的宾语。\n\n1. **倒装句的使用**：倒装句是一种特殊的句子结构，它将动词放在主语之前，以达到强调或者修辞的效果。在这句话中，\"as good news\" 就是一个倒装结构。\n\n**6. 练习相似句子**\n\n1. Everyone is talking about the 200,000 new jobs the Labor Department reported for May, along with the drop in the unemployment rate to 5.8%, this is good news.\n1. Many people are discussing the new educational policies the Department of Education announced for this semester, and the increase in graduation rates, which is considered a good thing.\n\n1. 大家都在谈论劳工部为五月份报告的200,000个新的工作岗位，以及失业率下降到5.8%，这是一个好消息。\n1. 许多人讨论到教育部为本学期公布的新的教育政策，以及毕业率的提高，这被视为是一件好事。"},{"text":"And they were right.","explainMd":"**1. 翻译**\n\n\"他们是对的。\"\n\n**2. 词汇和短语**\n\n- They: 他们，第三人称复数代词，常用来指代前文提到的多个人或事物。\n- Were: 是，动词 \"be\" 的过去式，用来描述在过去发生的状态或动作。\n- Right: 对的，形容词，常用来表示某个观点或判断的正确性。\n\n**3. 句子结构**\n\n这是一个简单句，其结构为：主语 + 谓语 + 宾语。具体分析如下：\n\n主语：They，这是句子的主体部分，指代的是前文中提到的一些人。\n\n谓语：Were，这是句子的动作部分，表示的是这些人的状态。\n\n宾语：Right，这是句子的描述部分，用来形容这些人的判断是正确的。\n\n**4. 语法分析**\n\n这个句子使用了简单的一般过去时态，表示的是在过去某个时间点发生的动作或状态。在这个句子中，\"were\" 是动词 \"be\" 的过去式，用来表示在过去的状态。\n\n**5. 知识点总结**\n\n1. **一般过去时的使用**：一般过去时是一个常见的时态，用来描述在过去某个时间点发生的动作或状态。在这个句子中，\"were\" 就是一个一般过去时的动词。\n1. **代词的使用**：代词是一种常见的词类，用来代替名词或者名词短语，避免重复。在这个句子中，\"they\" 就是一个代词，代替了前文中提到的一些人。\n\n**6. 练习相似句子**\n\n\"They were wrong.\"\n\"他们是错的。\""},{"text":"For now it appears the economy is creating jobs at a decent pace.","explainMd":"**1. 翻译**\n\n\"目前看来，经济正在以合理的速度创造就业机会。\"\n\n**2. 词汇和短语**\n\n- Appears: 看来，动词，用于表示某件事情的表面或者初步看起来的情况。\n- Economy: 经济，名词，通常指一个国家或地区的产业和贸易的总体状况。\n- Creating: 创造，动词，表示产生新的事物或者情况。\n- Jobs: 就业机会，名词，指的是能够提供给人们工作和收入的机会。\n- Decent: 合理的，形容词，用来形容某件事物的质量或者水平在可接受的范围内。\n- Pace: 速度，名词，表示事情进行或者发展的快慢。\n\n**3. 句子结构**\n\n这是一个简单句，其结构为：主语 + 谓语 + 宾语。具体分析如下：\n\n主语：It，这是句子的主体部分，通常用来指代前文提到的某个情况或者事物。\n\n谓语：Appears，这是句子的动作部分，表示的是对主语的观察或者判断。\n\n宾语：The economy is creating jobs at a decent pace，这是句子的描述部分，用来具体说明这个观察或者判断的内容。\n\n**4. 语法分析**\n\n这个句子使用了一般现在时态，“appears”作为谓语动词，表示对当前情况的观察或者描述。同时，句子的宾语部分使用了现在进行时态，\"is creating\" 表示的是一个正在进行的动作，即经济正在创造就业机会。\n\n**5. 知识点总结**\n\n1. **一般现在时的使用**：一般现在时是一个常见的时态，用来描述事实、习惯、常态或者对当前情况的观察和描述。在这个句子中，\"appears\" 是一个一般现在时的动词。\n1. **现在进行时的使用**：现在进行时用来描述正在发生的动作或者状态。在这个句子中，\"is creating\" 是一个现在进行时的动词短语。\n\n**6. 练习相似句子**\n\n1. \"For now it seems the company is making profit at a steady rate.\"\\\n   \"目前看来，公司正在以稳定的速度获取利润。\""},{"text":"We still have a long way to go to get back to full employment, but at least we are now finally moving forward at a faster pace.","explainMd":"**1. 翻译**\n\n\"我们仍然需要走很长的路才能回到充分就业，但至少我们现在终于以更快的速度向前迈进了。\"\n\n**2. 词汇和短语**\n\n- Long way to go: 需要走很长的路，短语，用于表示还有很大的工作要做，或者还有很长的路要走才能达到某个目标。\n- Get back to: 回到，短语，表示返回到某个状态或位置。\n- Full employment: 充分就业，短语，经济学术语，表示劳动力市场上的就业人口与求职者之间的平衡状态，也就是说所有寻求工作的人都能找到工作。\n- Moving forward: 向前迈进，短语，表示事情的进展或者发展。\n\n**3. 句子结构**\n\n这是一个复杂句，其结构为：主句 + 但是 + 从句。具体分析如下：\n\n主句：We still have a long way to go to get back to full employment，这是句子的主要部分，表达的是我们仍然需要走很长的路才能回到充分就业这一观点。\n\n从句：but at least we are now finally moving forward at a faster pace，这部分是从句，表达的是尽管情况艰难，但至少我们现在终于以更快的速度向前迈进了这一观点。\n\n**4. 语法分析**\n\n这个句子使用了一般现在时态，包括\"have\"和\"are\"这两个谓语动词，表示的是对当前情况的描述和观察。同时，\"moving forward\" 是一个现在进行时的动词短语，表示正在进行的动作。\n\n**5. 知识点总结**\n\n1. **一般现在时的使用**：一般现在时是一个常见的时态，用来描述事实、习惯、常态或者对当前情况的观察和描述。在这个句子中，\"have\"和\"are\"都是一般现在时的动词。\n1. **现在进行时的使用**：现在进行时用来描述正在发生的动作或者状态。在这个句子中，\"moving forward\" 是一个现在进行时的动词短语。\n1. **\"but\"的使用**： \"but\" 是一个并列连词，用来连接两个对比或相对的观点或事实。在这个句子中，\"but\" 连接了主句和从句，表达了一个尽管…但是…的意思。\n\n**6. 练习相似句子**\n\n\"We still have a long way to go to achieve equality, but at least we are now finally making progress.\"\\\n\"我们仍然需要走很长的路才能实现平等，但至少我们现在终于在取得进步。\""}]},{"sentences":[{"text":"However, there is another important part of the jobs picture that was largely overlooked.","explainMd":"**1. 翻译**\n\n\"然而，就业情况的另一个重要部分在很大程度上被忽视了。\"\n\n**2. 词汇和短语**\n\n- Overlooked: 被忽视，动词，指的是忽略或不注意某事物。\n- Jobs picture: 就业情况，短语，用于描述就业市场的总体状况或景象。\n\n**3. 句子结构**\n\n这是一个简单句，其结构为：主句。具体分析如下：\n\n主句：However, there is another important part of the jobs picture that was largely overlooked，这是句子的主要部分，表达的是就业情况的另一个重要部分在很大程度上被忽视了这一观点。\n\n其中，“there is another important part of the jobs picture” 是主语，“was” 是谓语，“largely overlooked” 是宾语。\n\n**4. 语法分析**\n\n这个句子使用了一般过去时态，包含了谓语动词 \"was\"，表示的是过去的状态或事件。\"largely overlooked\" 是一个被动语态的短语，表示的是就业情况的另一个重要部分被忽视的状态。\n\n**5. 知识点总结**\n\n1. **一般过去时的使用**：一般过去时是一个常见的时态，用来描述在过去发生的事情或者状态。在这个句子中，\"was\" 是一般过去时的动词。\n1. **被动语态的使用**：被动语态用来表达主语是动作的承受者，而不是动作的发起者。在这个句子中，\"largely overlooked\" 是一个被动语态的动词短语。\n1. **\"However\"的使用**： \"However\" 是一个转折连接词，用来引入一个与前面的观点或事实相对的新观点或事实。在这个句子中，\"However\" 用来引入了一个新的观点，即就业情况的另一个重要部分被忽视了。\n\n**6. 练习相似句子**\n\n\"However, there is another crucial aspect of the environmental issue that was largely neglected.\"\\\n\"然而，环境问题的另一个关键方面在很大程度上被忽视了。\""},{"text":"There was a big jump in the number of people who report voluntarily working part-time.","explainMd":"**1. 翻译**\n\n\"自愿选择兼职工作的人数有了大幅度的增长。\"\n\n**2. 词汇和短语**\n\n- Big jump: 大幅度的增长，短语，用来描述数量或程度上的大幅度提高。\n- Voluntarily: 自愿地，副词，描述动作是出于个人的意愿而进行的。\n- Working part-time: 兼职工作，短语，指的是不是全职的工作，通常每周工作时间少于35小时。\n\n**3. 句子结构**\n\n这是一个简单句，其结构为：主句。具体分析如下：\n\n主句：There was a big jump in the number of people who report voluntarily working part-time，这是句子的主要部分，表达的是自愿选择兼职工作的人数有了大幅度的增长这一观点。\n\n其中，“There was a big jump in the number of people” 是主语，“report” 是谓语，“voluntarily working part-time” 是宾语。\n\n**4. 语法分析**\n\n这个句子使用了一般过去时态，包含了谓语动词 \"was\"，表示的是过去的状态或事件。\"voluntarily working part-time\" 是一个现在分词短语，作为宾语，表示人们自愿选择的兼职工作的状态。\n\n**5. 知识点总结**\n\n1. **一般过去时的使用**：一般过去时是一个常见的时态，用来描述在过去发生的事情或者状态。在这个句子中，\"was\" 是一般过去时的动词。\n1. **现在分词的使用**：现在分词通常用作形容词或者副词，描述主语的状态或者动作。在这个句子中，\"voluntarily working part-time\" 是一个现在分词短语，描述人们自愿选择的兼职工作的状态。\n1. **\"big jump\"的使用**： \"big jump\" 是一个常见的短语，用来描述某种数量或程度的大幅度增长。在这个句子中，\"big jump\" 用来描述自愿兼职工作的人数的大幅度增长。\n\n**6. 练习相似句子**\n\n\"There was a significant increase in the number of students who voluntarily chose online learning.\"\\\n\"选择自愿在线学习的学生数量有了显著的增长。\""},{"text":"This figure is now 830,000 (4.4 percent) above its year ago level.","explainMd":"**1. 翻译**\n\n\"该数据现在比一年前的水平高出830,000（4.4%）。\"\n\n**2. 词汇和短语**\n\n- Figure: 数据，名词，表示量化的数值或统计信息。\n- Above its year ago level: 比一年前的水平高，短语，用来描述当前与过去某一时间点的比较。\n\n**3. 句子结构**\n\n这是一个简单句，其结构为：主句。具体分析如下：\n\n主句：This figure is now 830,000 (4.4 percent) above its year ago level，这是句子的主要部分，表达的是当前数据比一年前的水平高出830,000（4.4%）。\n\n其中，“This figure” 是主语，“is” 是谓语，“now 830,000 (4.4 percent) above its year ago level” 是宾语。\n\n**4. 语法分析**\n\n这个句子使用了一般现在时态，包含了谓语动词 \"is\"，表示的是现在的状态或事件。\"above its year ago level\" 是一个介词短语，作为宾语，表示当前数据与一年前的比较结果。\n\n**5. 知识点总结**\n\n1. **一般现在时的使用**：一般现在时是一个常见的时态，用来描述现在的事情或者状态。在这个句子中，\"is\" 是一般现在时的动词。\n1. **介词短语的使用**：介词短语通常用来表示位置、方向、时间、原因等关系。在这个句子中，\"above its year ago level\" 是一个介词短语，描述当前数据与一年前的比较结果。\n1. **\"figure\"的使用**： \"figure\" 是一个常见的名词，用来表示量化的数值或统计信息。在这个句子中，\"figure\" 用来表示某个具体的数据。\n\n**6. 练习相似句子**\n\n\"The population of the city is now 200,000 (10 percent) above its level ten years ago.\"\\\n\"这个城市的人口现在比十年前的水平高出200,000（10%）。\""}]},{"sentences":[{"text":"Before explaining the connection to the Obamacare, it is worth making an important distinction.","explainMd":"**1. 翻译**\n\n\"在解释与奥巴马医保的关系之前，有必要做一个重要的区分。\"\n\n**2. 词汇和短语**\n\n- Explain: 解释，动词，表示讲明或阐述某事物、观点、理论等的意义或原理。\n- Connection: 关系，名词，表示两者之间的联系或联系点。\n- Obamacare: 奥巴马医保，专有名词，指美国前总统奥巴马在任期间推出的一项重要的医疗保险改革计划，正式名称为“平价医疗法案”。\n- Distinction: 区分，名词，表示区别或分辨两个或多个事物的过程或结果。\n\n**3. 句子结构**\n\n这是一个复合句，其结构为：主句 + 并列句。具体分析如下：\n\n主句：Before explaining the connection to the Obamacare，这是句子的主要部分，表达的是“在解释与奥巴马医保的关系之前”。\n\n并列句：it is worth making an important distinction，这部分并列于主句，进一步提出了“有必要做一个重要的区分”。\n\n在主句中，“Before explaining the connection to the Obamacare” 是状语，“is” 是谓语。在并列句中，“it” 是主语，“is worth” 是谓语，“making an important distinction” 是宾语。\n\n**4. 语法分析**\n\n这个句子中使用了一般现在时态，包含了谓语动词 \"is\"，表示的是现在的状态或建议。\"Before explaining the connection to the Obamacare\" 是一个时间状语从句，用来表示动作的先后顺序。\"making an important distinction\" 是一个动名词短语，做宾语，表示需要执行的动作。\n\n**5. 知识点总结**\n\n1. **时间状语从句的使用**：时间状语从句是一个常见的语法结构，用来表示动作的先后顺序。在这个句子中，\"Before explaining the connection to the Obamacare\" 是一个时间状语从句，表达了在解释与奥巴马医保的关系之前的情境。\n1. **动名词的使用**：动名词是动词的一种形式，可以在句子中作为名词使用。在这个句子中，\"making an important distinction\" 是一个动名词短语，作为宾语，表示需要执行的动作。\n1. **\"worth\"的使用**： \"worth\" 是一个形容词，通常后接动名词，表示某事值得做。在这个句子中，\"it is worth making an important distinction\" 的意思是“值得做一个重要的区分”。\n\n**6. 练习相似句子**\n\n\"Before discussing the impact of climate change, it's crucial to understand the science behind it.\"\\\n\"在讨论气候变化的影响之前，理解其背后的科学原理是至关重要的。\""},{"text":"Many people who work part-time jobs actually want full-time jobs.","explainMd":"**1. 翻译**\n\n\"许多兼职工作的人实际上是希望从事全职工作的。\"\n\n**2. 词汇和短语**\n\n- Part-time jobs: 兼职工作，指非全日制的工作，通常工作时间少于标准的全职工作小时数。\n- Full-time jobs: 全职工作，指全日制的工作，通常是每周工作40小时。\n\n**3. 句子结构**\n\n这是一个简单句，其结构为：主句。\n\n主句：Many people who work part-time jobs actually want full-time jobs，这是句子的主要部分，表达的是“许多兼职工作的人实际上是希望从事全职工作的”。\n\n在主句中，“Many people” 是主语，“work part-time jobs” 是定语从句修饰主语，“actually want” 是谓语，“full-time jobs” 是宾语。\n\n**4. 语法分析**\n\n这个句子中使用了一般现在时态，包含了谓语动词 \"want\"，表示的是现在的状态或需求。\"who work part-time jobs\" 是一个定语从句，用来修饰主语 \"Many people\"。\n\n**5. 知识点总结**\n\n1. **定语从句的使用**：定语从句是一个常见的语法结构，用来修饰名词或代词。在这个句子中，\"who work part-time jobs\" 是一个定语从句，修饰主语 \"Many people\"，表达了主语的特征或状态。\n1. **\"actually\"的使用**： \"actually\" 是一个副词，用于强调事实或现实情况。在这个句子中，\"actually want\" 的意思是“实际上想要”，表示了一个对比或实际情况。\n\n**6. 练习相似句子**\n\n\"Most students who study abroad actually desire to find a job overseas.\"\\\n\"大多数出国留学的学生实际上是希望能在海外找到一份工作。\""},{"text":"They take part-time work because this is all they can get.","explainMd":"**1. 翻译**\n\n\"他们接受兼职工作，因为这是他们能找到的所有工作。\"\n\n**2. 词汇和短语**\n\n- Take part-time work: 接受兼职工作，\"take\" 在这里用作动词，表达的是接受或采纳的意思，\"part-time work\" 是宾语，指的是非全日制的工作。\n- Because: 因为，表示原因或理由的连词。\n- This is all they can get: 这是他们能找到的所有工作，\"all they can get\" 是一个短语，表达的是他们能够得到的所有东西或机会的意思。\n\n**3. 句子结构**\n\n这是一个复合句，其结构为：主句 + 从句。具体分析如下：\n\n主句：\"They take part-time work\"，这是句子的主要部分，表达的是他们接受兼职工作这一行为。\"They\" 是主语，\"take\" 是谓语，\"part-time work\" 是宾语。\n\n从句：\"because this is all they can get\"，这部分是原因状语从句，解释了他们为什么会接受兼职工作。\"this\" 是主语，\"is\" 是谓语，\"all they can get\" 是宾语。\n\n**4. 语法分析**\n\n这个句子使用了一般现在时态，包含了谓语动词 \"take\" 和 \"is\"，表示的是一种持续的状态或现状。\"because\" 引导的原因状语从句用来解释主句的原因或理由。\n\n**5. 知识点总结**\n\n1. **一般现在时的使用**：一般现在时常用来表达习惯、状态、普遍真理等。在这个句子中，\"They take part-time work\" 和 \"this is all they can get\" 都是一般现在时态，表示的是一种持续的状态或现状。\n\n1. **原因状语从句的使用**：原因状语从句通常由连词 \"because\", \"since\", \"as\" 等引导，用来表示原因或理由。在这个句子中，\"because this is all they can get\" 是一个原因状语从句，解释了主句的原因。\n\n**6. 练习相似句子**\n\n\"They seek online tutoring because it is the only flexible option they have.\"\\\n\"他们寻求在线辅导，因为这是他们唯一灵活的选择。\""},{"text":"An increase in involuntary part-time work is evidence of weakness in the labor market and it means that many people will be having a very hard time making ends meet.","explainMd":"**1. 翻译**\n\n\"兼职工作的增加是劳动市场疲软的证据，这意味着许多人将非常难以维持生计。\"\n\n**2. 词汇和短语**\n\n- Increase in involuntary part-time work: 兼职工作的增加，这里的 \"increase\" 是名词，表示的是增加或上升的意思，\"involuntary part-time work\" 指的是非自愿的兼职工作。\n- Evidence of weakness in the labor market: 劳动市场疲软的证据，\"evidence\" 是名词，表示的是证据或证明的意思，\"weakness in the labor market\" 是一个短语，表示的是劳动市场的疲软或弱点。\n- Having a very hard time making ends meet: 非常难以维持生计， \"having a hard time\" 是一个短语，表示的是遇到困难或难以应对的意思， \"making ends meet\" 是一个固定短语，表示的是维持生计或使收支平衡。\n\n**3. 句子结构**\n\n这是一个复杂句，其结构为：主句 + 并列句。具体分析如下：\n\n主句：\"An increase in involuntary part-time work is evidence of weakness in the labor market\"，这是句子的主要部分，表达的是兼职工作的增加是劳动市场疲软的证据这一观点。 \"An increase in involuntary part-time work\" 是主语，\"is\" 是谓语，\"evidence of weakness in the labor market\" 是宾语。\n\n并列句：\"it means that many people will be having a very hard time making ends meet\"，这部分并列于主句，进一步提出了这意味着许多人将非常难以维持生计这一观点。 \"it\" 是主语， \"means\" 是谓语， \"that many people will be having a very hard time making ends meet\" 是宾语。\n\n**4. 语法分析**\n\n这个句子使用了现在时态，包含了谓语动词 \"is\" 和 \"means\"，表示的是一种现状或事实。\"that\" 引导的宾语从句用来解释 \"it means\" 的具体内容。\n\n**5. 知识点总结**\n\n1. **现在时的使用**：现在时常用来表达现状、事实、普遍真理等。在这个句子中，\"An increase in involuntary part-time work is evidence of weakness in the labor market\" 和 \"it means that many people will be having a very hard time making ends meet\" 都是现在时态，表示的是一种事实或现状。\n\n1. **宾语从句的使用**：宾语从句通常由连词 \"that\", \"if\", \"whether\" 等引导，用来作为动词或介词的宾语。在这个句子中，\"that many people will be having a very hard time making ends meet\" 是一个宾语从句，是 \"means\" 的宾语。\n\n**6. 练习相似句子**\n\n\"The rise in unemployment rates is an indication of the economic downturn, meaning more people will struggle to keep their lives going.\"\\\n\"失业率的上升是经济下滑的指标，这意味着更多的人将挣扎以维持生活。\""}]},{"sentences":[{"text":"There was an increase in involuntary part-time in June, but the general direction has been down.","explainMd":"**1. 翻译**\n\n\"六月份非自愿兼职工作有所增加，但总体趋势是下降的。\"\n\n**2. 词汇和短语**\n\n- Involuntary part-time: 非自愿的兼职工作。\"Involuntary\" 是形容词，表示的是非自愿的，\"part-time\" 是名词，表示的是兼职工作。\n- Increase: 增加。在这里，\"increase\" 是名词，表示的是上升或增加的意思。\n- General direction: 总体方向。\"General\" 是形容词，表示的是总的，大体的，\"direction\" 是名词，表示的是方向或趋势。\n- Been down: 下降的。这是一个固定的短语，表示的是降低或下降的意思。\n\n**3. 句子结构**\n\n这是一个简单句，其结构为：主句。具体分析如下：\n\n主句：\"There was an increase in involuntary part-time in June, but the general direction has been down\"，这是句子的主要部分，表达的是六月份非自愿兼职工作有所增加，但总体趋势是下降的这一观点。\"There was an increase in involuntary part-time in June\" 是主语，\"but\" 是连词，\"the general direction has been down\" 是谓语。\n\n**4. 语法分析**\n\n这个句子使用了过去时态，包含了谓语动词 \"was\" 和 \"has been\"，表示的是一种过去的事实或现状。\"but\" 用作连词，用来连接两个对比的句子或词汇。\n\n**5. 知识点总结**\n\n1. **过去时的使用**：过去时常用来表达过去发生的事件或状态。在这个句子中，\"There was an increase in involuntary part-time in June\" 和 \"the general direction has been down\" 都是过去时态，表示的是过去的一种事实或现状。\n\n1. **对比句的使用**：\"but\" 是一个对比连词，常用来连接两个对比的句子或词汇。在这个句子中，\"but\" 连接了 \"There was an increase in involuntary part-time in June\" 和 \"the general direction has been down\"，表示了一个对比关系。\n\n**6. 练习相似句子**\n\n\"The unemployment rate rose in July, but the overall trend is decreasing.\"\\\n\"七月份失业率上升，但总体趋势是下降的。\""},{"text":"Involuntary part-time employment is still far higher than before the recession, but it is down by 640,000 (7.9 percent) from its year ago level.","explainMd":"**1. 翻译**\n\n\"非自愿的兼职工作仍然比经济衰退前的水平高出很多，但比一年前减少了640,000个（降低了7.9%）。\"\n\n**2. 词汇和短语**\n\n- Involuntary part-time employment: 非自愿的兼职工作。\"Involuntary\" 是形容词，表示的是非自愿的，\"part-time employment\" 是名词，表示的是兼职工作。\n- Higher than: 高于。这是一个比较级的短语，表示的是一种比较的关系。\n- Recession: 经济衰退。\"Recession\" 是名词，表示的是经济衰退的状态。\n- Down by: 减少了。这是一个固定的短语，表示的是降低或减少的意思。\n\n**3. 句子结构**\n\n这是一个复杂句，其结构为：主句 + 并列句。具体分析如下：\n\n- 主句：\"Involuntary part-time employment is still far higher than before the recession\"，这是句子的主要部分，表达的是非自愿兼职工作仍然比经济衰退前的水平高出很多这一观点。\n- 并列句：\"but it is down by 640,000 (7.9 percent) from its year ago level\"，这部分并列于主句，进一步提出了它比一年前减少了640,000个（降低了7.9%）这一观点。\n\n**4. 语法分析**\n\n这个句子使用了现在时态，包含了谓语动词 \"is\"，表示的是一种现在的事实或现状。\"but\" 用作连词，用来连接两个对比的句子或词汇。\n\n**5. 知识点总结**\n\n1. **现在时的使用**：现在时常用来表达现在的事实或状态。在这个句子中，\"Involuntary part-time employment is still far higher than before the recession\" 是现在时态，表示的是现在的一种事实或现状。\n\n1. **对比句的使用**：\"but\" 是一个对比连词，常用来连接两个对比的句子或词汇。在这个句子中，\"but\" 连接了 \"Involuntary part-time employment is still far higher than before the recession\" 和 \"it is down by 640,000 (7.9 percent) from its year ago level\"，表示了一个对比关系。\n\n**6. 练习相似句子**\n\n\"The rate of unemployment is still significantly higher than before the financial crisis, but it has decreased by 2% compared to last year.\"\\\n\"失业率仍然比金融危机前高出很多，但与去年相比已经下降了2%。\""}]},{"sentences":[{"text":"We know the difference between voluntary and involuntary part-time employment because people tell us.","explainMd":"**1. 翻译**\n\n\"我们知道自愿和非自愿兼职工作的区别，因为人们告诉我们。\"\n\n**2. 词汇和短语**\n\n- Voluntary: 自愿的。这是一个形容词，表示的是自愿的或者自发的。\n- Involuntary: 非自愿的。这也是一个形容词，表示的是非自愿的或者被迫的。\n- Part-time employment: 兼职工作。这是一个名词短语，表示的是兼职工作。\n\n**3. 句子结构**\n\n这是一个简单句，其主要结构为：主语 + 谓语 + 宾语。具体分析如下：\n\n- 主语：We\n- 谓语：know\n- 宾语：the difference between voluntary and involuntary part-time employment\n\n\"because people tell us\" 是一个原因状语从句，解释了我们为何知道自愿和非自愿兼职工作的区别。\n\n**4. 语法分析**\n\n这个句子使用了现在时态，包含了谓语动词 \"know\"，表示的是一种现在的事实或现状。\"because\" 用作连词，引导一个原因状语从句。\n\n**5. 知识点总结**\n\n1. **现在时的使用**：现在时常用来表达现在的事实或状态。在这个句子中，\"We know the difference between voluntary and involuntary part-time employment\" 是现在时态，表示的是现在的一种事实或现状。\n\n1. **原因状语从句的使用**：\"because\" 是一个原因连词，常用来引导原因状语从句。在这个句子中，\"because people tell us\" 是一个原因状语从句，解释了我们为何知道自愿和非自愿兼职工作的区别。\n\n**6. 练习相似句子**\n\n\"We understand the difference between honesty and dishonesty because people show us.\"\\\n\"我们理解诚实和不诚实的区别，因为人们向我们展示。\""},{"text":"The survey used by the Labor Department asks people if they worked less than 35 hours in the reference week.","explainMd":"**1. 翻译**\n\n\"劳工部使用的调查问卷会询问人们在参考周内是否工作不满35小时。\"\n\n**2. 词汇和短语**\n\n- Labor Department: 劳工部。这是一个名词短语，通常指的是一个国家或地区的政府部门，负责管理与劳工相关的事务。\n- Survey: 调查。这是一个名词，用来描述一种收集数据或信息的方式，通常涉及向一组人提问。\n- Reference week: 参考周。这是一个名词短语，通常在统计或调查中使用，用来指代调查所涉及的特定时间段。\n\n**3. 句子结构**\n\n这是一个简单句，其主要结构为：主语 + 谓语 + 宾语。具体分析如下：\n\n- 主语：The survey used by the Labor Department\n- 谓语：asks\n- 宾语：people if they worked less than 35 hours in the reference week\n\n**4. 语法分析**\n\n这个句子使用了现在时态，包含了谓语动词 \"asks\"，表示的是一种现在的事实或现状。这个句子中的宾语是一个宾语从句 \"if they worked less than 35 hours in the reference week\"，宾语从句用来详细说明主语（调查）询问的具体内容。\n\n**5. 知识点总结**\n\n1. **现在时态的使用**：现在时常用来表达现在的事实或状态。在这个句子中，\"The survey used by the Labor Department asks people if they worked less than 35 hours in the reference week\" 是现在时态，表示的是现在的一种事实或现状。\n\n1. **宾语从句的使用**：宾语从句用来详细说明动词的宾语。在这个句子中，\"if they worked less than 35 hours in the reference week\" 是一个宾语从句，详细说明了调查问卷询问的具体内容。\n\n**6. 练习相似句子**\n\n\"The questionnaire used by the health department asks people if they eat fruits and vegetables every day.\"\\\n\"卫生部使用的问卷调查会询问人们是否每天吃水果和蔬菜。\""},{"text":"If the answer is “yes,” they are classified as working part-time.","explainMd":"**1. 翻译**\n\n\"如果答案是'是'，他们就被归类为兼职工作。\"\n\n**2. 词汇和短语**\n\n- Answer: 答案。这是一个名词，通常用来指回答一个问题或解决一个问题的方式或事实。\n- Classified: 被归类。这是一个动词，通常用来指将某人或某事按照某种标准或系统进行分类或安排。\n- Part-time: 兼职的。这是一个形容词，用来描述一种工作方式，通常指的是不是全职（full-time）的工作。\n\n**3. 句子结构**\n\n这是一个简单句，其主要结构为：主语 + 谓语 + 宾语。具体分析如下：\n\n- 主语：they\n- 谓语：are classified\n- 宾语：as working part-time\n\n**4. 语法分析**\n\n这个句子使用了被动语态，包含了谓语动词 \"are classified\"，表示的是一种被别人做的动作。在这个句子中，\"they are classified as working part-time\" 是被动语态，表示的是他们被别人（可能是调查者或劳工部）分类为兼职工作者。\n\n**5. 知识点总结**\n\n1. **被动语态的使用**：被动语态常用来表示一种被别人做的动作。在这个句子中，\"they are classified as working part-time\" 是被动语态，表示的是他们被别人（可能是调查者或劳工部）分类为兼职工作者。\n\n1. **形容词的使用**：形容词用来修饰名词，描述名词的特征或状态。在这个句子中，\"part-time\" 是一个形容词，用来修饰 \"working\"，描述工作的方式或状态。\n\n**6. 练习相似句子**\n\n\"If the answer is 'no,' they are classified as full-time workers.\"\\\n\"如果答案是'否'，他们就被归类为全职工作。\""},{"text":"The survey then asks whether they worked less than 35 hours in that week because they wanted to work less than full time or because they had no choice.","explainMd":"**1. 翻译**\n\n\"调查接着询问他们是否在本周工作少于35小时，是因为他们想要少于全职工作，还是他们别无选择。\"\n\n**2. 词汇和短语**\n\n- Survey: 调查。这是一个名词，通常用来指通过向一组人问问题并记录答案来收集信息的过程或活动。\n- Want: 想要。这是一个动词，通常用来表示有某种需求或愿望。\n- Full-time: 全职的。这是一个形容词，用来描述一种工作方式，通常指的是全职（full-time）的工作。\n- Choice: 选择。这是一个名词，通常用来指在几种可能的行动或事物中做出的决定。\n\n**3. 句子结构**\n\n这是一个复合复杂句，其结构为：主句 + 并列从句。具体分析如下：\n\n主句：The survey then asks\n并列从句：whether they worked less than 35 hours in that week because they wanted to work less than full time or because they had no choice\n\n主句中：\n\n- 主语：The survey\n- 谓语：asks\n\n并列从句中：\n\n- 主语：they\n- 谓语：worked\n- 宾语：less than 35 hours in that week\n- 状语：because they wanted to work less than full time or because they had no choice\n\n**4. 语法分析**\n\n这个句子使用了间接引语报告询问内容。它使用 \"whether\" 引导的间接问句，表达的是调查问他们是否在那周工作时间少于35小时，是因为他们想要工作时间少于全职，还是因为他们别无选择。\n\n**5. 知识点总结**\n\n1. **间接引语的使用**：间接引语通常用来转述他人的话语或思想。在这个句子中，使用了 \"whether\" 引导的间接问句，表达的是调查问他们是否在那周工作时间少于35小时，是因为他们想要工作时间少于全职，还是因为他们别无选择。\n1. **并列连词的使用**：并列连词 \"or\" 用来连接两个并列的元素，表示选择关系。在这个句子中，\"or\" 连接了两个原因状语，表示他们工作时间少于35小时的两种可能原因。\n\n**6. 练习相似句子**\n\n\"The teacher then asks whether they did the homework because they wanted to learn or because they had no choice.\"\n\"老师接着询问他们是否做了作业，是因为他们想要学习，还是他们别无选择。\""},{"text":"They are only classified as voluntary part-time workers if they tell the survey taker they chose to work less than 35 hours a week.","explainMd":"**1. 翻译**\n\n\"只有当他们告诉调查员他们选择一周工作少于35小时的时候，他们才被分类为自愿的兼职工作者。\"\n\n**2. 词汇和短语**\n\n- Classified: 分类。这是一个动词，通常用于将某物或某人归入某个类别。\n- Voluntary: 自愿的。这是一个形容词，表示自愿进行某项行为或活动。\n- Part-time: 兼职。这是一个形容词，用于描述工作时间少于全职的工作。\n- Survey taker: 调查员。这是一个名词短语，指的是进行调查或收集数据的人。\n\n**3. 句子结构**\n\n这是一个简单句，其结构为：主句。具体分析如下：\n\n主句：They are only classified as voluntary part-time workers if they tell the survey taker they chose to work less than 35 hours a week.\n\n主句中：\n\n- 主语：They\n- 谓语：are classified\n- 宾语：as voluntary part-time workers\n- 状语：if they tell the survey taker they chose to work less than 35 hours a week\n\n**4. 语法分析**\n\n这个句子使用了条件句（\"if\"引导的从句）来表达一个条件。主句中使用了被动语态，表示他们被分类的行为。\n\n**5. 知识点总结**\n\n1. **条件句的使用**：条件句通常用来表示一种假设或条件，如果这个条件满足，那么就会有某种结果或后果。在这个句子中，\"if\" 引导的条件句表示只有当他们告诉调查员他们选择一周工作少于35小时的时候，他们才被分类为自愿的兼职工作者。\n1. **被动语态的使用**：被动语态通常用来强调动作的接收者，而不是动作的执行者。在这个句子中，主句使用了被动语态，强调了他们（They）被分类的状态，而不是进行分类的动作。\n\n**6. 练习相似句子**\n\n\"They are only classified as successful students if they tell the teacher they have completed all the assignments.\"\n\"只有当他们告诉老师他们已经完成了所有的作业，他们才被分类为成功的学生。\""}]},{"sentences":[{"text":"The issue of voluntary part-time relates to Obamacare because one of the main purposes was to allow people to get insurance outside of employment.","explainMd":"**1. 翻译**\n\n\"自愿兼职的问题与奥巴马医改有关，因为这其中的一个主要目标就是让人们能够在就业之外获得保险。\"\n\n**2. 词汇和短语**\n\n- Issue: 问题。这是一个名词，通常用于指需要讨论、解决或考虑的事情或主题。\n- Relates to: 与...有关。这是一个短语，用来表示两个或更多的事物之间的关系或连接。\n- Obamacare: 奥巴马医改。这是一个名词，指的是由前美国总统巴拉克·奥巴马推动的一项重大的医疗保健改革。\n- Voluntary part-time: 自愿兼职。这是一个形容词+名词的短语，用于描述那些选择工作时间少于全职的工作的人。\n- Insurance: 保险。这是一个名词，通常指的是为了防止特定损失或损害而提供的保护，通常需要支付一定的费用。\n- Employment: 就业。这是一个名词，通常用于描述一个人有工作并获得报酬的状态。\n\n**3. 句子结构**\n\n这是一个简单句，其结构为：主句。具体分析如下：\n\n主句：The issue of voluntary part-time relates to Obamacare because one of the main purposes was to allow people to get insurance outside of employment.\n\n主句中：\n\n- 主语：The issue of voluntary part-time\n- 谓语：relates to\n- 宾语：Obamacare\n- 状语：because one of the main purposes was to allow people to get insurance outside of employment\n\n**4. 语法分析**\n\n这个句子使用了因果关系的状语从句（\"because\"引导的从句）来表达原因。主句中使用了现在时态，表示当前的状态或事实。\n\n**5. 知识点总结**\n\n1. **因果关系的状语从句的使用**：在英语中，我们通常使用\"because\", \"since\", \"as\"等词来引导因果关系的状语从句。在这个句子中，\"because\" 引导的状语从句表示自愿兼职的问题与奥巴马医改有关的原因。\n1. **现在时态的使用**：现在时态通常用来表示现在的状态、习惯、真理等。在这个句子中，主句使用了现在时态，表示当前的状态或事实。\n\n**6. 练习相似句子**\n\n\"The issue of climate change relates to industrial pollution because one of the main causes is the emission of greenhouse gases.\"\n\"气候变化的问题与工业污染有关，因为其中一个主要原因是温室气体的排放。\""},{"text":"For many people, especially those with serious health conditions or family members with serious health conditions, before Obamacare the only way to get insurance was through a job that provided health insurance.","explainMd":"**1. 翻译**\n\n\"对于许多人来说，特别是那些有严重健康问题或有家庭成员有严重健康问题的人，在奥巴马医改之前，获得保险的唯一方式就是通过提供健康保险的工作。\"\n\n**2. 词汇和短语**\n\n- Serious health conditions: 严重的健康问题。这是一个形容词+名词的短语，用于描述对健康有重大影响的疾病或状况。\n- Obamacare: 奥巴马医改。这是一个名词，指的是由前美国总统巴拉克·奥巴马推动的一项重大的医疗保健改革。\n- Health insurance: 健康保险。这是一个形容词+名词的短语，通常指的是为了防止医疗费用过高而提供的保护，通常需要支付一定的费用。\n\n**3. 句子结构**\n\n这是一个复合句，其结构为：主句 + 非限制性定语从句。具体分析如下：\n\n主句：For many people, the only way to get insurance was through a job that provided health insurance.\n主句中：\n\n- 主语：the only way\n- 谓语：was\n- 宾语：through a job that provided health insurance\n\n非限制性定语从句：especially those with serious health conditions or family members with serious health conditions, before Obamacare\n非限制性定语从句中：\n\n- 主语：those\n- 谓语：with\n- 宾语：serious health conditions or family members with serious health conditions, before Obamacare\n\n**4. 语法分析**\n\n这个句子使用了非限制性定语从句来对\"many people\"进行补充说明。主句中使用了过去时态，表示过去的状态或事实。\n\n**5. 知识点总结**\n\n1. **非限制性定语从句的使用**：在英语中，我们通常使用非限制性定语从句来对句子中的某一部分进行补充说明。在这个句子中，\"those with serious health conditions or family members with serious health conditions, before Obamacare\" 是一个非限制性定语从句，用来对\"many people\"进行补充说明。\n1. **过去时态的使用**：过去时态通常用来表示过去的状态、动作或习惯。在这个句子中，主句使用了过去时态，表示过去的状态或事实。\n\n**6. 练习相似句子**\n\n\"For many students, especially those from low-income families, before the scholarship program, the only way to attend college was through a part-time job that helped pay tuition.\"\n\"对于许多学生，特别是来自低收入家庭的学生，在奖学金计划之前，上大学的唯一方式就是通过提供学费帮助的兼职工作。\""}]},{"sentences":[{"text":"However, Obamacare has allowed more than 12 million people to either get insurance through Medicaid or the exchanges.","explainMd":"**1. 翻译**\n\n\"然而，奥巴马医保使超过1200万人能够通过医疗补助计划或者交易所获得保险。\"\n\n**2. 词汇和短语**\n\n- Obamacare: 奥巴马医保，它是美国前总统奥巴马实施的一项全民健康保险改革计划。\n- allowed: 允许，让某事成为可能。\n- insurance: 保险，一种为了防止财产、健康等损失而与保险公司签订的合同。\n- Medicaid: 医疗补助计划，美国的一项为低收入者提供医疗保险的联邦政府项目。\n- exchanges: 交易所，这里特指健康保险交易所，是个人和小企业可以购买健康保险的市场。\n\n**3. 句子结构**\n\n这是一个简单句，其结构为：主句。具体分析如下：\n\n主句：However, Obamacare has allowed more than 12 million people to either get insurance through Medicaid or the exchanges。\n\n主语：Obamacare\n谓语：has allowed\n宾语：more than 12 million people to either get insurance through Medicaid or the exchanges\n\n**4. 语法分析**\n\n这个句子使用了现在完成时态（has allowed），表示奥巴马医保至今已经让超过1200万人能够获得保险。同时，这个句子还使用了either...or...结构，表明这些人可以通过两种方式（医疗补助计划或交易所）获得保险。\n\n**5. 知识点总结**\n\n**知识点总结**:\n\n1. **现在完成时的使用**：这种时态主要用于描述过去发生的事情对现在产生的影响或结果。例如，在这句话中，\"Obamacare has allowed more than 12 million people to get insurance\" 使用了现在完成时，强调的是奥巴马医保至今的效果。\n\n1. **either...or...结构的使用**：这是一种并列结构，用于表达两种可能的选择或情况。例如，在这句话中，\"more than 12 million people to either get insurance through Medicaid or the exchanges\" 使用了 either...or... 结构，表示人们可以通过两种方式获取保险。\n\n**6. 练习相似句子**\n\nHowever, the new policy has allowed more than 20 million people to either receive educational resources through governmental programs or online platforms.\n\n然而，这项新政策使超过2000万人能够通过政府项目或在线平台接收教育资源。"},{"text":"These are people who may previously have felt the need to get a full-time job that provided insurance in order to cover themselves and their families.","explainMd":"**1. 翻译**\n\n\"这些人以前可能觉得他们需要找一份提供保险的全职工作，以便为自己和家人提供保险。\"\n\n**2. 词汇和短语**\n\n- Previously: 以前，此词用于表示过去的情况或状态。\n- Felt the need: 觉得有必要，这是一个常见的短语，用于描述人们认为有必要做某事。\n- Full-time job: 全职工作，对比于兼职工作，全职工作通常指一周工作时间至少35小时的工作。\n- Provided: 提供，这里指工作提供的保险。\n- Cover: 保护，覆盖，此处指提供保险保障。\n\n**3. 句子结构**\n\n这是一个简单句，其结构为：主句。具体分析如下：\n\n主句：These are people who may previously have felt the need to get a full-time job that provided insurance in order to cover themselves and their families.\n\n主语：These\n谓语：are\n宾语：people who may previously have felt the need to get a full-time job that provided insurance in order to cover themselves and their families\n\n**4. 语法分析**\n\n这个句子使用了一个定语从句（who may previously have felt the need to get a full-time job that provided insurance in order to cover themselves and their families）来修饰主语（people）。此外，定语从句中的\"to get a full-time job that provided insurance\"是一个目的状语从句，表示人们找全职工作的目的是为了获得保险。\n\n**5. 知识点总结**\n\n**知识点总结**:\n\n1. **定语从句的使用**：定语从句是一个从句，用来修饰某个名词或代词。例如，在这句话中，\"who may previously have felt the need to get a full-time job that provided insurance in order to cover themselves and their families\" 是一个定语从句，用来修饰 \"people\"。\n\n1. **目的状语从句的使用**：目的状语从句用来描述动作的目的或意图。例如，在这句话中，\"to get a full-time job that provided insurance\" 是一个目的状语从句，用来说明人们找全职工作的目的。\n\n**6. 练习相似句子**\n\nThese are students who may previously have felt the need to attend a traditional school to get a good education.\n\n这些学生以前可能觉得他们需要去传统学校接受教育以获得良好的教育。"},{"text":"With Obamacare there is no longer a link between employment and insurance.","explainMd":"**1. 翻译**\n\n\"因为奥巴马医保的存在，就业和保险之间不再存在联系。\"\n\n**2. 词汇和短语**\n\n- Obamacare: 奥巴马医保，这是美国前总统巴拉克·奥巴马推行的一项全民健康保险计划。\n- Link: 连接，关联，此处用于表示就业和保险之间的关系。\n- Employment: 就业，这是一个经济学术语，指的是有工作的状态。\n- Insurance: 保险，这是一个金融词汇，指的是通过保险合同转移风险的一种方式。\n\n**3. 句子结构**\n\n这是一个简单句，其结构为：主句。具体分析如下：\n\n主句：With Obamacare there is no longer a link between employment and insurance.\n\n主语：There\n谓语：is\n宾语：no longer a link between employment and insurance\n\n**4. 语法分析**\n\n这个句子使用了存在句型（there be），用于表述某种状态或事物的存在。同时，\"no longer\" 用于表达某种状态或事物已不再存在。\n\n**5. 知识点总结**\n\n**知识点总结**:\n\n1. **存在句型的使用**：存在句型是英语中的一种常见句型，用于表示某种状态或事物的存在。例如，在这句话中，\"there is no longer a link between employment and insurance\" 就是一个存在句型，用来表达就业和保险之间的联系已经不存在。\n\n1. **\"no longer\" 的使用**：这是一个常用的短语，用于表示某种状态或事物已不再存在。例如，在这句话中，\"there is no longer a link\" 表示就业和保险之间的联系已经不存在。\n\n**6. 练习相似句子**\n\nWith the internet, there is no longer a barrier between information and people.\n\n因为有了互联网，信息和人们之间不再有障碍。"}]}],"title":""}