{"translate":"","paragraphs":[{"sentences":[{"text":"For years, studies have found that first-generation college students—those who do not have a parent with a college degree—lag other students on a range of education achievement factors.","explainMd":"**1. 翻译**\n\n\"多年的研究发现，第一代大学生——那些父母没有大学学历的学生，在一系列的教育成就因素上落后于其他学生。\"\n\n**2. 词汇和短语**\n\n- **First-generation college students**：短语，指的是\"第一代大学生\"，通常指的是父母没有大学学历的学生。\n- **Lag**：动词，意为\"落后于\"，用于表示比较或竞争中的不利地位。\n- **Education achievement factors**：复合名词短语，指的是\"教育成就因素\"，可能包括成绩、毕业率、就业率等。\n\n**3. 句子结构**\n\n这是一个复杂句，其结构为：主句 + 非限定性定语从句。具体分析如下：\n\n主句：For years, studies have found that first-generation college students lag other students on a range of education achievement factors.\n\n非限定性定语从句：those who do not have a parent with a college degree，这部分是对“第一代大学生”这个短语的补充说明。\n\n**4. 语法分析**\n\n主句中使用了现在完成时态（have found），表示一种长期以来的研究发现或观察结果。\n\n非限定性定语从句使用了简单现在时态（do not have），表示一种对第一代大学生的普遍定义或描述。\n\n**5. 知识点总结**\n\n1. **现在完成时的使用**：在这句话中，“studies have found”使用了现在完成时，表达了一个持续多年的研究发现。现在完成时常常用来表示从过去一直延续到现在的动作或状态，或者对现在产生影响的过去发生的事情。\n\n1. **非限定性定语从句的使用**：在这句话中，“those who do not have a parent with a college degree”是一个非限定性定语从句，对\"first-generation college students\"进行了补充说明。非限定性定语从句为主句提供了额外的信息，但如果去掉，主句的基本意思不会改变。\n\n**6. 练习相似句子**\n\n\"For a long time, it has been observed that newcomers in the job market — those who do not have any work experience — struggle more than their experienced counterparts in securing a good job.\"\n\n\"长期以来，人们观察到就业市场上的新人——那些没有任何工作经验的人，在找到好工作方面比有经验的人更为艰难。\""},{"text":"Their grades are lower and their dropout rates are higher.","explainMd":"**1. 翻译**\n\n\"他们的成绩较低，辍学率较高。\"\n\n**2. 词汇和短语**\n\n- **Grades**：名词，指的是\"成绩\"，通常用于衡量学生在学术课程中的表现。\n- **Dropout rates**：复合名词，指的是\"辍学率\"，表示在特定时间内选择离开学校或教育系统的学生比例。\n\n**3. 句子结构**\n\n这是一个简单句，其结构为：主语 + 谓语 + 宾语。具体分析如下：\n\n主语：Their grades and their dropout rates，这部分指的是\"他们的成绩\"和\"他们的辍学率\"。\n\n谓语：are，这部分是动词\"are\"，表示\"是\"。\n\n宾语：lower and higher，这部分是形容词\"lower\"和\"higher\"，描述\"他们的成绩\"和\"他们的辍学率\"。\n\n**4. 语法分析**\n\n这个句子中使用了简单现在时态（are lower 和 are higher），表示一种对第一代大学生的普遍定义或描述。\n\n**5. 知识点总结**\n\n1. **简单现在时的使用**：在这句话中，“Their grades are lower and their dropout rates are higher”使用了简单现在时，表达了一个普遍的事实或者描述。简单现在时常常用来表示现在的状态，或者用于描述常规性、习惯性或不变的事实。例如：\"Sun rises in the east.\"（太阳从东方升起）\n\n1. **并列结构的使用**：这个句子中使用了并列结构（Their grades and their dropout rates），表示两个并列的事实或观察结果。并列结构可以用来连接两个或更多的相似的词、短语或句子。例如：\"She is smart and hardworking.\"（她聪明且工作勤奋）\n\n**6. 练习相似句子**\n\n\"Their performance is poor and their absenteeism rates are high.\"\n\n\"他们的表现差，缺勤率高。\""},{"text":"But since such students are most likely to advance economically if they succeed in higher education, colleges and universities have pushed for decades to recruit more of them.","explainMd":"**1. 翻译**\n\n\"但是，由于这样的学生如果在高等教育中取得成功，最有可能经济上取得提升，所以，高校已经推动了几十年来招收更多这样的学生。\"\n\n**2. 词汇和短语**\n\n- **Advance economically**：短语，指的是\"经济上取得提升\"，通常指财富、收入或经济地位的提升。\n- **Succeed in higher education**：短语，指的是\"在高等教育中取得成功\"，通常包括完成学位、获取高质量教育和转化为工作机会等。\n- **Pushed for decades to recruit**：短语，指的是\"推动了几十年来招收\"，表示持续的努力和行动来增加特定群体的人数。\n\n**3. 句子结构**\n\n这是一个复杂句，其结构为：主句 + 状语从句。具体分析如下：\n\n主句：Colleges and universities have pushed for decades to recruit more of them，这是句子的主要部分，表达的是高校已经推动了几十年来招收更多这样的学生这一观点。\n\n状语从句：But since such students are most likely to advance economically if they succeed in higher education，这部分作为状语从句，描述了推动招收更多这样的学生的原因。\n\n**4. 语法分析**\n\n这个句子中使用了现在完成时态（have pushed），表示从过去开始一直持续到现在的动作或状态。“since”引导的时间状语从句中使用了一般现在时态和条件语气。\n\n**5. 知识点总结**\n\n1. **现在完成时的使用**：在这句话中，“Colleges and universities have pushed for decades to recruit more of them”使用了现在完成时，表达了一个从过去开始并持续到现在的动作。现在完成时通常用来表示过去的某个动作对现在产生的影响或结果。例如：\"I have finished my homework.\"（我已经完成了我的作业）\n\n1. **状语从句的使用**：这个句子中使用了状语从句（But since such students are most likely to advance economically if they succeed in higher education），表示原因或条件。在复杂句子中，状语从句可以用来添加额外的信息来解释主句。例如：\"I will go to the party if I finish my homework.\"（如果我完成了我的作业，我就会去参加聚会）\n\n**6. 练习相似句子**\n\n\"Companies have been investing heavily in renewable energy sources for years, but because these technologies can help to reduce carbon emissions and combat climate change.\"\n\n\"但是，由于这些技术可以帮助减少碳排放和对抗气候变化，所以公司们已经投资了几年的可再生能源。\""},{"text":"This has created “a paradox” in that recruiting first-generation students, but then watching many of them fail, means that higher education has “continued to reproduce and widen, rather than close” an achievement gap based on social class, according to the depressing beginning of a paper forthcoming in the journal Psychological Science.","explainMd":"**1. 翻译**\n\n\"这造成了一个悖论，那就是招收了更多的第一代大学生，但却看着他们中的许多人失败，这意味着高等教育已经“继续再现并扩大，而不是缩小”基于社会阶层的成就差距，这是即将在心理科学杂志上发表的一篇论文开始的令人沮丧的部分。\"\n\n**2. 词汇和短语**\n\n- **Paradox**：悖论，指的是表面看起来自相矛盾或不可能的情况，但可能在更深入的探索中被证明为真实或可能的。\n- **Reproduce and widen**：再现并扩大，通常用于描述一个持续存在并且正在变得更糟糕的问题或情况。\n- **Achievement gap**：成就差距，这是教育领域中的一个术语，通常用于描述不同群体（如基于种族、性别、社会阶层等）之间在学术成就上的差异。\n\n**3. 句子结构**\n\n这是一个复杂句，其结构为：主句 + 并列句。具体分析如下：\n\n主句：This has created “a paradox”，这是句子的主要部分，表达的是这种情况已经造成了一个悖论这一观点。\n并列句：in that recruiting first-generation students, but then watching many of them fail, means that higher education has “continued to reproduce and widen, rather than close” an achievement gap based on social class，这部分并列于主句，进一步解释了这个悖论的具体内容，即招收更多第一代大学生，但却看到许多人失败，这意味着高等教育持续再现并扩大，而不是缩小基于社会阶层的成就差距。\n\n**4. 语法分析**\n\n这个句子中使用了现在完成时态（has created），表示一个完成的动作对现在造成的影响。同时，\"in that\"引导的并列句中使用了现在进行时态和现在完成时态。\n\n**5. 知识点总结**\n\n1. **现在完成时的使用**：在这句话中，“This has created “a paradox””使用了现在完成时，表达了一个完成的动作对现在造成的影响。现在完成时通常用来表示过去的某个动作对现在产生的影响或结果。例如：\"I have finished my homework.\"（我已经完成了我的作业）\n\n1. **并列句的使用**：这个句子中使用了并列句（in that recruiting first-generation students, but then watching many of them fail, means that higher education has “continued to reproduce and widen, rather than close” an achievement gap based on social class），表示一种并列的关系，一种情况与另一种情况同时存在。例如：\"She is a teacher and she loves her job.\"（她是一名老师，她热爱她的工作）\n\n**6. 练习相似句子**\n\n\"This has generated a dilemma, in that investing heavily in emerging technologies, but then observing many of them fail, signifies that industries have “continued to reproduce and amplify, rather than resolve” a gap based on technological innovation.\"\n\n\"这产生了一个困境，即大力投资新兴技术，然而却看着许多技术失败，这意味着各行各业已经“继续再现并放大，而不是解决”基于技术创新的差距。\""}]},{"sentences":[{"text":"But the article is actually quite optimistic, as it outlines a potential solution to this problem, suggesting that an approach (which involves a one-hour, next-to-no-cost program) can close 63 percent of the achievement gap (measured by such factors as grades) between first-generation and other students.","explainMd":"**1. 翻译**\n\n\"但实际上，这篇文章非常乐观，因为它提出了一个可能的解决方案，即通过一个只需一小时、几乎无成本的方案，可以消除63%的第一代大学生和其他学生之间的成绩差距（通过成绩等因素衡量）。\"\n\n**2. 词汇和短语**\n\n- **Optimistic**：乐观的，表示对未来有积极或有利的看法。\n- **Outlines**：概述，简要地描述或列出主要点。\n- **Potential solution**：潜在的解决方案，指可能解决问题的方式或方法。\n- **Achievement gap**：成就差距，这是教育领域中的一个术语，通常用于描述不同群体（如基于种族、性别、社会阶层等）之间在学术成绩上的差异。\n\n**3. 句子结构**\n\n这是一个复杂句，其结构为：主句 + 定语从句。具体分析如下：\n\n主句：But the article is actually quite optimistic，这是句子的主要部分，表达的是文章其实是非常乐观的这一观点。\n定语从句：as it outlines a potential solution to this problem, suggesting that an approach (which involves a one-hour, next-to-no-cost program) can close 63 percent of the achievement gap (measured by such factors as grades) between first-generation and other students，这部分是定语从句，对主句中的\"article\"进行了修饰和说明，具体说明了这篇文章是如何乐观的。\n\n**4. 语法分析**\n\n这个句子中使用了现在时态（is, outlines, involves, can close），表示一个正在进行或普遍存在的状态或动作。同时，\"as\"引导的定语从句中使用了现在时态。\n\n**5. 知识点总结**\n\n1. **定语从句的使用**：在这句话中，“as it outlines a potential solution to this problem, suggesting that an approach (which involves a one-hour, next-to-no-cost program) can close 63 percent of the achievement gap (measured by such factors as grades) between first-generation and other students”使用了定语从句，对主句中的\"article\"进行了修饰和说明。定语从句通常在句子中对某一名词或代词提供额外的信息。例如：\"The man who is standing there is my teacher.\"（站在那里的那个人是我的老师）\n\n1. **现在时的使用**：这个句子使用了现在时态，表达的是一个正在进行或普遍存在的状态或动作。例如：\"She goes to school every day.\"（她每天都去上学）\n\n**6. 练习相似句子**\n\n\"However, the report is actually very promising, as it presents a potential remedy to this issue, suggesting that an initiative (which involves a brief, virtually cost-free program) can eliminate 50 percent of the disparity (measured by such factors as performance) between first-time and experienced workers.\"\n\n\"然而，这份报告实际上非常有希望，因为它提出了一个可能的补救措施，即通过一个简短、几乎无成本的方案，可以消除50%的初次工作者和有经验的工作者之间的差距（通过表现等因素衡量）。\""}]},{"sentences":[{"text":"The authors of the paper are from different universities, and their findings are based on a study involving 147 students (who completed the project) at an unnamed private university.","explainMd":"**1. 翻译**\n\n\"这篇论文的作者们来自不同的大学，他们的发现基于一项涉及147名学生（完成了这个项目）的研究，这项研究在一所未公开名称的私立大学进行。\"\n\n**2. 词汇和短语**\n\n- **Authors**：作者，指创作文学、艺术或研究作品的人。\n- **Findings**：研究结果或发现，通常用于描述研究或调查的结果。\n- **Based on**：基于，表示某事物是在另一事物的基础上建立或发展的。\n- **Involve**：涉及，表示某事情包含或需要某一元素或方面。\n- **Unnamed**：未命名的，指某事物未被赋予或公布名称。\n\n**3. 句子结构**\n\n这是一个简单句，其结构为：主语 + 谓语 + 宾语。具体分析如下：\n\n- 主语：The authors of the paper，这是句子的主体部分，指的是这篇论文的作者们。\n- 谓语：are from different universities, and their findings are，这部分是谓语，描述了主语的状态和动作。\n- 宾语：based on a study involving 147 students (who completed the project) at an unnamed private university，这部分是宾语，是谓语动作的接受者，具体说明了他们的研究结果基于什么。\n\n**4. 语法分析**\n\n这个句子中使用了现在时态（are, are based），表示一个现在存在的状态。同时，句子的谓语部分使用了并列结构，并列的是两个短语：\"are from different universities\" 和 \"their findings are based on a study involving 147 students (who completed the project) at an unnamed private university\"。\n\n**5. 知识点总结**\n\n1. **并列结构的使用**：在这句话中，“are from different universities, and their findings are based on a study involving 147 students (who completed the project) at an unnamed private university”使用了并列结构，两个部分通过\"and\"连接。并列结构常用于连接两个或更多相等的语法结构，例如名词、动词、形容词、副词、短语或句子。例如：\"She likes reading books, listening to music, and playing basketball.\"（她喜欢阅读、听音乐和打篮球）\n1. **现在时的使用**：这个句子使用了现在时态，表达的是一个现在存在的状态。例如：\"She is a student.\"（她是一个学生）\n\n**6. 练习相似句子**\n\n\"The researchers of the experiment are from various institutions, and their results are based on a test involving 200 participants (who finished the experiment) at an undisclosed private laboratory.\"\n\n\"该实验的研究人员来自不同的机构，他们的结果基于一项涉及200名参与者（完成了这个实验）的测试，这项测试在一个未公开名称的私立实验室进行。\""},{"text":"First generation was defined as not having a parent with a four-year college degree.","explainMd":"**1. 翻译**\n\n\"First generation被定义为没有父母拥有四年制大学学位的人。\"\n\n**2. 词汇和短语**\n\n- **First generation**：第一代，通常用于描述在特定环境或情况下的第一代个体或群体。\n- **Defined**：定义，确定或描述事物的性质、特征、范围或含义。\n- **Four-year college degree**：四年制大学学位，通常指在美国等地所获得的本科学位，一般需要四年的全日制学习。\n\n**3. 句子结构**\n\n这是一个简单句，其结构为：主语 + 谓语 + 宾语。具体分析如下：\n\n- 主语：First generation，这是句子的主体部分，指的是\"第一代\"。\n- 谓语：was defined，这部分是谓语，描述了主语的动作，即\"被定义\"。\n- 宾语：as not having a parent with a four-year college degree，这部分是宾语，是谓语动作的接受者，具体说明了\"第一代\"如何被定义。\n\n**4. 语法分析**\n\n这个句子中使用了被动语态（was defined），表示\"第一代\"是被定义的对象，而定义的动作由其他人完成。\n\n**5. 知识点总结**\n\n1. **被动语态的使用**：在这句话中，“First generation was defined as not having a parent with a four-year college degree”使用了被动语态，强调的是\"第一代\"如何被定义，而非定义者是谁。被动语态常用于强调受动者，或者当动作的执行者不重要或不知道时。例如：\"The window was broken by the storm.\"（窗户被风暴打破了）\n\n1. **复杂宾语的使用**：这个句子的宾语部分是一个复杂结构，即\"as not having a parent with a four-year college degree\"。这里的\"as\"引导了一个分词结构作为宾语，这是英语中常见的复杂句式。例如：\"He was described as being a kind person.\"（他被描述为一个善良的人）\n\n**6. 练习相似句子**\n\n\"First-generation immigrant was defined as not having a parent born in the host country.\"\n\n\"第一代移民被定义为父母不是在主要国家出生的人。\""},{"text":"Most of the first-generation students (59.1 percent) were recipients of Pell Grants, a federal grant for undergraduates with financial need, while this was true only for 8.6 percent of the students with at least one parent with a four-year degree.","explainMd":"**1. 翻译**\n\n\"大部分的第一代大学生（占59.1%）是佩尔助学金的接受者，这是一项针对有经济需要的本科生的联邦助学金，然而只有8.6%的至少有一位父母拥有四年制大学学位的学生符合这一情况。\"\n\n**2. 词汇和短语**\n\n- **First-generation students**：第一代大学生，指的是那些父母没有大学学历的学生。\n- **Recipients**：接受者，指的是接收某物的人或物。\n- **Pell Grants**：佩尔助学金，这是美国联邦政府为有经济需要的本科生提供的助学金。\n- **Undergraduates**：本科生，指的是正在攻读本科学位的学生。\n- **Financial need**：经济需要，指的是经济状况需要援助或支持的情况。\n\n**3. 句子结构**\n\n这是一个复杂句，其结构为：主句 + 并列句。具体分析如下：\n\n- 主句：\"Most of the first-generation students (59.1 percent) were recipients of Pell Grants\"，这是句子的主要部分，表达的是大部分第一代大学生是佩尔助学金的接受者这一情况。\n- 并列句：\"while this was true only for 8.6 percent of the students with at least one parent with a four-year degree\"，这部分并列于主句，进一步提出了只有8.6%的至少有一位父母拥有四年制大学学位的学生符合这一情况。\n\n**4. 语法分析**\n\n这个句子使用了并列连词 \"while\" 来连接两个句子。\"While\" 在这里表示对比，用来强调两个句子之间的差异。\n\n**5. 知识点总结**\n\n1. **并列句的使用**：在这个句子中，“Most of the first-generation students (59.1 percent) were recipients of Pell Grants, while this was true only for 8.6 percent of the students with at least one parent with a four-year degree.” 使用了并列句。并列句通常用来连接两个或更多的独立句子，以便同时传达多个相关的想法。例如：\"I like cooking, but my husband prefers take-out.\"\n\n1. **对比的表达**：在这个句子中，作者使用 \"while\" 来表达对比，强调两组学生接受 Pell Grants 的比例差异。\"While\" 用于显示两个独立子句之间的对比。例如：\"She loves ice cream, while I prefer gelato.\"\n\n**6. 练习相似句子**\n\n\"Most of the employees (75.2 percent) were beneficiaries of the health insurance plan, while this was true only for 32.1 percent of the part-time workers.\"\n\n\"大部分的全职员工（占75.2%）都是医疗保险计划的受益者，然而只有32.1%的兼职工人符合这一情况。\""}]},{"sentences":[{"text":"Their thesis—that a relatively modest intervention could have a big impact—was based on the view that first-generation students may be most lacking not in potential but in practical knowledge about how to deal with the issues that face most college students.","explainMd":"**1. 翻译**\n\n\"他们的论点是，相对较小的干预可能会产生重大的影响，这基于的是，第一代大学生最缺乏的可能并不是潜力，而是如何处理大多数大学生面临的问题的实用知识。\"\n\n**2. 词汇和短语**\n\n- **Thesis**：论点，主张，这是你要表达的主要观点或建议。\n- **Modest intervention**：较小的干预，这通常指的是相对较小或不显著的改变或调整。\n- **Impact**：影响，指的是一个事物对另一个事物的效果或结果。\n- **Practical knowledge**：实用知识，指的是能够应用在实际生活或实际情况中的知识。\n\n**3. 句子结构**\n\n这是一个复杂句，其结构为：主句 + 并列从句。具体分析如下：\n\n- 主句：\"Their thesis—that a relatively modest intervention could have a big impact\"，这是句子的主要部分，表达的是他们的主张是一种相对较小的干预可能会产生重大的影响这一观点。\n- 并列从句：\"was based on the view that first-generation students may be most lacking not in potential but in practical knowledge about how to deal with the issues that face most college students\"，这部分并列于主句，进一步提出了这个观点是基于第一代大学生最缺乏的可能并不是潜力，而是如何处理大多数大学生面临的问题的实用知识。\n\n**4. 语法分析**\n\n这个句子的主语是 \"Their thesis\"，谓语是 \"was based\"，宾语是 \"the view\"。此句中使用了两个长短句，一个是修饰 \"thesis\"，一个是修饰 \"the view\"。在这两个长短句中，都使用了 \"that\" 引导，表示引导宾语从句或者名词性从句。\n\n**5. 知识点总结**\n\n1. **长短句的使用**：这个句子使用了两个长短句，一个用来修饰 \"thesis\"，一个用来修饰 \"the view\"。长短句是一种有效的修饰手法，可以提供详细信息来修饰名词或者代词。例如：\"The idea that everyone should have access to high-quality healthcare is widely accepted.\"\n\n1. **名词性从句的使用**：这个句子使用了两个名词性从句，一个是用来解释 \"thesis\"，一个是用来解释 \"the view\"。名词性从句可以充当主语、宾语、表语等。例如：\"What you said is true.\"\n\n**6. 练习相似句子**\n\n\"Their hypothesis—that a simple change in diet could lead to significant health improvements—was based on the notion that people are not necessarily lacking in discipline, but rather in nutritional knowledge.\"\n\n\"他们的假设是，饮食的简单改变可能会导致显著的健康改善，这基于的是，人们并不一定是缺乏自制力，而是缺乏营养知识。\""},{"text":"They cite past research by several authors to show that this is the gap that must be narrowed to close the achievement gap.","explainMd":"**1. 翻译**\n\n\"他们引用了几位作者的过去的研究，以此证明这是需要缩小的差距，以便消除成就差距。\"\n\n**2. 词汇和短语**\n\n- **Cite**：引用，指的是在论文或报告中引用他人的研究或观点以支持自己的观点或论述。\n- **Past research**：过去的研究，指的是已经发表或完成的研究。\n- **Gap**：差距，指的是两个或多个事物之间的差异或不平等。\n- **Achievement gap**：成就差距，通常用于描述在教育成绩、技能、知识等方面，不同群体（如种族、性别、经济地位等）之间的差距。\n\n**3. 句子结构**\n\n这是一个复杂句，其结构为：主句 + 非限定性定语从句。具体分析如下：\n\n- 主句：\"They cite past research by several authors\"，这是句子的主要部分，表达的是他们引用了几位作者的过去的研究这一观点。\n- 非限定性定语从句：\"to show that this is the gap that must be narrowed to close the achievement gap\"，这部分并列于主句，进一步提出了这是需要缩小的差距，以便消除成就差距这一观点。\n\n**4. 语法分析**\n\n这个句子的主语是 \"They\"，谓语是 \"cite\"，宾语是 \"past research by several authors\"。此句中使用了一个非限定性定语从句 \"to show that this is the gap that must be narrowed to close the achievement gap\" 来修饰主句。在这个从句中， \"that\" 用来引导宾语从句。\n\n**5. 知识点总结**\n\n1. **引用他人研究的表达方式**：在这个句子中，使用了 \"cite past research by several authors\" 的表达方式来引用他人的研究。这是在学术论文或报告中常见的表达方式，用来支持自己的观点或论述。例如：\"The authors cite several studies to support their argument.\"\n\n1. **非限定性定语从句的使用**：这个句子使用了一个非限定性定语从句 \"to show that this is the gap that must be narrowed to close the achievement gap\" 来修饰主句。非限定性定语从句用来提供关于主句的额外信息，而这些信息并不是主句信息的必要部分。例如：\"She gave me a book, which I have read twice.\"\n\n**6. 练习相似句子**\n\n\"They refer to previous studies by various experts to show that this is the disparity that needs to be reduced to close the gender wage gap.\"\n\n\"他们引用了多位专家的过去的研究，以此证明这是需要缩小的差距，以便消除性别工资差距。\""}]},{"sentences":[{"text":"Many first-generation students “struggle to navigate the middle-class culture of higher education, learn the ‘rules of the game,’ and take advantage of college resources,” they write.","explainMd":"**1. 翻译**\n\n\"许多第一代大学生在掌握高等教育的中产阶级文化、学习'游戏规则'、以及利用大学资源方面遭遇困境，\"他们写道。\n\n**2. 词汇和短语**\n\n- **First-generation students**：第一代大学生，指的是没有父母拥有大学学位的学生。\n- **Navigate**：掌握或适应，如在这个背景下，指的是在中产阶级的高等教育文化中找到方向或适应环境。\n- **Middle-class culture of higher education**：高等教育的中产阶级文化，指高等教育环境中的中产阶级价值观和行为规范。\n- **Rules of the game**：游戏规则，这里比喻为大学生活和学习的规则和策略。\n- **Take advantage of**：利用或充分使用，如在这个背景下，指的是利用大学提供的资源。\n\n**3. 句子结构**\n\n这是一个复杂句，其结构为：主句 + 引述语句。具体分析如下：\n\n- 主句：\"Many first-generation students struggle to navigate the middle-class culture of higher education, learn the 'rules of the game,' and take advantage of college resources\"，这是句子的主要部分，表达的是许多第一代大学生在掌握高等教育的中产阶级文化、学习'游戏规则'、以及利用大学资源方面遭遇困境这一观点。\n- 引述语句：\"they write\"，这部分并列于主句，为引述语句，表示这一观点是他们在文章中写到的。\n\n**4. 语法分析**\n\n这个句子的主语是 \"Many first-generation students\"，谓语是 \"struggle to navigate the middle-class culture of higher education, learn the 'rules of the game,' and take advantage of college resources\"。此句中使用了引述语句 \"they write\" 来表示这一观点是他们在文章中写到的。\n\n**5. 知识点总结**\n\n1. **引述语句的使用方法**：这是一种直接援引某人的原话的表达方式，通常用引号来标示。在这句话中，\"they write\" 使用了引述语句。另一个例子可以是：\"She said, 'I'll be there soon.'\"\n\n1. **特定的词汇和短语**：像\"navigate\"（掌握或适应）、\"rules of the game\"（游戏规则，比喻为大学生活和学习的规则和策略）、\"take advantage of\"（利用或充分使用）这样的词汇和短语，需要通过上下文和实际情境来理解和学习。在这句话中，\"struggle to navigate the middle-class culture of higher education\" 的意思是在掌握高等教育的中产阶级文化方面遭遇困境。\n\n**6. 练习相似句子**\n\n\"Many international students struggle to adapt to the culture of higher education in a new country, learn the 'rules of the game,' and make use of university resources,\" the authors state.\n\n\"许多国际学生在适应新国家高等教育的文化、学习'游戏规则'，以及利用大学资源方面遭遇困境，\"作者们写道。"},{"text":"And this becomes more of a problem when colleges don’t talk about the class advantages and disadvantages of different groups of students.","explainMd":"**1. 翻译**\n\n\"当学院不讨论不同学生群体的阶级优势和劣势时，这个问题就变得更加严重。\"\n\n**2. 词汇和短语**\n\n- **Become more of a problem**：变得更加严重，或者问题加剧。这个短语用来描述一个已存在的问题或困难情况变得更糟。\n- **Talk about**：讨论，这是一个常用短语，表示对某一个话题进行交谈或讨论。\n- **Class advantages and disadvantages**：阶级优势和劣势。这个词组在这个上下文中，指的是由于社会阶级差异而产生的优势和劣势。\n\n**3. 句子结构**\n\n这是一个简单句，其结构为：主语 + 谓语 + 宾语。具体分析如下：\n\n- 主语：\"this\"，这是句子的主要部分，指代的是前文提到的问题，即许多第一代大学生在掌握高等教育的中产阶级文化、学习'游戏规则'、以及利用大学资源方面的困境。\n- 谓语：\"becomes more of a problem\"，描述的是主语这个问题变得更加严重的状态。\n- 宾语：\"when colleges don’t talk about the class advantages and disadvantages of different groups of students\"，这部分说明了问题加剧的条件，即当学院不讨论不同学生群体的阶级优势和劣势时。\n\n**4. 语法分析**\n\n本句的主语是 \"this\"，谓语是 \"becomes more of a problem\"，宾语是 \"when colleges don’t talk about the class advantages and disadvantages of different groups of students\"。此句中使用了一个条件状语从句 \"when colleges don’t talk about the class advantages and disadvantages of different groups of students\" 来修饰主句，表示在什么条件下，这个问题会变得更严重。\n\n**5. 知识点总结**\n\n1. **条件状语从句的使用方法**：在这句中，“when colleges don’t talk about the class advantages and disadvantages of different groups of students” 就是一个条件状语从句，它用来描述主句中的动作或状态发生的条件。\n\n1. **特定的词汇和短语**：像 \"become more of a problem\"（变得更加严重）、\"talk about\"（讨论）、\"class advantages and disadvantages\"（阶级优势和劣势）这样的词汇和短语，需要结合上下文和实际情境来理解和学习。在这句话中，\"becomes more of a problem\" 的意思是变得更加严重。\n\n**6. 练习相似句子**\n\n\"The situation becomes more of a problem when the government doesn’t talk about the environmental impacts of different industries.\"\n\n\"当政府不讨论不同行业的环境影响时，这种情况会变得更加严重。\""},{"text":"”Because US colleges and universities seldom acknowledge how social class can affect students’ educational experiences, many first-generation students lack insight about why they are struggling and do not understand how students ‘like them’ can improve.”","explainMd":"**1. 翻译**\n\n\"因为美国的大学和学院很少承认社会阶级如何影响学生的教育经历，许多第一代大学生对他们为什么会挣扎并不了解，也不明白和他们‘情况相似’的学生如何能够改善。\"\n\n**2. 词汇和短语**\n\n- **Seldom acknowledge**：很少承认。这是一个常用短语，表示对某个事实或真相的少见的或不情愿的承认。\n- **Social class**：社会阶级。这是一个社会学术语，指的是社会中根据经济、教育、职业等因素分隔出的不同群体。\n- **Educational experiences**：教育经历。这个词组指的是个体在教育过程中的所有体验和经历。\n- **Struggle**：挣扎。这是一个动词，表示面临困难和努力克服困难。\n- **Lack insight about**：对...缺乏洞察力。这是一个表达方式，表示对某件事情或某个话题缺乏深入的理解或认识。\n\n**3. 句子结构**\n\n这是一个复杂句，其结构为：主句 + 并列句。具体分析如下：\n\n- 主句：\"Because US colleges and universities seldom acknowledge how social class can affect students’ educational experiences\"，这是句子的主要部分，表达的是美国的大学和学院很少承认社会阶级如何影响学生的教育经历这一观点。\n- 并列句：\"many first-generation students lack insight about why they are struggling and do not understand how students ‘like them’ can improve\"，这部分并列于主句，进一步提出了许多第一代大学生对他们为什么会挣扎并不了解，也不明白和他们‘情况相似’的学生如何能够改善这一观点。\n\n**4. 语法分析**\n\n本句的主句是 \"Because US colleges and universities seldom acknowledge how social class can affect students’ educational experiences\"，并列句是 \"many first-generation students lack insight about why they are struggling and do not understand how students ‘like them’ can improve\"。在这个句子中，使用了因果关系的连接词 \"Because\" 来连接主句和并列句，表明了二者之间的因果关系。\n\n**5. 知识点总结**\n\n1. **因果关系的表达**：在这句中，“Because US colleges and universities seldom acknowledge how social class can affect students’ educational experiences” 就是一个因果关系的表达，它用来描述主句中的动作或状态发生的原因。\n\n1. **特定的词汇和短语**：像 \"seldom acknowledge\"（很少承认）、\"social class\"（社会阶级）、\"educational experiences\"（教育经历）、\"struggle\"（挣扎）、\"lack insight about\"（对...缺乏洞察力）这样的词汇和短语，需要结合上下文和实际情境来理解和学习。在这句话中，\"seldom acknowledge\" 的意思是很少承认。\n\n**6. 练习相似句子**\n\n\"Because parents seldom acknowledge how peer pressure can affect their children's behavior, many teenagers lack insight about why they are influenced and do not understand how teenagers ‘like them’ can resist.\"\n\n\"因为父母很少承认同伴压力如何影响他们的孩子的行为，许多青少年对他们为什么会受影响并不了解，也不明白和他们‘情况相似’的青少年如何能够抵制。\""}]}],"title":""}