{"translate":"","paragraphs":[{"sentences":[{"text":"The journal Science is adding an extra round of statistical checks to its peer-review process, editor-in-chief Marcia McNutt announced today.","explainMd":"**1. 翻译:**\n\n\"《科学》杂志正在增加对其同行评审过程的额外统计检查，主编玛西娅·麦克纳特今天宣布。\"\n\n**2. 词汇和短语:**\n\n- The journal Science: 《科学》杂志\n- Is adding an extra round: 正在增加一轮\n- Statistical checks: 统计检查\n- To its peer-review process: 到其同行评审过程中\n- Editor-in-chief : 主编\n- Announced today: 今天宣布\n\n**3. 句子结构:**\n\n这是一个简单句，其结构为：主语 + 谓语 + 宾语。具体分析如下：\n\n主语：The journal Science，这是句子的主要部分，表达的是\"《科学》杂志\"。\n\n谓语：is adding an extra round of statistical checks，这是句子的谓语部分，表示正在增加一轮统计检查。\n\n宾语：to its peer-review process，这是句子的宾语部分，具体描述了《科学》杂志正在增加一轮统计检查的地方，即其同行评审过程中。\n\n**4. 语法:**\n\n这是一个简单句，主语是\"The journal Science\"，谓语是\"is adding an extra round of statistical checks\"，宾语是\"to its peer-review process\"。\n\n**5. 知识点总结:**\n\n- **简单句的使用**：简单句是最基本的句子类型，它只包含一个主要的动词或动词短语。例如：\"He left.\" \n- **\"is adding an extra round\"的使用**：这种表达方式经常用来表示正在增加一轮或一步的事物。例如：\"The company is adding an extra round of interviews to the hiring process.\"\n- **\"to its peer-review process\"的使用**：这个短语通常用来表示将某事物添加到其同行评审过程中。\n\n**6. 练习相似句子:**\n\nThe company is adding an extra round of interviews to its hiring process, CEO John Smith announced today.\n\n翻译：该公司正在增加对其招聘过程的额外一轮面试，首席执行官约翰·史密斯今天宣布。"},{"text":"The policy follows similar efforts from other journals, after widespread concern that basic mistakes in data analysis are contributing to the irreproducibility of many published research findings.","explainMd":"**1. 翻译:**\n\n\"这项政策遵循其他期刊类似的努力，这是在广泛关注的情况下，数据分析中的基础错误正在导致许多已发表的研究结果难以重现。\"\n\n**2. 词汇和短语:**\n\n- The policy: 这项政策\n- Follows similar efforts: 遵循类似的努力\n- From other journals: 来自其他期刊\n- Widespread concern: 广泛关注\n- Basic mistakes in data analysis: 数据分析中的基础错误\n- Are contributing to: 正在导致\n- The irreproducibility of many published research findings: 许多已发表的研究结果难以重现\n\n**3. 句子结构:**\n\n这是一个简单句，其结构为：主语 + 谓语 + 宾语。具体分析如下：\n\n主语：The policy，这是句子的主要部分，表达的是\"这项政策\"。\n\n谓语：follows similar efforts，这是句子的谓语部分，表示遵循类似的努力。\n\n宾语：from other journals, after widespread concern that basic mistakes in data analysis are contributing to the irreproducibility of many published research findings，这是句子的宾语部分，具体描述了这项政策遵循类似的努力的地方，即其他期刊，在广泛关注的情况下，数据分析中的基础错误正在导致许多已发表的研究结果难以重现。\n\n**4. 语法:**\n\n这是一个简单句，主语是\"The policy\"，谓语是\"follows similar efforts\"，宾语是\"from other journals, after widespread concern that basic mistakes in data analysis are contributing to the irreproducibility of many published research findings\"。\n\n**5. 知识点总结:**\n\n- **简单句的使用**：简单句是最基本的句子类型，它只包含一个主要的动词或动词短语。例如：\"He left.\" \n- **\"follows similar efforts\"的使用**：这种表达方式经常用来表示某事物遵循或模仿了类似的努力或方法。例如：\"The company follows similar efforts from its competitors.\"\n- **\"are contributing to\"的使用**：这个短语通常用来表示某些因素正在导致或产生某种结果。例如：\"His hard work is contributing to the success of the project.\"\n\n**6. 练习相似句子:**\n\nThe new policy follows similar initiatives from other companies, after widespread criticism that poor customer service is leading to a decline in client satisfaction.\n\n翻译：在广泛批评的情况下，糟糕的客户服务正在导致客户满意度的下降，新政策遵循了其他公司的类似举措。"}]},{"sentences":[{"text":"“Readers must have confidence in the conclusions published in our journal,” writes McNutt in an editorial.","explainMd":"**1. 翻译:**\n\n\"“读者必须对我们期刊发表的结论有信心，”麦克纳特在一篇社论中写道。\"\n\n**2. 词汇和短语:**\n\n- Readers: 读者\n- Must have confidence in: 必须对...有信心\n- The conclusions published: 发表的结论\n- In our journal: 在我们的期刊\n- Writes McNutt: 麦克纳特写道\n- In an editorial: 在一篇社论中\n\n**3. 句子结构:**\n\n这是一个简单句，其结构为：主语 + 谓语 + 宾语。具体分析如下：\n\n主语：Readers，这是句子的主要部分，表达的是\"读者\"。\n\n谓语：must have confidence，这是句子的谓语部分，表示必须有信心。\n\n宾语：in the conclusions published in our journal，这是句子的宾语部分，具体描述了读者必须有信心的对象，即在我们期刊上发表的结论。\n\n**4. 语法:**\n\n这是一个简单句，主语是\"Readers\"，谓语是\"must have confidence\"，宾语是\"in the conclusions published in our journal\"。\n\n**5. 知识点总结:**\n\n- **简单句的使用**：简单句是最基本的句子类型，它只包含一个主要的动词或动词短语。例如：\"He left.\" \n- **\"must have confidence in\"的使用**：这种表达方式经常用来表示必须对某事物有信心。例如：\"You must have confidence in your abilities.\"\n- **\"in the conclusions published in our journal\"的使用**：这个短语通常用来表示在某个期刊上发表的结论。\n\n**6. 练习相似句子:**\n\n\"Customers must have confidence in the products we sell,\" writes the CEO in a company announcement.\n\n翻译：\"客户必须对我们销售的产品有信心，\"首席执行官在公司公告中写道。"},{"text":"Working with the American Statistical Association, the journal has appointed seven experts to a statistics board of reviewing editors (SBoRE).","explainMd":"**1. 翻译:**\n\n\"该期刊与美国统计协会合作，已经任命了七位专家到审稿编辑的统计委员会（SBoRE）。\"\n\n**2. 词汇和短语:**\n\n- Working with: 与...合作\n- The American Statistical Association: 美国统计协会\n- The journal: 该期刊\n- Has appointed: 已经任命\n- experts: 专家\n- To a statistics board of reviewing editors (SBoRE): 到审稿编辑的统计委员会\n\n**3. 句子结构:**\n\n这是一个简单句，其结构为：主语 + 谓语 + 宾语。具体分析如下：\n\n主语：The journal，这是句子的主要部分，表达的是\"该期刊\"。\n\n谓语：has appointed，这是句子的谓语部分，表示已经任命。\n\n宾语：seven experts to a statistics board of reviewing editors (SBoRE)，这是句子的宾语部分，具体描述了该期刊已经任命的对象，即七位专家到审稿编辑的统计委员会。\n\n**4. 语法:**\n\n这是一个简单句，主语是\"The journal\"，谓语是\"has appointed\"，宾语是\"seven experts to a statistics board of reviewing editors (SBoRE)\"。\n\n**5. 知识点总结:**\n\n- **简单句的使用**：简单句是最基本的句子类型，它只包含一个主要的动词或动词短语。例如：\"He left.\" \n- **\"has appointed\"的使用**：这种表达方式经常用来表示已经任命或指定某人到某个职务或位置。例如：\"The company has appointed a new CEO.\"\n- **\"to a statistics board of reviewing editors (SBoRE)\"的使用**：这个短语通常用来表示被任命到某个特定的委员会或团体。\n\n**6. 练习相似句子:**\n\nWorking with the National Science Foundation, the university has appointed three professors to a research committee.\n\n翻译：\"该大学与国家科学基金会合作，已经任命了三位教授到研究委员会。\""},{"text":"Manuscript will be flagged up for additional scrutiny by the journal’s internal editors, or by its existing Board of Reviewing Editors or by outside peer reviewers.","explainMd":"**1. 翻译:**\n\n\"稿件将被该期刊的内部编辑、现有的审稿编辑委员会或者外部同行评审者标记为需要额外审查。\"\n\n**2. 词汇和短语:**\n\n- Manuscript: 稿件\n- Will be flagged up: 将被标记\n- For additional scrutiny: 需要额外审查\n- By the journal’s internal editors: 由期刊的内部编辑\n- Or by its existing Board of Reviewing Editors: 或者由其现有的审稿编辑委员会\n- Or by outside peer reviewers: 或者由外部同行评审者\n\n**3. 句子结构:**\n\n这是一个简单句，其结构为：主语 + 谓语 + 宾语。具体分析如下：\n\n主语：Manuscript，这是句子的主要部分，表达的是\"稿件\"。\n\n谓语：will be flagged up，这是句子的谓语部分，表示将被标记。\n\n宾语：for additional scrutiny by the journal’s internal editors, or by its existing Board of Reviewing Editors or by outside peer reviewers，这是句子的宾语部分，具体描述了稿件将被标记需要额外审查的人，即期刊的内部编辑、现有的审稿编辑委员会或者外部同行评审者。\n\n**4. 语法:**\n\n这是一个简单句，主语是\"Manuscript\"，谓语是\"will be flagged up\"，宾语是\"for additional scrutiny by the journal’s internal editors, or by its existing Board of Reviewing Editors or by outside peer reviewers\"。\n\n**5. 知识点总结:**\n\n- **简单句的使用**：简单句是最基本的句子类型，它只包含一个主要的动词或动词短语。例如：\"He left.\" \n- **\"will be flagged up\"的使用**：这种表达方式经常用来表示某事物将会被标记或注意。例如：\"The issue will be flagged up in the meeting.\"\n- **\"for additional scrutiny by...\"的使用**：这个短语通常用来表示由某人进行额外的审查或观察。\n\n**6. 练习相似句子:**\n\nThe project will be flagged up for additional scrutiny by the company's internal team or by outside consultants.\n\n翻译：\"该项目将被公司的内部团队或外部顾问标记为需要额外审查。\""},{"text":"The SBoRE panel will then find external statisticians to review these manuscripts.","explainMd":"**1. 翻译:**\n\n\"SBoRE小组将然后找到外部统计学家来审查这些稿件。\"\n\n**2. 词汇和短语:**\n\n- The SBoRE panel: SBoRE小组\n- Will then find: 将然后找到\n- External statisticians: 外部统计学家\n- To review: 来审查\n- Manuscripts: 这些稿件\n\n**3. 句子结构:**\n\n这是一个简单句，其结构为：主语 + 谓语 + 宾语。具体分析如下：\n\n主语：The SBoRE panel，这是句子的主要部分，表达的是\"SBoRE小组\"。\n\n谓语：will then find，这是句子的谓语部分，表示将然后找到。\n\n宾语：external statisticians to review these manuscripts，这是句子的宾语部分，具体描述了SBoRE小组将找到的对象，即外部统计学家来审查这些稿件。\n\n**4. 语法:**\n\n这是一个简单句，主语是\"The SBoRE panel\"，谓语是\"will then find\"，宾语是\"external statisticians to review these manuscripts\"。\n\n**5. 知识点总结:**\n\n- **简单句的使用**：简单句是最基本的句子类型，它只包含一个主要的动词或动词短语。例如：\"He left.\" \n- **\"will then find\"的使用**：这种表达方式经常用来表示然后将找到或发现某事物。例如：\"We will then find a solution to the problem.\"\n- **\"to review these manuscripts\"的使用**：这个短语通常用来表示来审查这些稿件。\n\n**6. 练习相似句子:**\n\nThe committee will then find external experts to review these applications.\n\n翻译：\"委员会将然后找到外部专家来审查这些申请。\""}]},{"sentences":[{"text":"Asked whether any particular papers had impelled the change, McNutt said: “The creation of the ‘statistics board’ was motivated by concerns broadly with the application of statistics and data analysis in scientific research and is part of Science’s overall drive to increase reproducibility in the research we publish.”","explainMd":"**1. 翻译:**\n\n\"当被问及是否有特定的论文推动了这次变革时，麦克纳特说：“‘统计委员会’的创建是由对科学研究中统计数据和数据分析应用的广泛关注所驱动的，这是《科学》杂志提高我们发表的研究可重复性的总体推动力的一部分。”\n\n**2. 词汇和短语:**\n\n- Asked whether: 当被问及是否\n- Any particular papers: 特定的论文\n- Had impelled the change: 推动了这次变革\n- The creation of the 'statistics board': “统计委员会” 的创建\n- Was motivated by: 由...所驱动\n- Concerns broadly with: 广泛的关注\n- In scientific research: 在科学研究中\n- Is part of: 是...的一部分\n- Science’s overall drive: 《科学》杂志的总体推动力\n- To increase reproducibility: 提高可重复性\n\n**3. 句子结构:**\n\n这是一个复杂句，其结构为：主句 + 并列句。具体分析如下：\n\n主句：Asked whether any particular papers had impelled the change, McNutt said，这是句子的主要部分，表达的是当被问及是否有特定的论文推动了这次变革时，麦克纳特说。\n\n并列句：The creation of the ‘statistics board’ was motivated by concerns broadly with the application of statistics and data analysis in scientific research and is part of Science’s overall drive to increase reproducibility in the research we publish，这部分并列于主句，进一步提出了\"统计委员会\"的创建是由对科学研究中统计数据和数据分析应用的广泛关注所驱动的，并且这是《科学》杂志提高我们发表的研究可重复性的总体推动力的一部分这一观点。\n\n对于这个句子，我们可以把它分为两个简单句来看：\n\n简单句1：Asked whether any particular papers had impelled the change, McNutt said\n\n主语：McNutt\n谓语：said\n宾语：(the content of what McNutt said, which is indirectly quoted in the following sentence)\n简单句2：The creation of the ‘statistics board’ was motivated by concerns broadly with the application of statistics and data analysis in scientific research and is part of Science’s overall drive to increase reproducibility in the research we publish\n\n主语：The creation of the ‘statistics board’\n谓语：was motivated, is\n宾语：by concerns broadly with the application of statistics and data analysis in scientific research, part of Science’s overall drive to increase reproducibility in the research we publish\n\n**4. 语法:**\n\n这个句子的语法主要涉及到间接问句的构造（\"whether any particular papers had impelled the change\"），以及复杂句的结构和使用。\n\n**5. 知识点总结:**\n\n- **间接问句的构造**：间接问句通常在主句询问某事后跟随，主句通常使用 \"ask\" 或 \"wonder\" 等动词，间接问句通常用 \"if\" 或 \"whether\" 引导。\n- **复杂句的结构和使用**：复杂句由一个或多个主要子句和一个或多个从句组成。在这个句子中，我们有一个主要子句和一个从句。\n\n**6. 练习相似句子:**\n\nAsked whether any particular events had prompted the decision, the CEO said: \"The restructure was motivated by a need for efficiency and is part of our overall drive to improve the services we offer.\"\n\n翻译：\"当被问及是否有特定的事件促使了这个决定时，首席执行官说：“重组是由对效率的需求所驱动的，这是我们提高我们提供的服务的整体推动力的一部分。”"}]},{"sentences":[{"text":"Giovanni Parmigiani, a biostatistician at the Harvard School of Public Health, a member of the SBoRE group, says he expects the board to “play primarily an advisory role.” He agreed to join because he “found the foresight behind the establishment of the SBoRE to be novel, unique and likely to have a lasting impact.","explainMd":"**1. 翻译**\n\n哈佛公共卫生学院的生物统计学家、SBoRE小组成员Giovanni Parmigiani表示，他预计该委员会将“主要起咨询作用”。他加入的原因是他发现“建立SBoRE的远见是新颖、独特且可能产生持久影响”。\n\n**2. 词汇和短语**\n\n- *biostatistician*: 生物统计学家\n- *play primarily an advisory role*: 主要起咨询作用\n- *foresight*: 远见\n- *establishment*: 建立\n- *novel*: 新颖的\n- *unique*: 独特的\n- *lasting impact*: 持久影响\n\n**3. 句子结构**\n\n这句话实际上是由两个并列的主谓宾结构组成的复合句。\n\n- 第一部分: \"Giovanni Parmigiani... says he expects the board to play primarily an advisory role\"\n  - 主语: Giovanni Parmigiani\n  - 谓语: says\n  - 宾语: he expects the board to play primarily an advisory role\n\n- 第二部分: \"He agreed to join because he found the foresight behind the establishment of the SBoRE to be novel, unique and likely to have a lasting impact\"\n  - 主语: He\n  - 谓语: agreed\n  - 宾语: to join because he found the foresight behind the establishment of the SBoRE to be novel, unique and likely to have a lasting impact\n\n**4. 语法**\n\n- **宾语从句**: 在这里，\"he expects the board to play primarily an advisory role\" 和 \"he found the foresight behind the establishment of the SBoRE to be novel, unique and likely to have a lasting impact\" 都是宾语从句。宾语从句通常跟在某些动词或表达后面，例如 \"say\", \"expect\", \"find\" 等，用来进一步说明或解释主句的内容。\n  \n- **非限定性定语从句**: \"Giovanni Parmigiani, a biostatistician at the Harvard School of Public Health, a member of the SBoRE group\" 中的 \"a biostatistician at the Harvard School of Public Health\" 和 \"a member of the SBoRE group\" 是对主语 Giovanni Parmigiani 的修饰，是非限定性定语从句。非限定性定语从句是对主语的额外描述或信息，它们通常用逗号与主句隔开。\n\n**5. 知识点总结**\n\n- **宾语从句**: 宾语从句是一个复杂句子的一部分，用来进一步解释或描述主句的主题。\n  \n- **非限定性定语从句**: 非限定性定语从句提供了对主语的额外信息，通常通过逗号与主句隔开。\n\n**6. 相似句子练习**\n\nRobert Smith, a physicist at Stanford University, a member of the research team, says he expects the project to \"bring significant breakthroughs.\" He decided to participate because he \"found the vision behind the project to be innovative, unprecedented and likely to have a profound effect.\"\n\n罗伯特·史密斯，斯坦福大学的物理学家，研究团队的成员，他表示他期望这个项目“带来重大突破”。他决定参与是因为他发现“项目背后的愿景是创新的，前所未有的，并可能产生深远的影响。”"},{"text":"This impact will not only be through the publications in Science itself, but hopefully through a larger group of publishing places that may want to model their approach after Science.”","explainMd":"**1. 翻译**\n\n\"这种影响不仅会体现在《科学》杂志自身的出版物上，而且也希望能影响更大的一部分出版场所，它们可能会希望参照《科学》的方法来模仿。\n\n**2. 词汇和短语**\n\n- *impact*: 影响\n- *publications*: 出版物\n- *Science itself*: 《科学》杂志自身\n- *a larger group of publishing places*: 更大的一部分出版场所\n- *model their approach after*: 参照...的方法来模仿\n\n**3. 句子结构**\n\n这个句子是一个复合句，由两个并列的主谓宾结构组成：\n\n- \"This impact will not only be through the publications in Science itself\" \n  - 主语: This impact\n  - 谓语: will not only be\n  - 宾语: through the publications in Science itself\n\n- \"but hopefully through a larger group of publishing places that may want to model their approach after Science\"\n  - 主语: (This impact)\n  - 谓语: but hopefully through\n  - 宾语: a larger group of publishing places that may want to model their approach after Science\n\n**4. 语法**\n\n这个句子的关键语法结构是\"not only... but also...\"的并列句型。这种句型用来表示两个或多个事实都是正确的，或者两种或多种情况都存在。在这个句子中，\"not only... but also...\"被用来强调影响的两个方面：不仅会体现在《科学》杂志自身的出版物上，而且还会影响更大的一部分出版场所。\n\n**5. 知识点总结**\n\n- **\"not only... but also...\"句型**: 这种句型用来表示两个或多个事实都是正确的，或者两种或多种情况都存在。在英语中，\"not only... but also...\" 是一种常见的强调句型，用来强调两个或多个相等的或者相似的事物或情况。\n\n**6. 相似句子练习**\n\n\"这种变化不仅会体现在我们的产品上，而且我们也希望它能影响到更多的行业，它们可能会希望参照我们的方法来改进。\"\n\n\"This change will not only be reflected in our products, but hopefully in a larger group of industries that may want to model their approach after ours.\""}]},{"sentences":[{"text":"John Ioannidis, a physician who studies research methodology, says that the policy is “a most welcome step forward” and “long overdue.” “Most journals are weak in statistical review, and this damages the quality of what they publish.","explainMd":"**1. 翻译**\n\n研究研究方法的医生John Ioannidis表示，这项政策是“一个非常受欢迎的向前的步骤”并“早就应该实施了”。他说：“大多数期刊在统计审查方面都比较薄弱，这损害了他们所发表的内容的质量。”\n\n**2. 词汇和短语**\n\n- *physician*: 医生\n- *research methodology*: 研究方法\n- *policy*: 政策\n- *a most welcome step forward*: 一个非常受欢迎的向前的步骤\n- *long overdue*: 早就应该实施了\n- *journals*: 期刊\n- *weak in*: 在...方面薄弱\n- *statistical review*: 统计审查\n- *damages*: 损害\n- *the quality of what they publish*: 他们所发表的内容的质量\n\n**3. 句子结构**\n\n这个句子是一个复合句，由两个主谓宾结构的句子组成：\n\n- \"John Ioannidis, a physician who studies research methodology, says that the policy is “a most welcome step forward” and “long overdue.”\"\n  - 主语: John Ioannidis\n  - 谓语: says\n  - 宾语: that the policy is “a most welcome step forward” and “long overdue.”\n\n- \"Most journals are weak in statistical review, and this damages the quality of what they publish.\"\n  - 主语: Most journals\n  - 谓语: are weak in statistical review\n  - 并列句: and this damages the quality of what they publish.\n\n**4. 语法**\n\n句子中的关键语法是定语从句和并列句。定语从句是用来修饰名词或者代词的从句。在这个句子中，\"who studies research methodology\"就是一个定语从句，用来修饰前面的名词\"physician\"。并列句是由两个或者更多的主谓结构通过并列连词（如and, but, or等）连接起来的句子。在这个句子中，\"and\"就是一个并列连词，连接了两个独立的句子。\n\n**5. 知识点总结**\n\n- **定语从句**: 用来修饰名词或者代词的从句。在英语中，定语从句通常跟在它所修饰的名词或者代词后面，由关系词（如who, which, that等）引导。\n\n- **并列句**: 由两个或者更多的主谓结构通过并列连词（如and, but, or等）连接起来的句子。在英语中，并列句是一种常见的句型，用来连接两个或者更多的相等的或者相似的句子。\n\n**6. 相似句子练习**\n\n\"大多数公司在创新方面都比较薄弱，这损害了他们产品的竞争力。\"\n\n\"Most companies are weak in innovation, and this damages the competitiveness of their products.\""},{"text":"I think that, for the majority of scientific papers nowadays, statistical review is more essential than expert review,” he says.","explainMd":"**1. 翻译**\n\n\"我认为，对于现在的大多数科学论文来说，统计审查比专家审查更为重要。\"\n\n**2. 词汇和短语**\n\n- *majority*: 大多数\n- *scientific papers*: 科学论文\n- *nowadays*: 现在，目前\n- *statistical review*: 统计审查\n- *more essential than*: 比...更为重要\n- *expert review*: 专家审查\n\n**3. 句子结构**\n\n这个句子是一个简单句，由一个主谓宾结构构成：\n\n- \"I think that, for the majority of scientific papers nowadays, statistical review is more essential than expert review.\"\n  - 主语: I\n  - 谓语: think\n  - 宾语: that, for the majority of scientific papers nowadays, statistical review is more essential than expert review.\n\n**4. 语法**\n\n句子中的关键语法是*宾语从句*。宾语从句是用来作为动词或者介词的宾语的从句。在这个句子中，\"that, for the majority of scientific papers nowadays, statistical review is more essential than expert review\"就是一个宾语从句，作为动词\"think\"的宾语。\n\n**5. 知识点总结**\n\n- **宾语从句**: 用来作为动词或者介词的宾语的从句。在英语中，宾语从句通常跟在它的主句动词或者介词后面，由连接词（如that, if, whether等）引导。\n\n**6. 相似句子练习**\n\n\"我觉得，对于现在的大多数学生来说，实践经验比理论知识更为重要。\"\n\n\"I think that, for the majority of students nowadays, practical experience is more essential than theoretical knowledge.\""},{"text":"But he noted that biomedical journals such as Annals of Internal Medicine, the Journal of the American Medical Association and The Lancet pay strong attention to statistical review.","explainMd":"**1. 翻译**\n\n\"但他指出，像《内科医学年鉴》、《美国医学会杂志》和《柳叶刀》这样的生物医学期刊对统计审查给予了极大的关注。\"\n\n**2. 词汇和短语**\n\n- *noted*: 指出\n- *biomedical journals*: 生物医学期刊\n- *such as*: 如，例如\n- *Annals of Internal Medicine*: 《内科医学年鉴》\n- *the Journal of the American Medical Association*: 《美国医学会杂志》\n- *The Lancet*: 《柳叶刀》\n- *pay strong attention to*: 对...给予强烈的关注\n- *statistical review*: 统计审查\n\n**3. 句子结构**\n\n这个句子是一个简单句，由一个主谓宾结构构成：\n\n- \"But he noted that biomedical journals such as Annals of Internal Medicine, the Journal of the American Medical Association and The Lancet pay strong attention to statistical review.\"\n  - 主语: he\n  - 谓语: noted\n  - 宾语: that biomedical journals such as Annals of Internal Medicine, the Journal of the American Medical Association and The Lancet pay strong attention to statistical review.\n\n**4. 语法**\n\n句子中的关键语法是*宾语从句*。宾语从句是用来作为动词或者介词的宾语的从句。在这个句子中，\"that biomedical journals such as Annals of Internal Medicine, the Journal of the American Medical Association and The Lancet pay strong attention to statistical review\"就是一个宾语从句，作为动词\"noted\"的宾语。\n\n**5. 知识点总结**\n\n- **宾语从句**: 用来作为动词或者介词的宾语的从句。在英语中，宾语从句通常跟在它的主句动词或者介词后面，由连接词（如that, if, whether等）引导。\n\n**6. 相似句子练习**\n\n\"但她指出，像谷歌、亚马逊和微软这样的科技公司对人工智能的研究给予了极大的关注。\"\n\n\"But she noted that tech companies such as Google, Amazon, and Microsoft pay strong attention to AI research.\""}]},{"sentences":[{"text":"Professional scientists are expected to know how to analyze data, but statistical errors are alarmingly common in published research, according to David Vaux, a cell biologist.","explainMd":"**1. 翻译**\n\n\"专业的科学家们被期待知道如何分析数据，但据细胞生物学家David Vaux所说，统计错误在已发表的研究中非常常见。\"\n\n**2. 词汇和短语**\n\n- *Professional scientists*: 专业的科学家们\n- *are expected to*: 被期待，被预期\n- *know how to*: 知道如何\n- *analyze data*: 分析数据\n- *statistical errors*: 统计错误\n- *alarmingly common*: 非常常见\n- *in published research*: 在已发表的研究中\n- *according to*: 根据，据...所说\n- *cell biologist*: 细胞生物学家\n\n**3. 句子结构**\n\n这个句子是一个复合句，由两个主谓宾结构的句子通过并列连词\"but\"连接而成：\n\n- \"Professional scientists are expected to know how to analyze data,\"\n  - 主语: Professional scientists\n  - 谓语: are expected to\n  - 宾语: know how to analyze data\n- \"but statistical errors are alarmingly common in published research, according to David Vaux, a cell biologist.\"\n  - 主语: statistical errors\n  - 谓语: are\n  - 宾语: alarmingly common in published research\n\n**4. 语法**\n\n句子中的关键语法是*被动语态*和*并列句*。\"Professional scientists are expected to know how to analyze data\"使用了被动语态，强调的是动作的承受者——专业的科学家们。两个句子通过\"but\"连接，形成一个并列句，表示对比或转折。\n\n**5. 知识点总结**\n\n- **被动语态**: 在被动语态中，句子的主语是动作的承受者，而非动作的执行者。形式为\"be + 动词过去分词\"。\n- **并列句**: 两个或更多的句子通过并列连词（如and, but, or等）连接，每个句子都能独立成句。\n\n**6. 相似句子练习**\n\n\"学生们被期待要掌握基础知识，但据教育专家所说，基础知识的缺失在当前的教育中非常常见。\"\n\n\"Students are expected to master basic knowledge, but the lack of basic knowledge is alarmingly common in current education, according to education experts.\""},{"text":"Researchers should improve their standards, he wrote in 2012, but journals should also take a tougher line, “engaging reviewers who are statistically literate and editors who can verify the process.” Vaux says that Science’s idea to pass some papers to statisticians “has some merit, but a weakness is that it relies on the board of reviewing editors to identify ‘the papers that need scrutiny’ in the first place.”","explainMd":"**1. 翻译**\n\n\"研究者应该提高他们的标准，\"他在2012年写道，\"但是期刊也应该更严格，\"让那些统计知识丰富的审稿人参与，并让能验证这个过程的编辑参与。\"Vaux说，Science把一些论文交给统计学家审查的想法\"有一些优点，但一个弱点是它依赖于审稿编辑委员会首先识别出‘需要仔细审查的论文’。\"\n\n**2. 词汇和短语**\n\n- *Researchers*: 研究者\n- *improve their standards*: 提高他们的标准\n- *journals*: 期刊\n- *take a tougher line*: 更严格\n- *reviewers who are statistically literate*: 统计知识丰富的审稿人\n- *editors who can verify the process*: 能验证这个过程的编辑\n- *has some merit*: 有一些优点\n- *a weakness is*: 一个弱点是\n- *relies on*: 依赖于\n- *board of reviewing editors*: 审稿编辑委员会\n- *identify*: 识别出\n- *the papers that need scrutiny*: 需要仔细审查的论文\n\n**3. 句子结构**\n\n这个句子是一个复合句，由两个主谓宾结构的句子通过并列连词\"but\"连接而成：\n\n- \"Researchers should improve their standards,\"\n  - 主语: Researchers\n  - 谓语: should improve\n  - 宾语: their standards\n- \"but journals should also take a tougher line,\"\n  - 主语: journals\n  - 谓语: should take\n  - 宾语: a tougher line\n\n**4. 语法**\n\n这个句子中的关键语法是*并列句*和*引语*。两个句子通过\"but\"连接，形成一个并列句，表示对比或转折。其中引用了Vaux的观点，使用了引号。\n\n**5. 知识点总结**\n\n- **并列句**: 两个或更多的句子通过并列连词（如and, but, or等）连接，每个句子都能独立成句。\n- **引语**: 引语是直接引用别人的话或引用自己的话。在英语中，直接引语通常用双引号引起来。\n\n**6. 相似句子练习**\n\n\"Teachers should improve their teaching methods,\" he suggested in 2021, \"but schools should also elevate their standards, engaging educators who have deep knowledge in their subjects and principals who can oversee the process.\" He said the idea of having an education board review the teaching plans \"has some advantage, but a limitation is that it depends on the education board to first identify 'the plans that need scrutiny'.\"\n\n\"教师应该改进他们的教学方法，\"他在2021年建议，\"但学校也应该提高他们的标准，让那些在自己学科有深厚知识的教育工作者参与，并让能监督这个过程的校长参与。\"他说，设立教育委员会审查教学计划的想法\"有一些优点，但一个限制是它依赖于教育委员会首先识别出‘需要仔细审查的教学计划’。\""}]}],"title":""}