{"translate":"","paragraphs":[{"sentences":[{"text":"King Juan Carlos of Spain once insisted “kings don’t abdicate, they die in their sleep.” But embarrassing scandals and the popularity of the republican left in the recent Euro-elections have forced him to eat his words and stand down.","explainMd":"**1. 翻译:**\n\n\"西班牙的胡安·卡洛斯国王曾坚称'国王不会退位，他们会在睡梦中去世'。但是尴尬的丑闻和最近欧洲选举中共和左派的流行迫使他收回他的话并辞职。\"\n\n**2. 词汇和短语:**\n\n1. King Juan Carlos of Spain: 西班牙的胡安·卡洛斯国王\n2. Once insisted: 曾经坚称\n3. Abdicate: 退位\n4. Die in their sleep: 在睡梦中去世\n5. Embarrassing scandals: 尴尬的丑闻\n6. Popularity: 人气，受欢迎程度\n7. The republican left: 共和左派\n8. Euro-elections: 欧洲选举\n9. Forced him to eat his words: 迫使他收回他的话\n10. Stand down: 辞职\n\n**3. 句子结构:**\n\n这是一个复杂句，其结构为：主句 + 并列句。具体分析如下：\n\n1. 主句：King Juan Carlos of Spain once insisted “kings don’t abdicate, they die in their sleep.”。这是句子的主要部分，表达的是胡安·卡洛斯国王曾坚决地说过国王不会退位，他们会在睡梦中去世这一观点。\n2. 并列句：But embarrassing scandals and the popularity of the republican left in the recent Euro-elections have forced him to eat his words and stand down。这部分并列于主句，进一步提出了尴尬的丑闻和最近欧洲选举中共和左派的流行迫使他收回他的话并辞职这一观点。\n\n**4. 语法:**\n\n1. **引述语句**: \"King Juan Carlos of Spain once insisted 'kings don’t abdicate, they die in their sleep'.\" 这是一个引述语句，用引号表示国王的直接言论。\n2. **并列结构**: 在第二个子句中，\"embarrassing scandals and the popularity of the republican left\" 是一个并列结构，表示两个并列的原因。\n3. **过去完成时**: \"have forced him to eat his words and stand down.\" 使用了过去完成时，表示过去某个时间点之前已经完成的动作或状态。\n\n**5. 知识点总结:**\n\n通过这句子我们学习到：\n\n1. **引述语句**的使用方法。\n2. **并列结构**的构造和应用。\n3. **过去完成时**的形式和用途。\n4. 特定的词汇和短语，如\"abdicate\"（退位）和\"eat one's words\"（收回自己的话）。\n\n**6. 练习相似句子:**\n\nPresident Johnson once proclaimed \"Presidents don't resign, they serve till their term ends.\" However, recent accusations and the rise of the opposition party in the national polls have obliged him to retract his words and step down.\n\n翻译：约翰逊总统曾宣称\"总统不会辞职，他们会一直服务到任期结束。\"然而，最近的指控和国家民意测验中的反对党的崛起迫使他收回他的话并辞职。"},{"text":"So, does the Spanish crisis suggest that monarchy is seeing its last days?","explainMd":"**1. 翻译:**\n\n\"那么，西班牙的危机是否意味着君主制正在走向终结呢？\"\n\n**2. 词汇和短语:**\n\n1. Spanish crisis: 西班牙危机\n2. Suggest: 暗示，提示\n3. Monarchy: 君主制\n4. Seeing its last days: 正在走向终结\n\n**3. 句子结构:**\n\n这是一个简单句，其结构为：主句。具体分析如下：\n\n主句：So, does the Spanish crisis suggest that monarchy is seeing its last days? 这是句子的主要部分，表达的是提问西班牙的危机是否暗示君主制正在走向终结这一观点。\n\n**4. 语法:**\n\n这是一个一般疑问句，用于提出问题。句首的\"So\"是连接副词，用于引出对之前情况的结果或推论。\n\n**5. 知识点总结:**\n\n1. **一般疑问句的构造和应用**: 一般疑问句主要用于提出问题，通常由疑问词、助动词、主语、谓语等部分构成。例如：\"Does he like reading books?\"\n2. **连接副词的使用**: \"So\"是一个连接副词，用于表示结果或推论，常用于开始句子，连接两个句子。例如：\"He failed the exam, so he has to retake it.\"\n\n**6. 练习相似句子:**\n\nSo, does the economic downturn indicate that the era of rapid development is coming to an end?\n\n翻译：那么，经济的下滑是否表明快速发展的时代即将结束？"},{"text":"Does that mean the writing is on the wall for all European royals, with their magnificent uniforms and majestic lifestyles?","explainMd":"**1. 翻译:**\n\n\"那么，这是否意味着所有身着华丽制服、过着奢华生活的欧洲皇室成员的末日已经来临?\"\n\n**2. 词汇和短语:**\n\n1. Mean: 意味着\n2. The writing is on the wall: 末日已经来临（直译为“墙上的字迹”，源自圣经的故事，意味着不祥的预兆或警告）\n3. European royals: 欧洲皇室成员\n4. Magnificent uniforms: 华丽的制服\n5. Majestic lifestyles: 奢华的生活方式\n\n**3. 句子结构:**\n\n这是一个简单句。\n\n**4. 语法:**\n\n这是一个一般疑问句，用于提出问题。句首的\"Does\" 是助动词，用于构成现在时态的疑问句。\n\n**5. 知识点总结:**\n\n1. **一般疑问句的构造和应用**：一般疑问句主要用于提出问题，通常由疑问词、助动词、主语、谓语等部分构成。例如：\"Does he like reading books?\"\n\n2. **短语的理解和应用**：短语 \"the writing is on the wall\" 是一个比喻，表示不祥的预兆或警告。例如：\"With the recent performance of the company, the writing is on the wall.\"\n\n**6. 练习相似句子:**\n\nDoes this mean that the end is near for all the celebrities living a life of luxury and excess?\n\n翻译：这是否意味着对于所有过着奢华和过度生活的名人来说，末日已经临近？"}]},{"sentences":[{"text":"The Spanish case provides arguments both for and against monarchy.","explainMd":"**1. 翻译:**\n\n\"西班牙的案例为君主制的赞成和反对都提供了论据。\"\n\n**2. 词汇和短语:**\n\n1. The Spanish case: 西班牙的案例\n2. Provides: 提供\n3. Arguments: 论据\n4. Both for and against: 赞成和反对的\n\n**3. 句子结构:**\n\n这是一个简单句，其结构为：主语 + 谓语 + 宾语。具体分析如下：\n\n主语：The Spanish case。这是句子的主体部分，指的是\"西班牙的情况\"。\n\n谓语：provides。这是句子的动作部分，指的是\"提供\"的动作。\n\n宾语：arguments both for and against monarchy。这是句子的对象部分，指的是被提供的东西，即\"为赞成和反对君主制的论据\"。\n\n**4. 语法:**\n\n这是一个声明句，用于表述一个事实或观点。句子中的\"both for and against\" 是一个固定搭配，用来表示同时包含两方面的意见或情况。\n\n**5. 知识点总结:**\n\n1. **声明句的使用**：声明句用于表述一个事实或观点，是英语中最常见的句型。例如：\"The sun rises in the east.\"\n\n2. **固定搭配的理解和应用**：在英语中有许多固定的词组搭配，如\"both for and against\"，需要通过大量阅读和实践来熟悉和掌握。例如：\"There are pros and cons to every decision.\"\n\n**6. 练习相似句子:**\n\nThe recent study provides evidence both for and against the new treatment method.\n\n翻译：最近的研究为新的治疗方法的赞成和反对都提供了证据。"},{"text":"When public opinion is particularly polarised, as it was following the end of the Franco regime, monarchs can rise above “mere” politics and “embody” a spirit of national unity.","explainMd":"**1. 翻译:**\n\n\"当公众舆论特别两极分化的时候，就像在佛朗哥政权结束后那样，君主可以升华于“纯粹”的政治之上，并“体现”出国家团结的精神。\"\n\n**2. 词汇和短语:**\n\n1. Public opinion: 公众舆论\n2. Particularly polarised: 特别两极分化\n3. Following: 在...之后\n4. The end of the Franco regime: 佛朗哥政权的结束\n5. Monarchs: 君主\n6. Rise above: 升华于，超越\n7. Mere: 仅仅的，纯粹的\n8. Politics: 政治\n9. Embody: 体现\n10. A spirit of national unity: 国家团结的精神\n\n**3. 句子结构:**\n\n这是一个复杂句，其结构为：主句 + 定语从句。具体分析如下：\n\n主句：Monarchs can rise above “mere” politics and “embody” a spirit of national unity，这是句子的主要部分，表达的是君主可以升华于“纯粹”的政治之上，并“体现”出国家团结的精神这一观点。\n\n定语从句：When public opinion is particularly polarised, as it was following the end of the Franco regime，这部分修饰主句，为主句提供了情境背景，即在公众舆论特别两极分化的情况下，特别是在佛朗哥政权结束后。\n\n**4. 语法:**\n\n这个句子使用了定语从句来修饰主句。定语从句是对主句中的某一成分（通常是名词或代词）进行修饰的从句。在这个句子中，\"When public opinion is particularly polarised, as it was following the end of the Franco regime\" 是一个定语从句，修饰 \"monarchs\"。\n\n**5. 知识点总结:**\n\n1. **定语从句的使用**：定语从句是对主句中的某一成分（通常是名词或代词）进行修饰的从句。例如：\"The man who is standing there is my teacher.\"\n\n2. **特定的词汇和短语**：像\"rise above\"（升华于）和\"embody\"（体现）这样的词汇和短语，需要通过上下文和实际情境来理解和学习。例如：\"He strives to rise above the petty gossip of his colleagues.\"\n\n**6. 练习相似句子:**\n\nWhen the situation is particularly dire, as it was during the economic crisis, leaders can rise above mere politics and embody a spirit of resilience.\n\n翻译：当情况特别严峻，就像在经济危机期间那样，领导人可以超越纯粹的政治，并体现出坚韧不屈的精神。"}]},{"sentences":[{"text":"It is this apparent transcendence of politics that explains monarchs’ continuing popularity as heads of state.","explainMd":"**1. 翻译:**\n\n\"正是这种明显的超越政治，解释了君主作为国家元首的持续受欢迎程度。\"\n\n**2. 词汇和短语:**\n\n1. Apparent: 明显的\n2. Transcendence of politics: 超越政治\n3. Explains: 解释\n4. Monarchs: 君主\n5. Continuing popularity: 持续的受欢迎\n6. As heads of state: 作为国家元首\n\n**3. 句子结构:**\n\n这是一个简单句，其结构为：主语 + 谓语 + 宾语。具体分析如下：\n\n主语：It。这是句子的主体部分，通常指代的是接下来的描述或者情况，即\"this apparent transcendence of politics\"。\n\n谓语：is。这是句子的动作部分，\"is\" 是系动词，用于连接主语和表语。\n\n表语：this apparent transcendence of politics that explains monarchs’ continuing popularity as heads of state。这是句子的说明部分，用来对主语进行补充说明或者描述。它包括一个名词短语 \"this apparent transcendence of politics\" 和一个定语从句 \"that explains monarchs’ continuing popularity as heads of state\"，定语从句用来修饰前面的名词短语。\n\n**4. 语法:**\n\n这是一个倒装句式，用于强调句子的某一部分。在这个句子中，\"this apparent transcendence of politics\" 是被强调的部分。\n\n**5. 知识点总结:**\n\n1. **倒装句的使用**：倒装句是一种语序调整的句型，通常用于强调句子的某一部分。例如：\"Never have I seen such a beautiful sunset.\"\n\n2. **特定的词汇和短语**：像\"transcendence\"（超越）和\"heads of state\"（国家元首）这样的词汇和短语，需要通过上下文和实际情境来理解和学习。例如：\"He strives for the transcendence of worldly desires.\"\n\n**6. 练习相似句子:**\n\nIt is his exceptional leadership that ensures the team's continuous success in the field.\n\n翻译：正是他出色的领导力，确保了团队在该领域的持续成功。"},{"text":"And so, the Middle East excepted, Europe is the most monarch-infested region in the world, with 10 kingdoms (not counting Vatican City and Andorra).","explainMd":"**1. 翻译:**\n\n\"因此，除了中东之外，欧洲是世界上最多君主制国家的地区，有10个王国（不包括梵蒂冈和安道尔）。\"\n\n**2. 词汇和短语:**\n\n1. And so: 因此\n2. The Middle East excepted: 除了中东\n3. Europe: 欧洲\n4. The most monarch-infested region: 君主制最为盛行的地区\n5. In the world: 在世界上\n6. With 10 kingdoms: 有10个王国\n7. Not counting Vatican City and Andorra: 不包括梵蒂冈和安道尔\n\n**3. 句子结构:**\n\n这是一个简单句，其结构为：主语 + 谓语 + 宾语。具体分析如下：\n\n- **主语**：Europe。这是句子的主体部分，指的是\"欧洲\"。\n\n- **谓语**：is。这是句子的动作部分，指的是\"是\"的动作。\n\n- **宾语**：the most monarch-infested region in the world, with 10 kingdoms (not counting Vatican City and Andorra)。这是句子的对象部分，指的是被描述的东西，即\"世界上君主制最为盛行的地区，有10个王国（不包括梵蒂冈和安道尔）\"。\n\n所以，这句话的句子结构是主语 + 谓语 + 宾语。\n\n**4. 语法:**\n\n这是一个陈述句，用于表述一个事实或观点。句子中的\"with\" 是介词，引导介词短语用来修饰主句。\n\n**5. 知识点总结:**\n\n1. **陈述句的使用**：陈述句用于表述一个事实或观点，是英语中最常见的句型。例如：\"The sun rises in the east.\"\n\n2. **介词短语的使用**：介词短语可以用来修饰句子的主要部分，提供更具体的信息。例如：\"The book on the table is mine.\"\n\n**6. 练习相似句子:**\n\nAnd so, Africa is the most diverse continent in the world, with over 2000 languages.\n\n翻译：因此，非洲是世界上最具多样性的大陆，有超过2000种语言。"},{"text":"But unlike their absolutist counterparts in the Gulf and Asia, most royal families have survived because they allow voters to avoid the difficult search for a non-controversial but respected public figure.","explainMd":"**1. 翻译:**\n\n\"但与海湾和亚洲的绝对主义君主不同，大多数的皇室家族能够存续下来，因为他们让选民避免了寻找一个无争议但又受人尊敬的公众人物的困难。\"\n\n**2. 词汇和短语:**\n\n1. But unlike: 但与...不同\n2. Their absolutist counterparts: 他们的绝对主义对等体\n3. In the Gulf and Asia: 在海湾和亚洲\n4. Most royal families: 大多数的皇室家族\n5. Have survived: 存续下来\n6. Because they allow: 因为他们允许\n7. Voters: 选民\n8. To avoid the difficult search for: 避免了寻找...的困难\n9. A non-controversial but respected public figure: 一个无争议但又受人尊敬的公众人物\n\n**3. 句子结构:**\n\n这是一个复杂句，其结构为：主句 + 状语从句。具体分析如下：\n\n主句：Most royal families have survived，这是句子的主要部分，表达的是大多数的皇室家族存续下来这一观点。\n\n状语从句：because they allow voters to avoid the difficult search for a non-controversial but respected public figure，这部分是状语从句，用来解释主句中皇室家族为何能够存续下来。\n\n**4. 语法:**\n\n这是一个复杂句，包含一个主句和一个状语从句。状语从句由连接词\"because\"引导，用来解释主句中的情况或原因。\n\n**5. 知识点总结:**\n\n1. **复杂句的使用**：复杂句通常包含一个主句和一个或多个从句（包括定语从句、状语从句、宾语从句等）。例如：\"He left because he was tired.\" \n\n2. **状语从句的使用**：状语从句用来修饰主句，提供时间、地点、原因、目的、结果、条件等信息。例如：\"She went to bed because she was tired.\"\n\n**6. 练习相似句子:**\n\nBut unlike their competitors in the market, most local businesses have thrived because they offer personalized services that attract loyal customers.\n\n翻译：但与市场上的竞争者不同，大多数本地企业因为提供吸引忠实顾客的个性化服务而蓬勃发展。"}]},{"sentences":[{"text":"Even so, kings and queens undoubtedly have a downside.","explainMd":"**1. 翻译:**\n\n\"即便如此，国王和女王无疑有其缺点。\"\n\n**2. 词汇和短语:**\n\n1. Even so: 即便如此\n2. Kings and queens: 国王和女王\n3. Undoubtedly: 无疑地\n4. Have a downside: 有其缺点\n\n**3. 句子结构:**\n\n这是一个简单句，其结构为：主语 + 谓语 + 宾语。具体分析如下：\n\n1. **主语**：Kings and queens。这是句子的主体部分，指的是\"国王和女王\"。\n\n2. **谓语**：Undoubtedly have。这是句子的动作部分，指的是\"无疑地有\"的动作。\n\n3. **宾语**：a downside。这是句子的对象部分，指的是被描述的东西，即\"其缺点\"。\n\n所以，这句话的句子结构是主语 + 谓语 + 宾语。\n\n**4. 语法:**\n\n这是一个陈述句，用于表述一个事实或观点。句子中的\"undoubtedly\" 是副词，用来修饰动词\"have\"，表示\"无疑地有\"的意思。\n\n**5. 知识点总结:**\n\n1. **陈述句的使用**：陈述句用于表述一个事实或观点，是英语中最常见的句型。例如：\"The sun rises in the east.\"\n\n2. **副词的使用**：副词可以用来修饰动词、形容词或其他副词，提供更具体的信息。例如：\"He runs quickly.\"\n\n**6. 练习相似句子:**\n\nEven so, teachers undoubtedly have a challenging job.\n\n翻译：即便如此，教师无疑拥有一项充满挑战的工作。"},{"text":"Symbolic of national unity as they claim to be, their very history—and sometimes the way they behave today—embodies outdated and indefensible privileges and inequalities.","explainMd":"**1. 翻译:**\n\n\"尽管他们声称是国家团结的象征，但他们的历史，以及他们今天有时的行为，体现了过时和无法辩护的特权和不平等。\"\n\n**2. 词汇和短语:**\n\n1. Symbolic of: 象征\n2. National unity: 国家团结\n3. As they claim to be: 如他们所声称的\n4. Their very history: 他们的历史\n5. And sometimes the way they behave today: 以及他们今天有时的行为\n6. Embodies: 体现\n7. Outdated and indefensible: 过时且无法辩护的\n8. Privileges and inequalities: 特权和不平等\n\n**3. 句子结构:**\n\n这是一个复杂句，其结构为：主句 + 并列句。具体分析如下：\n\n主句：Their very history embodies outdated and indefensible privileges and inequalities，这是句子的主要部分，表达的是他们的历史体现了过时且无法辩护的特权和不平等这一观点。\n\n并列句：And sometimes the way they behave today embodies outdated and indefensible privileges and inequalities，这部分并列于主句，进一步提出了他们今天有时的行为体现了过时且无法辩护的特权和不平等这一观点。\n\n**4. 语法:**\n\n这是一个复杂句，包含一个主句和一个并列句。并列句由连接词\"and\"引导，用来并列两个或多个具有相同或相似语法结构的句子部分。\n\n**5. 知识点总结:**\n\n1. **复杂句的使用**：复杂句通常包含一个主句和一个或多个从句（包括定语从句、状语从句、宾语从句等）。例如：\"He left because he was tired.\" \n\n2. **并列句的使用**：并列句用来连接两个或多个具有相同或相似语法结构的句子部分。例如：\"She likes reading books and watching movies.\"\n\n**6. 练习相似句子:**\n\nDespite they claim to be champions of equality, their history and their current actions embody the outdated and indefensible discrimination and prejudice.\n\n翻译：尽管他们声称是平等的捍卫者，但他们的历史和现行行为体现了过时且无法辩护的歧视和偏见。"},{"text":"At a time when Thomas Piketty and other economists are warning of rising inequality and the increasing power of inherited wealth, it is bizarre that wealthy aristocratic families should still be the symbolic heart of modern democratic states.","explainMd":"**1. 翻译:**\n\n\"在托马斯·皮凯蒂和其他经济学家警告不平等正在增加，且遗产财富的力量正在增强之际，富有的贵族家庭仍然是现代民主国家的象征中心，这是非常奇怪的。\"\n\n**2. 词汇和短语:**\n\n1. At a time when: 在...之际\n2. economists: 经济学家\n3. Are warning of: 正在警告\n4. Rising inequality: 增长的不平等\n5.  inherited wealth: 遗产财富\n6. It is bizarre that: 这是奇怪的\n7. Wealthy aristocratic families: 富有的贵族家庭\n8. Should still be the symbolic : 仍然是什么的象征中心\n\n**3. 句子结构:**\n\n这是一个复杂句，其结构为：状语 + 主句。具体分析如下：\n\n状语：At a time when Thomas Piketty and other economists are warning of rising inequality and the increasing power of inherited wealth，这是句子的状语部分，设置了句子发生的背景，即在经济学家警告不平等正在增加，且遗产财富的力量正在增强之际。\n\n主句：It is bizarre that wealthy aristocratic families should still be the symbolic heart of modern democratic states，这是句子的主要部分，表达的是富有的贵族家庭仍然是现代民主国家的象征中心，这是非常奇怪的。\n\n**4. 语法:**\n\n这是一个复杂句，包含一个主句和一个时间状语从句。时间状语从句由连接词\"when\"引导，用来设置句子发生的背景。\n\n**5. 知识点总结:**\n\n1. **复杂句的使用**：复杂句通常包含一个主句和一个或多个从句（包括定语从句、状语从句、宾语从句等）。例如：\"He left because he was tired.\" \n\n2. **时间状语从句的使用**：时间状语从句用来修饰主句，提供时间背景。例如：\"She went to bed when she was tired.\"\n\n**6. 练习相似句子:**\n\nAt a time when environmentalists are warning of climate change and global warming, it is bizarre that fossil fuel industries are still being heavily subsidized.\n\n翻译：在环保人士警告气候变化和全球变暖之际，化石燃料行业仍然得到大量补贴，这是非常奇怪的。"}]},{"sentences":[{"text":"The most successful monarchies strive to abandon or hide their old aristocratic ways.","explainMd":"**1. 翻译:**\n\n\"最成功的君主制国家努力放弃或隐藏他们过去的贵族习俗。\"\n\n**2. 词汇和短语:**\n\n1. The most successful: 最成功的\n2. Monarchies: 君主制国家\n3. Strive to: 努力去\n4. Abandon or hide: 放弃或隐藏\n5. Their old aristocratic ways: 他们过去的贵族习俗\n\n**3. 句子结构:**\n\n这是一个简单句，其结构为：主语 + 谓语 + 宾语。具体分析如下：\n\n1. **主语**：The most successful monarchies。这是句子的主体部分，即\"最成功的君主制国家\"。\n\n2. **谓语**：strive to。这是句子的动作部分，即\"努力去\"的动作。\n\n3. **宾语**：abandon or hide their old aristocratic ways。这是句子的对象部分，即被描述的东西，也就是\"放弃或隐藏他们过去的贵族习俗\"。\n\n所以，这句话的句子结构是主语 + 谓语 + 宾语。\n\n**4. 语法:**\n\n这是一个陈述句，用于表述一个事实或观点。句子中的\"strive to\" 是动词短语，表示努力去做某事的动作。\n\n**5. 知识点总结:**\n\n1. **陈述句的使用**：陈述句用于表述一个事实或观点，是英语中最常见的句型。例如：\"The sun rises in the east.\"\n\n2. **动词短语的使用**：动词短语可以增强句子的意义，提供更具体的信息。例如：\"She strives to be the best.\"\n\n**6. 练习相似句子:**\n\nThe most successful companies strive to innovate and adapt in the changing market.\n\n翻译：最成功的公司努力在变化的市场中创新和适应。"},{"text":"Princes and princesses have day-jobs and ride bicycles, not horses (or helicopters).","explainMd":"**1. 翻译:**\n\n\"王子和公主们有日常工作，并骑自行车，而不是骑马（或乘坐直升机）。\"\n\n**2. 词汇和短语:**\n\n1. Princes and princesses: 王子和公主们\n2. Have day-jobs: 有日常工作\n3. And ride bicycles: 并骑自行车\n4. Not horses (or helicopters): 而不是骑马（或乘坐直升机）\n\n**3. 句子结构:**\n\n这是一个简单句，其结构为：主语 + 谓语 + 宾语。具体分析如下：\n\n1. **主语**：Princes and princesses。这是句子的主体部分，指的是\"王子和公主们\"。\n\n2. **谓语**：Have and ride。这是句子的动作部分，指的是\"有\"和\"骑\"的动作。\n\n3. **宾语**：day-jobs and bicycles。这是句子的对象部分，指的是被描述的东西，即\"日常工作\"和\"自行车\"。\n\n所以，这句话的句子结构是主语 + 谓语 + 宾语。\n\n**4. 语法:**\n\n这是一个陈述句，用于表述一个事实或观点。句子中的\"not\" 是否定词，用来否定后面的内容，表示\"而不是\"的意思。\n\n**5. 知识点总结:**\n\n1. **陈述句的使用**：陈述句用于表述一个事实或观点，是英语中最常见的句型。例如：\"The sun rises in the east.\"\n\n2. **否定词的使用**：否定词可以用来否定句子的部分或全部内容，例如：\"She does not like apples.\"\n\n**6. 练习相似句子:**\n\nStudents and teachers use laptops and tablets, not blackboards (or chalk).\n\n翻译：学生和教师使用笔记本电脑和平板电脑，而不是黑板（或粉笔）。"},{"text":"Even so, these are wealthy families who party with the international 1%, and media intrusiveness makes it increasingly difficult to maintain the right image.","explainMd":"**1. 翻译:**\n\n\"即便如此，这些富有的家庭与国际1%的精英交际，并且媒体的侵入性使得维持正确的形象变得越来越困难。\"\n\n**2. 词汇和短语:**\n\n1. Even so: 即便如此\n2. These are wealthy families: 这些是富有的家庭\n3. Who party with: 与...交际\n4. The international 1%: 国际1%的精英\n5. intrusiveness: 侵入性\n6. Makes it increasingly difficult: 使得越来越困难\n7. To maintain the right image: 维持正确的形象\n\n**3. 句子结构:**\n\n这是一个复杂句，其结构为：主句 + 并列句。具体分析如下：\n\n主句：These are wealthy families who party with the international 1%，这是句子的主要部分，表达的是这些是富有的家庭与国际1%的精英交际这一观点。\n\n并列句：And media intrusiveness makes it increasingly difficult to maintain the right image，这部分并列于主句，进一步提出了媒体的侵入性使得维持正确的形象变得越来越困难这一观点。\n\n**4. 语法:**\n\n这是一个复杂句，包含一个主句和一个并列句。并列句由连接词\"and\"引导，用来连接两个或多个具有相同或相似语法结构的句子部分。\n\n**5. 知识点总结:**\n\n1. **复杂句的使用**：复杂句通常包含一个主句和一个或多个从句（包括定语从句、状语从句、宾语从句等）。例如：\"He left because he was tired.\" \n\n2. **并列句的使用**：并列句用来连接两个或多个具有相同或相似语法结构的句子部分。例如：\"She likes reading books and watching movies.\"\n\n**6. 练习相似句子:**\n\nEven so, these are successful companies who compete with the international giants, and market volatility makes it increasingly difficult to maintain steady growth.\n\n翻译：即便如此，这些成功的公司与国际巨头竞争，而市场的不稳定性使得维持稳定的增长变得越来越困难。"}]},{"sentences":[{"text":"While Europe’s monarchies will no doubt be smart enough to survive for some time to come, it is the British royals who have most to fear from the Spanish example.","explainMd":"**1. 翻译:**\n\n\"虽然欧洲的君主制国家无疑将足够聪明地生存一段时间，但英国的皇室最需要担心西班牙的例子。\"\n\n**2. 词汇和短语:**\n\n1. While: 虽然\n2. Europe’s monarchies: 欧洲的君主制国家\n3. Will no doubt be: 无疑将会是\n4. Smart enough: 足够聪明\n5. To survive for some time to come: 在未来一段时间内生存下来\n6. It is the British royals: 是英国的皇室\n7. Who have most to fear: 最需要担心的是\n8. From the Spanish example: 西班牙的例子\n\n**3. 句子结构:**\n\n这是一个复杂句，其结构为：状语 + 主句。具体分析如下：\n\n状语：While Europe’s monarchies will no doubt be smart enough to survive for some time to come，这是句子的状语部分，设置了句子发生的背景，即在欧洲的君主制国家无疑将足够聪明地生存一段时间的情况下。\n\n主句：It is the British royals who have most to fear from the Spanish example，这是句子的主要部分，表达的是最需要担心西班牙的例子的是英国的皇室。\n\n**4. 语法:**\n\n这是一个复杂句，包含一个主句和一个时间状语从句。时间状语从句由连接词\"while\"引导，用来设置句子发生的背景。\n\n**5. 知识点总结:**\n\n1. **复杂句的使用**：复杂句通常包含一个主句和一个或多个从句（包括定语从句、状语从句、宾语从句等）。例如：\"He left because he was tired.\" \n\n2. **时间状语从句的使用**：时间状语从句用来修饰主句，提供时间背景。例如：\"She went to bed when she was tired.\"\n\n**6. 练习相似句子:**\n\nWhile the technology companies will no doubt be innovative enough to thrive for years to come, it is the traditional industries that have most to fear from the digital revolution.\n\n翻译：虽然科技公司无疑将足够创新以在未来几年内蓬勃发展，但最需要担心数字革命的是传统行业。"}]},{"sentences":[{"text":"It is only the Queen who has preserved the monarchy’s reputation with her rather ordinary (if well-heeled) granny style.","explainMd":"**1. 翻译:**\n\n\"只有女王用她相当普通（如果富裕）的老奶奶风格保持了君主制的声誉。\"\n\n**2. 词汇和短语:**\n\n1. It is only......: 只有......\n2. Who has preserved: 已经保持\n3. The monarchy’s reputation: 君主制的声誉\n4. With her rather ordinary: 用她相当普通的\n5. If well-heeled: 如果富裕的\n6. Granny style: 老奶奶风格\n\n**3. 句子结构:**\n\n这是一个复杂句，其结构为：主句 + 定语从句。具体分析如下：\n\n主句：It is only the Queen，这是句子的主要部分，表达的是只有女王这一观点。\n\n定语从句：Who has preserved the monarchy’s reputation with her rather ordinary (if well-heeled) granny style，这是一个定语从句，修饰前面的\"the Queen\"，具体描述了女王用她相当普通（如果富裕）的老奶奶风格保持了君主制的声誉。\n\n**4. 语法:**\n\n这是一个复杂句，包含一个主句和一个定语从句。定语从句由连接词\"who\"引导，用来修饰前面的名词或名词词组。\n\n**5. 知识点总结:**\n\n1. **复杂句的使用**：复杂句通常包含一个主句和一个或多个从句（包括定语从句、状语从句、宾语从句等）。例如：\"He left because he was tired.\" \n\n2. **定语从句的使用**：定语从句用来修饰前面的名词或名词词组，提供更详细的信息。例如：\"The person who called me was my friend.\"\n\n**6. 练习相似句子:**\n\nIt is only the CEO who has maintained the company's reputation with her strong leadership style.\n\n翻译：只有首席执行官用她强大的领导风格保持了公司的声誉。"},{"text":"The danger will come with Charles, who has both an expensive taste of lifestyle and a pretty hierarchical view of the world.","explainMd":"**1. 翻译:**\n\n\"危险将随着查尔斯的到来，他既有昂贵的生活方式，也对世界有着相当等级的观点。\"\n\n**2. 词汇和短语:**\n\n1. The danger will come: 危险将来临\n2. With: 随着\n3. Who has both: 他既有\n4. An expensive taste of lifestyle: 昂贵的生活方式\n5. And a sth view of the world: 且对世界有什么的观点\n\n**3. 句子结构:**\n\n这是一个复杂句，其结构为：主句 + 定语从句。具体分析如下：\n\n主句：The danger will come with Charles，这是句子的主要部分，表达的是危险将随着查尔斯的到来这一观点。\n\n定语从句：Who has both an expensive taste of lifestyle and a pretty hierarchical view of the world，这是一个定语从句，修饰前面的\"Charles\"，具体描述了查尔斯既有昂贵的生活方式，也对世界有着相当等级的观点。\n\n**4. 语法:**\n\n这是一个复杂句，包含一个主句和一个定语从句。定语从句由连接词\"who\"引导，用来修饰前面的名词或名词词组。\n\n**5. 知识点总结:**\n\n1. **复杂句的使用**：复杂句通常包含一个主句和一个或多个从句（包括定语从句、状语从句、宾语从句等）。例如：\"He left because he was tired.\" \n\n2. **定语从句的使用**：定语从句用来修饰前面的名词或名词词组，提供更详细的信息。例如：\"The person who called me was my friend.\"\n\n**6. 练习相似句子:**\n\nThe challenge will come with the new manager, who has both an aggressive approach to business and a strong competitive view of the market.\n\n翻译：挑战将随着新经理的到来，他对商业有一种积极的方法，对市场有强烈的竞争观点。"},{"text":"He has failed to understand that monarchies have largely survived because they provide a service—as non-controversial and non-political heads of state.","explainMd":"**1. 翻译:**\n\n\"他未能理解君主制之所以能够大体上存活下来，是因为他们提供了一种服务——作为非争议性且非政治性的国家元首。\"\n\n**2. 词汇和短语:**\n\nMonarchies: 君主政体\nSurvived: 存活下来\nNon-controversial: 非争议性的\nNon-political: 非政治性的\nHeads of state: 国家元首\nHave failed to: 未能\nProvide a service: 提供服务\nNon-controversial and non-political heads of state: 非争议性且非政治性的国家元首\nHave largely survived: 大体上存活下来\n\n**3. 句子结构:**\n\n这是一个复杂句，其结构为：主句 + 宾语从句。具体分析如下：\n\n主句：He has failed to understand，这是句子的主要部分，表达的是他未能理解这一观点。\n\n宾语从句：That monarchies have largely survived because they provide a service as non-controversial and non-political heads of state，这是一个宾语从句，作为\"understand\"的宾语，具体解释了他未能理解的内容，即君主制之所以能够大体上存活下来，是因为他们提供了一种服务——作为非争议性且非政治性的国家元首。\n\n**4. 语法:**\n\n这是一个复杂句，包含一个主句和一个宾语从句。宾语从句由连接词\"that\"引导，用来解释主句中动词\"understand\"的内容。\n\n**5. 知识点总结:**\n\n1. **复杂句的使用**：复杂句通常包含一个主句和一个或多个从句（包括定语从句、状语从句、宾语从句等）。例如：\"He left because he was tired.\" \n\n2. **宾语从句的使用**：宾语从句用来解释主句中的动词或形容词的内容，提供更详细的信息。例如：\"I believe that you can do it.\"\n\n**6. 练习相似句子:**\n\nShe has failed to understand that businesses have largely survived because they adapt to market changes.\n\n翻译：她未能理解，企业之所以能够大体上存活下来，是因为它们适应了市场变化。"},{"text":"Charles ought to know that as English history shows, it is kings, not republicans, who are the monarchy’s worst enemies.","explainMd":"**1. 翻译:**\n\n\"查尔斯应该知道，正如英国历史所示，君主制的最大敌人是国王，而不是共和主义者。\"\n\n**2. 词汇和短语:**\n\n   1. Charles: 查尔斯\n   2. Ought to: 应该\n   3. Know: 知道\n   4. English: 英国的\n   5. History: 历史\n   6. Shows: 显示，表明\n   7. Kings: 国王\n   8. Not: 不是\n   9. Republicans: 共和主义者\n   10. Ought to know: 应该知道\n   11. As history shows: 正如历史所示\n   12. It is... not...: 是... 而不是...\n\n**3. 句子结构:**\n\n这是一个复杂句，其结构为：主句 + 宾语从句。具体分析如下：\n\n主句：Charles ought to know，这是句子的主要部分，表达的是查尔斯应该知道这一观点。\n\n宾语从句：That as English history shows, it is kings, not republicans, who are the monarchy’s worst enemies，这是一个宾语从句，作为\"know\"的宾语，具体解释了查尔斯应该知道的内容，即正如英国历史所示，君主制的最大敌人是国王，而不是共和主义者。\n\n**4. 语法:**\n\n这是一个复杂句，包含一个主句和一个宾语从句。宾语从句由连接词\"that\"引导，用来解释主句中动词\"know\"的内容。\n\n**5. 知识点总结:**\n\n1. **复杂句的使用**：复杂句通常包含一个主句和一个或多个从句（包括定语从句、状语从句、宾语从句等）。例如：\"He left because he was tired.\" \n\n2. **宾语从句的使用**：宾语从句用来解释主句中的动词或形容词的内容，提供更详细的信息。例如：\"I believe that you can do it.\"\n\n**6. 练习相似句子:**\n\nJohn ought to know that as the data shows, it is lack of exercise, not diet, that is the biggest factor in weight gain.\n\n翻译：约翰应该知道，正如数据所示，缺乏运动而不是饮食是体重增加的最大因素。"}]}],"title":""}