{"translate":"","paragraphs":[{"sentences":[{"text":"In a rare unanimous ruling, the US Supreme Court has overturned the corruption conviction of a former Virginia governor, Robert McDonnell.","explainMd":"**1. 翻译**\n\n在一项罕见的全票通过的裁决中，美国最高法院撤销了前弗吉尼亚州州长罗伯特·麦克唐纳的贪污定罪。\n\n**2. 重难点词汇和短语**\n\n- \"a rare unanimous ruling\": \"一项罕见的全票通过的裁决\"，指全体法官一致同意的法庭裁决。\n- \"the US Supreme Court\": \"美国最高法院\"，美国的最高级别的联邦法院。\n- \"overturned\": \"撤销\"，在法律上表示取消或推翻以前的裁决或决定。\n- \"corruption conviction\": \"贪污定罪\"，指由法庭判定的贪污罪行。\n\n**3. 句子结构**\n\n这是一个简单句，主句为\"In a rare unanimous ruling, the US Supreme Court has overturned the corruption conviction of a former Virginia governor, Robert McDonnell\"，其中\"in a rare unanimous ruling\"是状语修饰主句，\"the US Supreme Court\"是主语，\"has overturned\"是谓语，\"the corruption conviction of a former Virginia governor, Robert McDonnell\"是宾语。\n\n**4. 语法**\n\n- \"In a rare unanimous ruling\"的用法：这是一个介词短语作状语，修饰整个句子，表明裁决的方式或情况。\n- \"has overturned\"的用法：\"has overturned\"是现在完成时，表示过去发生的动作对现在造成的影响或结果。\n\n**5. 知识点总结**\n\n- 介词短语作状语的用法：介词短语可以在句中作状语，对动词或整个句子进行修饰。\n- 现在完成时的用法：现在完成时表示过去发生的动作对现在造成的影响或结果。\n\n**6. 相似句子练习**\n\n\"In a unanimous decision, the board of directors has approved the new business strategy.\"\n\n\"在一次全票通过的决定中，董事会批准了新的商业策略。\""},{"text":"But it did so while holding its nose at the ethics of his conduct, which included accepting gifts such as a Rolex watch and a Ferrari automobile from a company seeking access to government.","explainMd":"**1. 翻译**\n\n但是，它在对他的行为道德（包括接受寻求政府接触的公司赠送的劳力士手表和法拉利汽车等礼物）表示鄙视的同时，做出了这样的决定。\n\n**2. 重难点词汇和短语**\n\n- \"holding its nose at\": \"对...表示鄙视或不满\"，这是一种比喻的表达方式，指对某事物的不满或厌恶。\n- \"the ethics of his conduct\": \"他的行为道德\"，指他行为的道德评价或道德标准。\n- \"included accepting gifts such as\": \"包括接受...等礼物\"，表达包含接受特定礼物在内的行为。\n\n**3. 句子结构**\n\n这是一个复合句。\"But it did so while holding its nose at the ethics of his conduct,\"是主句，\"which included accepting gifts such as a Rolex watch and a Ferrari automobile from a company seeking access to government\"是定语从句，修饰前面的\"his conduct\"。\n\n**4. 语法**\n\n- \"But it did so while holding its nose at\"的用法：使用\"while\"引导的时间状语从句，表示在某个动作进行的同时，另一个动作也在进行。\n- \"which included accepting gifts such as\"的用法：使用\"which\"引导的非限制性定语从句，对先行词进行补充说明。\n\n**5. 知识点总结**\n\n- \"while\"引导的时间状语从句的用法：表示两个动作同时进行。\n- \"which\"引导的非限制性定语从句的用法：对先行词进行补充说明。\n\n**6. 相似句子练习**\n\n\"She finished her project while listening to her favorite music, which included songs from famous bands like The Beatles and Queen.\"\n\n\"她一边听着她最喜欢的音乐完成她的项目，其中包括来自像甲壳虫乐队和皇后乐队这样的著名乐队的歌曲。\""}]},{"sentences":[{"text":"The high court’s decision said the judge in Mr. McDonnell’s trial failed to tell a jury that it must look only at his “official acts,” or the former governor’s decisions on “specific” and “unsettled” issues related to his duties.","explainMd":"**1. 翻译**\n\n最高法院的决定指出，麦克唐纳先生的审判法官未能告诉陪审团，他们只能看他的\"公务行为\"，或者这位前州长对与他的职责相关的\"特定\"和\"未决\"问题的决定。\n\n**2. 重难点词汇和短语**\n\n- \"The high court’s decision\": \"最高法院的决定\"，指的是最高法院对于某一案件的判决或者决定。\n- \"failed to tell a jury\": \"未能告诉陪审团\"，表示法官没有把某个必要的信息告知陪审团。\n- \"official acts\": \"公务行为\"，指的是一个公职人员在其职责范围内正式执行的行为。\n\n**3. 句子结构**\n\n这是一个复杂句。主句是\"The high court's decision said the judge in Mr. McDonnell's trial failed to tell a jury\"，然后用that引导了两个并列的宾语从句，分别是\"it must look only at his \"official acts\"\"和\"or the former governor’s decisions on “specific” and “unsettled” issues related to his duties\"。\n\n**4. 语法**\n\n- \"failed to\"的用法：表示未能成功做某事，后接动词原形。\n- \"that\"引导的宾语从句的用法：that在这里引导了两个并列的宾语从句，说明法官未能告诉陪审团的两个内容。\n\n**5. 知识点总结**\n\n- \"failed to\"的用法：表示未能成功做某事。\n- \"that\"引导的宾语从句的用法：用于引导陈述句，给出某一主题或观点的具体内容或解释。\n\n**6. 相似句子练习**\n\n\"The teacher's comment indicated that the student failed to understand the core concept of the lesson, or the importance of critical thinking in problem-solving.\"\n\n\"老师的评语表明，学生未能理解课程的核心概念，或者未能理解批判性思维在解决问题中的重要性。\""}]},{"sentences":[{"text":"Merely helping a gift-giver gain access to other officials, unless done with clear intent to pressure those officials, is not corruption, the justices found.","explainMd":"**1. 翻译**\n\n法官们发现，仅仅帮助一个送礼者接触其他官员，并非腐败，除非这是出于明确的意图去施压那些官员。\n\n**2. 重难点词汇和短语**\n\n- \"Merely helping\": \"仅仅帮助\"，表示只是进行了某种行为，而并未涉及其他复杂或更深层次的行为。\n- \"a gift-giver\": \"一个送礼者\"，指的是给公职人员赠送礼物的人。\n- \"gain access to\": \"接触\"或\"获得接入权\"，表示获得与某人或某个组织接触、交流的机会。\n\n**3. 句子结构**\n\n本句是一个复合句。主句是\"Merely helping a gift-giver gain access to other officials is not corruption, the justices found\"，其中有一个unless引导的条件状语从句\"unless done with clear intent to pressure those officials\"。\n\n**4. 语法**\n\n- \"unless\"的用法：引导条件状语从句，表示\"除非\"的意思。\n- \"found\"的用法：在此句中，\"found\"表示法官们的意见或发现。\n\n**5. 知识点总结**\n\n- \"unless\"的使用：引导条件状语从句，表示除非某条件成立，否则另一情况将发生。\n- \"found\"的使用：表示发现或认为，常用于报告性语态，表示主观判断或发现。\n\n**6. 相似句子练习**\n\n\"Simply watching videos is not sufficient for learning a language, teachers suggest, unless done with active engagement and practice.\"\n\n\"老师们建议，仅仅观看视频对学习一门语言并无足够的帮助，除非这样做时积极参与并进行实践。\""}]},{"sentences":[{"text":"The court did suggest that accepting favors in return for opening doors is “distasteful” and “nasty.” But under anti-bribery laws, proof must be made of concrete benefits, such as approval of a contract or regulation.","explainMd":"**1. 翻译**\n\n法院的确建议，为了开门而接受回报是“令人反感”和“令人厌恶”的。但是在反贿赂法下，必须证明有具体的利益，例如批准合同或法规。\n\n**2. 重难点词汇和短语**\n\n- \"did suggest\"：确实建议，表示法院的意见或观点。\n- \"accepting favors in return for opening doors\"：为了开门而接受回报，这是一种比喻说法，意味着为了获取某些好处或利益而进行的行为。\n- \"distasteful\" 和 \"nasty\"：令人反感和令人厌恶，这两个词都是形容词，用来描述某事或某物引起的负面情绪。\n- \"anti-bribery laws\"：反贿赂法，这是一个专有名词，指的是用来防止、打击贿赂行为的法律。\n- \"proof must be made of concrete benefits\"：必须证明有具体的利益，这里的\"concrete benefits\"指的是实在的、有形的好处或利益。\n\n**3. 句子结构**\n\n这个句子是一个复合句，主句是\"The court did suggest that accepting favors in return for opening doors is “distasteful” and “nasty.”\"，其中包含一个宾语从句\"that accepting favors in return for opening doors is “distasteful” and “nasty”\"；接着的\"But under anti-bribery laws, proof must be made of concrete benefits\"是并列句。\n\n**4. 语法**\n\n- \"suggest\"的用法：在这个句子中，\"suggest\"表示提出建议或观点，后面通常接双引号引起来的直接引语或者接that引导的宾语从句。\n- \"must be made\"的用法：这是被动语态的一种形式，表示\"必须\"做某事，后面通常接动词的过去分词。\n\n**5. 知识点总结**\n\n- \"suggest\"的使用：表示提出建议或观点，后面可以接双引号引起来的直接引语或者接that引导的宾语从句。\n- \"must be made\"的使用：这是被动语态的一种形式，表示\"必须\"做某事，后面接动词的过去分词。\n\n**6. 相似句子练习**\n\n\"Teachers did imply that reading books for pleasure is \"rewarding\" and \"enriching\". But under educational guidelines, emphasis must be placed on critical thinking skills.\"\n\n\"老师确实暗示，为乐趣阅读书籍是\"有益的\"和\"丰富的\"。但是在教育指导原则下，必须强调批判性思维技巧。\""},{"text":"Simply arranging a meeting, making a phone call, or hosting an event is not an “official act.”","explainMd":"**1. 翻译**\n\n\"仅仅安排一次会议，打个电话，或者举办一个活动并不构成'官方行为'。\"\n\n**2. 重难点词汇和短语**\n\n- **Simply**: 在此上下文中，\"simply\" 用来强调接下来列举的活动是基本或简单的行为。\n\n- **Arranging a meeting**: 这是一个动词短语，表示\"组织或安排一次会议\"。\n\n- **Making a phone call**: 另一个动词短语，意为\"打电话\"。\n\n- **Hosting an event**: 这个动词短语意味着\"举办或主持一个活动\"。\n\n- **Official act**: 这是一个法律术语，通常指公职人员在其职责范围内进行的行为或决定。\n\n**3. 句子结构**\n\n这是一个简单句子，其结构如下：\n\n- 主语：(隐含的)执行这些行为的人或实体。\n- 谓语：\"is\"。\n- 宾语：\"not an 'official act'\"。\n- 状语：\"Simply arranging a meeting, making a phone call, or hosting an event\"，这是一个由并列的动名词短语构成的状语。\n\n**4. 语法**\n\n- 在这个句子中，主要的语法构造是使用动名词作为主语，描述一系列的行动或活动，然后通过谓语\"是\"和宾语\"官方行为\"来指出这些行动或活动的性质或定义。\n\n**5. 知识点总结**\n\n- 在英语中，动名词可以用作主语，描述一系列的行动或活动。例如，\"arranging a meeting, making a phone call, or hosting an event\"。\n\n- \"Official act\" 是一个专门的法律术语，用来描述公职人员在职责范围内进行的行为。\n\n**6. 相似句子练习**\n\n\"Simply eating a meal, taking a walk, or reading a book is not 'exercising'.\"\n\n\"仅仅吃一顿饭，散步，或者阅读一本书，并不构成'锻炼'。\""}]},{"sentences":[{"text":"The court’s ruling is legally sound in defining a kind of favoritism that is not criminal.","explainMd":"**1. 翻译**\n\n\"法院的裁决在定义非犯罪性质的偏袒行为上具有法律效力。\"\n\n**2. 重难点词汇和短语**\n\n- **court's ruling**: 法院的裁决，指法院在案件中作出的决定或判决。\n- **legally sound**: 法律效力，指法律上的合理性和有效性。\n- **defining**: 定义，用于解释或明确某事物的含义。\n- **kind of favoritism**: 种类的偏袒，指某种特定类型的偏袒或不公平待遇。\n- **not criminal**: 非犯罪的，指不构成法律上的犯罪行为。\n\n**3. 句子结构**\n\n这是一个简单句，其结构如下：\n\n- 主语：\"The court's ruling\"\n- 谓语：\"is\"\n- 宾语：\"legally sound in defining a kind of favoritism that is not criminal\"\n\n**4. 语法**\n\n- 使用\"be动词 + 形容词\"的结构来形容主语。在此句中，\"is\" 和 \"legally sound\" 组成这样的结构。\n- \"in defining...\" 在此句中作为介词短语，用来修饰形容词 \"legally sound\"，说明法院裁决在何种方面具有法律效力。\n\n**5. 知识点总结**\n\n- 在英语中，我们可以使用 \"be动词 + 形容词\" 的结构来描述主语的状态或特性。\n- 介词短语可以用来修饰名词、动词、形容词等，提供更具体的信息。\n\n**6. 相似句子练习**\n\n\"The teacher's method is effective in illustrating a kind of problem that is not simple.\"\n\n\"教师的方法在阐述一类并非简单的问题上很有效。\""},{"text":"Elected leaders must be allowed to help supporters deal with bureaucratic problems without fear of prosecution of bribery.","explainMd":"**1. 翻译**\n\n\"选举出的领导人必须被允许在不担心贿赂起诉的情况下，帮助支持者处理官僚问题。\"\n\n**2. 重难点词汇和短语**\n\n- **Elected leaders**: 选举出的领导人，指通过公开选举产生的政府或组织的领导者。\n- **be allowed to**: 被允许去做某事，用来表达某人有权或得到许可去做某事。\n- **help supporters deal with**: 帮助支持者处理，意味着提供援助或服务以应对某种情况或问题。\n- **bureaucratic problems**: 官僚问题，通常指与政府或官方机构的程序、规定或管理有关的问题。\n- **without fear of prosecution of bribery**: 不担心贿赂起诉，指在不恐惧因涉嫌贿赂而受到法律起诉的情况下进行的行动。\n\n**3. 句子结构**\n\n这是一个简单句，其结构如下：\n\n- 主语： \"Elected leaders\"\n- 谓语： \"must be allowed\"\n- 宾语： \"to help supporters deal with bureaucratic problems\"\n- 状语： \"without fear of prosecution of bribery\"\n\n**4. 语法**\n\n- 使用\"must + be + 过去分词\"的结构来表示某事必须被允许或必须发生。\n- \"to do something\" 是一个动词不定式结构，用来作为宾语，说明被允许做的具体事情。\n- \"without doing something\" 是一个副词短语，用来修饰整个句子，表示在做某事时不需要做另一件事。\n\n**5. 知识点总结**\n\n- 在英语中，我们可以用\"must + be + 过去分词\"的结构来表达对某事的必要性或强制性。\n- 动词不定式可以作为动词的宾语，说明要做的具体行为。\n- 副词短语可以修饰整个句子，提供关于行为发生的条件、方式、原因、结果等额外信息。\n\n**6. 相似句子练习**\n\n\"Students must be encouraged to learn new skills without fear of making mistakes.\"\n\n\"学生们必须被鼓励学习新的技能，而不需要担心犯错误。\""},{"text":"“The basic compact underlying representative government,” wrote Chief Justice John Roberts for the court, “assumes that public officials will hear from their constituents and act on their concerns.”","explainMd":"**1. 翻译**\n\n\"法院首席大法官约翰·罗伯茨写道，'代表性政府背后的基本契约'是，公众官员将听取他们的选民并对其关切采取行动。\"\n\n**2. 重难点词汇和短语**\n\n- **The basic compact**: 基本契约，指一种基础理念或原则。\n- **underlying**: 背后的，这里用来描述代表性政府的基础或基本理念。\n- **representative government**: 代表性政府，一种政府形式，其中公民通过选举代表来制定政策和法律。\n- **public officials**: 公众官员，指在政府或公共部门工作并执行公共职责的人。\n- **hear from their constituents and act on their concerns**: 听取他们的选民并对其关切采取行动，这是公众官员的基本职责和期望行为。\n\n**3. 句子结构**\n\n这是一个复杂句，主句是 \"The basic compact underlying representative government assumes that public officials will hear from their constituents and act on their concerns\"，其中包含的从句是 \"public officials will hear from their constituents and act on their concerns\"。\n\n**4. 语法**\n\n句子主体采用了\"主语+动词+宾语\"的基本结构。\"that\"引导的从句作为\"assumes\"的宾语。\n\n**5. 知识点总结**\n\n- 在英语中，\"that\"可以用来引导名词从句，作为动词或名词的宾语。\n- \"underlying\"是一个形容词，通常用来描述某物的基础或基本特征。\n- \"hear from\"和\"act on\"都是短语动词，分别表示\"听取\"和\"采取行动\"。\n\n**6. 相似句子练习**\n\n\"The fundamental principle behind a democratic society implies that citizens have the right to express their opinions and make decisions.\"\n\n\"民主社会背后的基本原则暗示，公民有权表达他们的观点并做出决定。\""}]},{"sentences":[{"text":"But the ruling reinforces the need for citizens and their elected representatives, not the courts, to ensure equality of access to government.","explainMd":"**1. 翻译**\n\n\"然而，这个裁决强调了公民和他们的选出的代表，而不是法院，需要确保公平获得政府资源的必要性。\"\n\n**2. 重难点词汇和短语**\n\n- **the ruling**: 裁决，指法院或其他权威机构的正式决定。\n- **reinforces**: 强化，增强。\n- **the need for**: 对...的需要，表示对某事物的需求或必要性。\n- **citizens and their elected representatives**: 公民和他们选出的代表，这是指在一个民主社会中，公民通过选举选择代表他们的人。\n- **ensure equality of access to government**: 确保公平获取政府资源，意味着确保所有人都有平等的机会访问和利用政府的资源和服务。\n\n**3. 句子结构**\n\n主题句是\"But the ruling reinforces the need\", 其中的主题是\"the ruling\", 谓语是\"reinforces\", 宾语是\"the need\"。 \"for citizens and their elected representatives, not the courts, to ensure equality of access to government\"是一个介词短语，用来进一步解释\"the need\"。\n\n**4. 语法**\n\n本句采用了\"主语+动词+宾语\"的基本语法结构。 \"for\"引导的介词短语作为\"reinforces\"的宾语，进一步解释了\"the need\"。\n\n**5. 知识点总结**\n\n- 在英语中，\"for\"可以引导介词短语，用来进一步解释名词或动词的具体内容。\n- \"reinforces\"是一个动词，表示强化或增强某种观念、特性或行为。\n- \"and\"是一个并列连词，用来连接两个或多个相等的成分。\n\n**6. 相似句子练习**\n\n\"But the experience emphasizes the importance for students and their teachers, not the administrators, to ensure effective learning environment.\"\n\n\"然而，这种经验强调了学生和他们的教师，而不是管理员，来确保有效的学习环境的重要性。\""},{"text":"Officials must not be allowed to play favorites in providing information or in arranging meetings simply because an individual or group provides a campaign donation or a personal gift.","explainMd":"**1. 翻译**\n\n\"公务人员不应被允许仅仅因为某个个人或团体提供了竞选捐款或个人礼物就在提供信息或安排会议时偏袒某方。\"\n\n**2. 重难点词汇和短语**\n\n- **Officials**: 公务员，公职人员，指在政府机构工作的人。\n- **be allowed to**: 被允许去，表示给予许可或允许进行某种行为。\n- **play favorites**: 偏袒，表示对某些人或事物给予特殊的、不公平的优待。\n- **providing information or in arranging meetings**: 提供信息或安排会议，这是公务员的一些常规职责。\n- **simply because**: 仅仅因为，表示对某种行为或情况的单一原因的强调。\n- **campaign donation or a personal gift**: 竞选捐款或个人礼物，这是两种可能影响公务员行为的资金来源。\n\n**3. 句子结构**\n\n这个句子的主语是\"Officials\", 谓语是\"must not be allowed to play favorites\", 宾语是\"in providing information or in arranging meetings\". \"simply because an individual or group provides a campaign donation or a personal gift\"是一个副词短语，用来解释公务员为什么不能偏袒。\n\n**4. 语法**\n\n这个句子使用了被动语态的形式 \"be allowed to\"，用来强调公务员的行为受到了规则的限制。此外，\"because\"引导的原因状语从句进一步解释了这种限制的原因。\n\n**5. 知识点总结**\n\n- 在英语中，\"be allowed to\"是一个常用的被动语态短语，用来表示允许或不允许进行某种行为。\n- \"because\"可以引导原因状语从句，用来解释主句的原因或理由。\n- \"or\" 是一个并列连词，用来连接两个或多个并列的成分。\n\n**6. 相似句子练习**\n\n\"Students should not be allowed to skip classes simply because they are top performers or they make significant contributions to the school.\"\n\n\"学生们不应该仅仅因为他们是优秀的表现者或者他们对学校做出了重大贡献就被允许旷课。\""}]},{"sentences":[{"text":"This type of integrity requires well-enforced laws in government transparency, such as records of official meetings, rules on lobbying, and information about each elected leader’s source of wealth.","explainMd":"**1. 翻译**\n\n\"这种类型的诚信需要政府透明度的严格执行的法律，如官方会议的记录，游说的规则，以及每个选举领导者的财富来源的信息。\"\n\n**2. 重难点词汇和短语**\n\n- **This type of integrity**: 这种类型的诚信，指的是公务员在行使职权时的公正和公平。\n- **requires**: 需要，表示必须有某种条件或事物。\n- **well-enforced laws**: 严格执行的法律，表示法律被严格地执行和遵守。\n- **in government transparency**: 在政府透明度方面，表示法律在确保政府透明度方面的作用。\n- **such as**: 例如，用来引出后面的几个例子。\n- **records of official meetings, rules on lobbying, and information about each elected leader’s source of wealth**: 官方会议的记录，游说的规则，以及每个选举领导者的财富来源的信息，这些都是确保政府透明度的一些方法。\n\n**3. 句子结构**\n\n这个句子的主语是\"This type of integrity\", 动词是\"requires\", 宾语是\"well-enforced laws in government transparency\". \"such as...\"是一个并列结构，用来列举出一些具体的例子。\n\n**4. 语法**\n\n这个句子使用了现在时态，表示一种常态或事实。\"such as\"用来引出一个或多个并列的例子，这些例子都是主句中的内容的实例。\n\n**5. 知识点总结**\n\n- \"requires\"是一个常见的动词，用来表示需要或必要。\n- \"such as\"是一个常见的短语，用来引出一个或多个例子。\n- \"in\"在这里被用作介词，表示在某个领域或方面。\n\n**6. 相似句子练习**\n\n\"Effective learning requires well-established habits, such as regular study, active participation in class, and regular review of the material.\"\n\n\"有效的学习需要良好的习惯，如定期学习，积极参与课堂，以及定期复习材料。\""}]},{"sentences":[{"text":"Favoritism in official access can fan public perceptions of corruption.","explainMd":"**1. 翻译**\n\n\"官方通道中的偏袒可以煽动公众对腐败的认知。\"\n\n**2. 重难点词汇和短语**\n\n- **Favoritism in official access**: 官方通道中的偏袒，这是指一种在提供公共资源或服务时，对某些人或团体给予优待的行为。\n- **can fan**: 可以煽动，表示某种行为可能引发或增强另一种现象或行为。\n- **public perceptions of corruption**: 公众对腐败的认知，这是指公众对腐败现象的理解和看法。\n\n**3. 句子结构**\n\n这个句子的主语是\"Favoritism in official access\", 动词是\"can fan\", 宾语是\"public perceptions of corruption\". 这是一个简单的主动句，主语执行动词表示的行为。\n\n**4. 语法**\n\n这个句子使用了现在时态，表示一种可能的情况或结果。\"can\"是一个模态动词，表示可能性。\n\n**5. 知识点总结**\n\n- \"Favoritism in\"是一个常见的构词方式，表示在某个领域或方面的偏袒。\n- \"can\"是一个模态动词，表示可能性。\n- \"public perceptions of\"是一个常见的短语，表示公众对某一现象或问题的看法。\n\n**6. 相似句子练习**\n\n\"Discrimination in employment can fuel public perceptions of social injustice.\"\n\n\"就业中的歧视可以煽动公众对社会不公的认知。\""},{"text":"But it is not always corruption.","explainMd":"**1. 翻译**\n\n\"但它并不总是腐败。\"\n\n**2. 重难点词汇和短语**\n\n- **But**: 但是，用于连接并对比两个不同的概念或事实。\n- **it**: 它，代词，在这个句子中代指的是前文提到的“Favoritism in official access”（官方通道中的偏袒）。\n- **is not always**: 并不总是，表达某事并非在所有情况下都持续存在的概念。\n- **corruption**: 腐败，指的是公共职能被私人利益歪曲或滥用的现象。\n\n**3. 句子结构**\n\n这是一个简单句。主语是\"it\"，链接动词是\"is not\"，谓语是\"always corruption\"。这个句子是在对比和澄清“它（偏袒）”并不总是等同于“腐败”。\n\n**4. 语法**\n\n这个句子使用了现在时态，表达的是一种普遍的事实或观点。\"always\"是一个频率副词，用于描述动词的进行的频率。\"not always\"的结构用来表示某事并不总是发生。\n\n**5. 知识点总结**\n\n- \"But\" 是一个转折连词，用于引出与前文相对的观点。\n- \"is not always\" 是一个否定加频率副词的结构，用于表示某事并不总是发生。\n- 这是一个简单句，结构清晰，没有太复杂的语法现象。\n\n**6. 相似句子练习**\n\n\"But it is not always the case.\"\n\n\"但这并不总是事实。\""},{"text":"Rather officials must avoid double standards, or different types of access for average people and the wealthy.","explainMd":"**1. 翻译**\n\n\"相反，官员必须避免双重标准，或者对普通人和富人提供不同类型的接入方式。\"\n\n**2. 重难点词汇和短语**\n\n- **Rather**: 相反，用于提出与前一句话相对的情况或观点。\n- **officials**: 官员，指执行公务的人员，特别是政府的行政人员。\n- **must avoid**: 必须避免，表达一种强烈的义务或要求。\n- **double standards**: 双重标准，指在同样的情况下对不同的人或事物采取的不一样的标准或态度。\n- **different types of access for average people and the wealthy**: 对普通人和富人提供不同类型的接入方式，这是指在提供服务或资源时，对不同社会经济地位的人采取的不一样的方式或政策。\n\n**3. 句子结构**\n\n这是一个复合句，由两个并列的主谓结构组成。第一个主谓结构是\"officials must avoid double standards\"，第二个主谓结构是\"officials must avoid different types of access for average people and the wealthy\"。两个主谓结构通过并列连词\"or\"连接在一起。\n\n**4. 语法**\n\n这个句子使用了现在时态，表示一种当前的要求或期望。\"must\"是一个模态动词，表示义务或必须。\"or\"是一个并列连词，用于连接两个并列的事物或情况。\n\n**5. 知识点总结**\n\n- \"Rather\" 是一个转折副词，表示与前一句话相对的情况或观点。\n- \"must\" 是一个模态动词，表示义务或必须。\n- 在一个句子中可以使用\"or\"连接两个并列的主谓结构，构成复合句。\n\n**6. 相似句子练习**\n\n\"Rather, teachers should focus on practical skills, or ways to apply knowledge in real-life situations.\"\n\n\"相反，教师应该关注实践技能，或者如何在实际生活中应用知识。\""},{"text":"If connections can be bought, a basic premise of democratic society—that all are equal in treatment by government—is undermined.","explainMd":"**1. 翻译**\n\n\"如果关系可以被购买，那么民主社会的一个基本前提——政府对所有人的平等对待——就会被破坏。\"\n\n**2. 重难点词汇和短语**\n\n- **connections**: 关系，指在社会或商业中建立的人际关系网络。\n- **can be bought**: 可以被购买，表示一种可能性，指关系或友情可以通过金钱或其他方式来获取。\n- **a basic premise of democratic society**: 民主社会的一个基本前提，指民主社会的一个基本理念或假设。\n- **all are equal in treatment by government**: 政府对所有人的平等对待，指政府在服务或政策制定时对所有公民都持平等的态度。\n- **is undermined**: 被破坏，指一种情况或理念的基础或有效性被削弱。\n\n**3. 句子结构**\n\n这是一个复合句，主要包含两个部分：条件状语从句\"If connections can be bought\"和主句\"a basic premise of democratic society—that all are equal in treatment by government—is undermined\"。在主句中，\"that all are equal in treatment by government\"是一个定语从句，修饰\"a basic premise of democratic society\"。\n\n**4. 语法**\n\n- \"If\"引导的条件状语从句，表示一种假设的情况。\n- 在主句中，使用了\"that\"引导的定语从句，修饰\"a basic premise of democratic society\"。\n- \"is undermined\"使用了被动语态，表示\"一个基本前提\"是被动的，主动的动作是\"被破坏\"。\n\n**5. 知识点总结**\n\n- 使用\"If\"引导的条件状语从句表达假设的情况。\n- \"that\"可以引导定语从句，修饰名词或代词。\n- 当主语是动作的接受者时，可以使用被动语态。\n\n**6. 相似句子练习**\n\n\"If trust can be broken, a fundamental principle of friendship—that all are equal in respect—gets damaged.\"\n\n\"如果信任可以被破坏，那么友谊的一个基本原则——所有人在尊重上是平等的——就会受到损害。\""},{"text":"Good governance rests on an understanding of the inherent worth of each individual.","explainMd":"**1. 翻译**\n\n\"良好的治理依赖于对每个个体固有价值的理解。\"\n\n**2. 重难点词汇和短语**\n\n- **Good governance**: 良好的治理，指有效、公正、透明的管理和决策过程。\n- **rests on**: 依赖于，基于，强调某事的成功依赖于某事或某人。\n- **an understanding of**: 对…的理解，表示对某个概念或事物的理解和认识。\n- **the inherent worth of each individual**: 每个个体的固有价值，强调每个人都有其固有的、不可替代的价值。\n\n**3. 句子结构**\n\n这是一个简单句，主语是\"Good governance\"，谓语是\"rests on\"，宾语是\"an understanding of the inherent worth of each individual\"。\n\n**4. 语法**\n\n- \"rests on\"是一个动词短语，表示依赖或基于某事物。\n- \"an understanding of\"是一个名词短语，作为\"rests on\"的宾语。\n- \"the inherent worth of each individual\"是\"an understanding of\"的宾语，这里使用了\"of\"来表示从属关系。\n\n**5. 知识点总结**\n\n- 动词短语可以增加句子的描述性和准确性。\n- \"of\"可以用于表示从属关系，如在\"an understanding of the inherent worth of each individual\"中的使用。\n- 理解和尊重每个个体的固有价值是良好治理的基础。\n\n**6. 相似句子练习**\n\n\"Effective communication relies on a mutual understanding of each other's perspectives.\"\n\n\"有效的沟通依赖于对彼此观点的相互理解。\""}]},{"sentences":[{"text":"The court’s ruling is a step forward in the struggle against both corruption and official favoritism.","explainMd":"**1. 翻译**\n\n\"法院的裁决是对抗腐败和官方偏袒的斗争中的一步前进。\"\n\n**2. 重难点词汇和短语**\n\n- **The court's ruling**: 法院的裁决，指法院的判决或决定。\n- **is a step forward**: 是一步前进，表示有所进展，有所改善。\n- **in the struggle against**: 在对抗...的斗争中，表示在某种情况或问题上的抗争或反抗。\n- **both corruption and official favoritism**: 腐败和官方偏袒，两者都是对公平和公正的威胁。\n\n**3. 句子结构**\n\n这是一个简单句，主语是\"The court's ruling\"，谓语是\"is\"，宾语是\"a step forward in the struggle against both corruption and official favoritism\"。\n\n**4. 语法**\n\n- \"is a step forward\"是一个动词短语，表示有所进步或改善。\n- \"in the struggle against\"是一个介词短语，表示在对抗某种情况或问题的斗争中。\n- \"both corruption and official favoritism\"是并列的宾语，表示两种需要对抗的问题。\n\n**5. 知识点总结**\n\n- 动词短语可以增加句子的描述性和准确性。\n- 介词短语可以用来表示在某种情境或背景下的行动或状态。\n- 并列的宾语可以用来同时表示两种或多种情况。\n\n**6. 相似句子练习**\n\n\"Her promotion is a step forward in the fight for gender equality in the workplace.\"\n\n\"她的晋升是在职场性别平等斗争中的一步前进。\""}]}],"title":""}