{"translate":"","paragraphs":[{"sentences":[{"text":"“The ancient Hawaiians were astronomers,” wrote Queen Liliuokalani, Hawaii's last reigning monarch, in 1897.","explainMd":"**1. 翻译：**\n\n\"“古代的夏威夷人都是天文学家，”夏威夷最后一位在位的君主，莉丽乌奥卡拉尼女王在1897年写道。\"\n\n**2. 重难点词汇和短语：**\n\n- **The ancient Hawaiians**: 古代的夏威夷人\n- **astronomers**: 天文学家\n- **Queen Liliuokalani**: 莉丽乌奥卡拉尼女王\n- **reigning monarch**: 在位的君主\n\n**3. 句子结构：**\n\n这是一个简单句，句子结构为：主语+谓语+宾语。\n\n- **主语**：The ancient Hawaiians（古代的夏威夷人）\n- **谓语**：were astronomers（是天文学家）\n- **宾语**：wrote Queen Liliuokalani, Hawaii's last reigning monarch, in 1897（莉丽乌奥卡拉尼女王在1897年写道）\n\n**4. 语法：**\n\n这个句子是一个带有引述的句子。用了过去时态，表示在过去某个具体时间点发生的事情。\n\n**5. 知识点总结：**\n\n- 了解如何引述他人的话语。\n- 了解过去时态的使用，并能正确使用它来表示过去发生的事情。\n- 了解一些关于天文学和历史的词汇。\n\n**6. 相似句子练习：**\n\n\"“The ancient Egyptians were great builders,” wrote King Tutankhamun, Egypt's most famous Pharaoh, in 1323 BC.\"\n\n\"“古代埃及人是伟大的建筑师，”埃及最著名的法老图坦卡蒙王在公元前1323年写道。\""},{"text":"Star watchers were among the most esteemed members of Hawaiian society.","explainMd":"**1. 翻译：**\n\n\"星星的观察者是夏威夷社会中最受尊敬的成员之一。\"\n\n**2. 重难点词汇和短语：**\n\n- **Star watchers**: 星星的观察者，这里可以理解为对星星进行观察和研究的人，即天文学家。\n- **were among**: 是……之一\n- **the most esteemed members**: 最受尊敬的成员\n- **Hawaiian society**: 夏威夷社会\n\n**3. 句子结构：**\n\n这是一个简单句，句子结构为：主语+谓语+宾语。\n\n- **主语**：Star watchers（星星的观察者）\n- **谓语**：were（是）\n- **宾语**：among the most esteemed members of Hawaiian society（夏威夷社会中最受尊敬的成员之一）\n\n**4. 语法：**\n\n这个句子使用了过去时态，表示在过去的某个不特定时间里，星星的观察者（天文学家）在夏威夷社会中是最受尊敬的成员之一。\n\n**5. 知识点总结：**\n\n- 学习了如何用\"were among\"这个短语来表示\"是……之一\"的含义。\n- 了解了如何描述一个社会群体中的地位和重要性。\n\n**6. 相似句子练习：**\n\n\"Storytellers were among the most revered members of ancient Greek society.\"\n\n\"讲故事的人是古希腊社会中最受尊敬的成员之一。\""},{"text":"Sadly, all is not well with astronomy in Hawaii today.","explainMd":"**1. 翻译：**\n\n\"遗憾的是，今天夏威夷的天文学并不是一切都好。\"\n\n**2. 重难点词汇和短语：**\n\n- **Sadly**: 遗憾的是，表达情绪的副词。\n- **all is not well with**: 并不是一切都好，表达某事或某物存在问题的短语。\n- **astronomy**: 天文学，科学的一个分支，它研究宇宙以外的所有事物。\n- **in Hawaii today**: 在今天的夏威夷，表示地点和时间的短语。\n\n**3. 句子结构：**\n\n这是一个简单句，句子结构为：状语+主语+谓语。\n\n- **状语**：Sadly（遗憾的是）\n- **主语**：all（一切）\n- **谓语**：is not well with astronomy in Hawaii today（与今天的夏威夷天文学并不都好）\n\n这里的状语 \"Sadly\" 修饰整个句子，表示说话者对于现状的情感态度。\n\n**4. 语法：**\n\n这个句子使用了现在时态，表示目前的状态或情况。在这里，\"all is not well with\" 是一个固定短语，用来表示某事物存在问题。\n\n**5. 知识点总结：**\n\n- 学习了如何用 \"all is not well with\" 来表达某事或某物存在问题的情况。\n- 了解了 \"Sadly\" 如何作为状语来表达说话者的情感态度。\n\n**6. 相似句子练习：**\n\n\"Sadly, all is not well with the environment in the city today.\"\n\n\"遗憾的是，今天这个城市的环境并不是一切都好。\""},{"text":"Protests have erupted over construction of the Thirty Meter Telescope (TMT), a giant observatory that promises to revolutionize humanity’s view of the cosmos.","explainMd":"**1. 翻译：**\n\n\"对于建造三十米望远镜（TMT）的计划，一种承诺将彻底改变人类对宇宙观念的巨大天文台，抗议活动已经爆发。\"\n\n**2. 重难点词汇和短语：**\n\n- **Protests**: 抗议，表示对某事的不满或反对的公开表达。\n- **have erupted**: 已经爆发，表示某事已经突然开始发生。\n- **over construction of**: 对...的建设，表示抗议的对象是什么。\n- **the Thirty Meter Telescope (TMT)**: 三十米望远镜，特定的天文观测设备的名称。\n- **a giant observatory**: 一个巨大的天文台，描述TMT的性质和规模。\n- **that promises to revolutionize**: 承诺将彻底改变，引导定语从句，描述TMT的重要性和影响力。\n- **humanity’s view of the cosmos**: 人类对宇宙的观念，表示TMT可能会改变的东西。\n\n**3. 句子结构：**\n\n这是一个复杂句，句子结构为：主语 + 谓语 + 宾语 + 定语从句。\n\n- **主语**：Protests（抗议）\n- **谓语**：have erupted（已经爆发）\n- **宾语**：over construction of the Thirty Meter Telescope (TMT)（对三十米望远镜的建设）\n- **定语从句**：a giant observatory that promises to revolutionize humanity’s view of the cosmos（一个承诺将彻底改变人类对宇宙观念的巨大天文台）\n\n这里的定语从句 \"that promises to revolutionize humanity’s view of the cosmos\" 修饰 \"a giant observatory\"，描述TMT的性质和可能的影响。\n\n**4. 语法：**\n\n这个句子使用了现在完成时态，表示从过去某一时间点开始，一直持续到现在的动作或状态。\"have erupted\" 这个短语就是现在完成时态的形式。\n\n**5. 知识点总结：**\n\n- 这句话使用了**现在完成时**（\"have erupted\"），用于表示从过去某一时间点开始，一直持续到现在的动作或状态。现在完成时常用于强调动作对现在的影响或结果。\n- 句子中用到了一个**定语从句**（\"that promises to revolutionize humanity’s view of the cosmos\"），这是一种从句，用于修饰名词或代词。在此句中，定语从句用来修饰 \"a giant observatory\"，提供有关该天文台的更多信息。\n- 句中涉及到了一些专业词汇，如 \"the Thirty Meter Telescope (TMT)\" 和 \"observatory\"，这些词汇在天文学领域具有特定的意义。理解这些词汇的准确含义对于理解整个句子的意思至关重要。\n\n**6. 相似句子练习：**\n\n\"Debates have emerged over the development of artificial intelligence (AI), a powerful tool that promises to revolutionize our way of life.\"\n\n\"关于人工智能（AI）的发展，一种承诺将彻底改变我们生活方式的强大工具，辩论已经出现。\""}]},{"sentences":[{"text":"At issue is the TMT’s planned location on Mauna Kea, a dormant volcano worshiped by some Hawaiians as the piko, that connects the Hawaiian Islands to the heavens.","explainMd":"**1. 翻译：**\n\n\"问题的焦点在于TMT计划在玛纳凯阿山上的选址，这座休眠火山被一些夏威夷人奉为皮科（脐），将夏威夷群岛与天堂连接起来。\"\n\n**2. 重难点词汇和短语：**\n\n- **At issue**: 在讨论中，问题的焦点\n- **TMT’s planned location**: TMT的计划位置\n- **Mauna Kea**: 玛纳凯阿山，位于夏威夷的一座山\n- **a dormant volcano**: 一座休眠的火山\n- **worshiped by some Hawaiians as the piko**: 被一些夏威夷人奉为皮科\n- **that connects the Hawaiian Islands to the heavens**: 将夏威夷群岛与天堂连接起来\n\n**3. 句子结构：**\n\n这是一个复杂句，句子结构为：主语 + 谓语 + 宾语 + 定语从句。\n\n- **主语**：At issue（问题的焦点）\n- **谓语**：is（是）\n- **宾语**：the TMT’s planned location on Mauna Kea（TMT在玛纳凯阿山的计划位置）\n- **定语从句**：a dormant volcano worshiped by some Hawaiians as the piko, that connects the Hawaiian Islands to the heavens（一座被一些夏威夷人奉为皮科的休眠火山，它将夏威夷群岛与天堂连接起来）\n\n这里的定语从句 \"a dormant volcano worshiped by some Hawaiians as the piko, that connects the Hawaiian Islands to the heavens\" 修饰 \"the TMT’s planned location on Mauna Kea\"，提供有关TMT计划选址的具体信息。\n\n**4. 语法：**\n\n这个句子使用了简单的现在时态（\"is\"），表示一个客观存在的事实。句子也包含一个由\"that\"引导的定语从句，用来描述和修饰前面的宾语。\n\n**5. 知识点总结：**\n\n- 句子使用了现在时态，表示一个客观存在的事实或状态。\n- 句子中的定语从句，由\"that\"引导，用来修饰和描述前面的宾语，提供更具体的信息。\n- 句子中涉及了一些地理和文化特定的词汇，如 \"Mauna Kea\" 和 \"piko\"，理解这些词汇的含义对于理解整个句子的意思是必要的。\n\n**6. 相似句子练习：**\n\n\"At stake is the new airport's planned location in the Bird's Nest, a natural habitat venerated by some locals as the sanctuary, that connects the city with nature.\"\n\n\"问题的焦点在于新机场在Bird's Nest的计划选址，这个自然栖息地被一些当地人视为圣地，将城市与自然连接起来。\""},{"text":"But Mauna Kea is also home to some of the world’s most powerful telescopes.","explainMd":"**1. 翻译：**\n\n\"但是，玛纳凯阿山也是世界上一些最强大望远镜的所在地。\"\n\n**2. 重难点词汇和短语：**\n\n- **But**: 但是，连接词，用于表示转折。\n- **Mauna Kea**: 玛纳凯阿山，夏威夷的一座山脉。\n- **is also home to**: 也是...的所在地。\n- **some of the world’s most powerful telescopes**: 世界上一些最强大的望远镜。\n\n**3. 句子结构：**\n\n这是一个简单句。句子结构为：转折词 + 主语 + 谓语 + 宾语。\n\n- **转折词**：But（但是）\n- **主语**：Mauna Kea（玛纳凯阿山）\n- **谓语**：is also home to（也是...的所在地）\n- **宾语**：some of the world’s most powerful telescopes（世界上一些最强大的望远镜）\n\n**4. 语法：**\n\n这个句子使用了简单的现在时态（\"is\"），表示一个客观存在的事实。\n\n**5. 知识点总结：**\n\n- 句子使用了现在时态，表示一个客观存在的事实或状态。\n- 句子中的转折词 \"But\"，用来引导转折，表示与前文对比的新信息。\n- \"is also home to\" 是一个常见的表达，表明某个地方是某些人或事物的居住地或所在地。\n\n**6. 相似句子练习：**\n\n\"But the Pacific Ocean is also home to some of the world's most diverse marine life.\"\n\n\"但是，太平洋也是世界上一些最多样化的海洋生物的家园。\""},{"text":"Rested in the Pacific Ocean, Mauna Kea’s peak rises above the bulk of our planet’s dense atmosphere, where conditions allow telescopes to obtain images of unsurpassed clarity.","explainMd":"**1. 翻译：**\n\n\"位于太平洋中的玛纳凯阿山峰，高出我们星球浓密大气层的大部分，那里的条件使望远镜能够获得无与伦比的清晰的图像。\"\n\n**2. 重难点词汇和短语：**\n\n- **Rested**: 位于\n- **Bulk**: 大部分\n- **Dense**: 浓密的\n- **Atmosphere**: 大气层\n- **Allow**: 允许\n- **Obtain**: 获得\n- **Unsurpassed**: 无与伦比的\n- **Clarity**: 清晰度\n- **Rested in the Pacific Ocean**: 位于太平洋中\n- **the bulk of our planet’s dense atmosphere**: 我们星球浓密大气层的大部分\n- **where conditions allow**: 其条件使得\n- **obtain images of unsurpassed clarity**: 获得无与伦比的清晰的图像\n\n**3. 句子结构：**\n\n这个句子是一个复杂句。句子结构为：主语+状语+主语+谓语+宾语。\n\n- **主语1**：Rested in the Pacific Ocean（位于太平洋中）\n- **状语**：Mauna Kea’s peak（玛纳凯阿山峰）\n- **主语2**：rises above the bulk of our planet’s dense atmosphere（高出我们星球浓密大气层的大部分）\n- **谓语**：where conditions allow（其条件使得）\n- **宾语**：telescopes to obtain images of unsurpassed clarity（望远镜能够获得无与伦比的清晰的图像）\n\n**4. 语法：**\n\n这个句子使用了现在时态（\"rises\"），表明一个客观存在的现象。此外，\"where\" 引导了一个定语从句，修饰 \"our planet’s dense atmosphere\"。\n\n**5. 知识点总结：**\n\n- \"Rested in the Pacific Ocean\" 是一个过去分词短语，用作状语，表明地点。\n- \"rises above\" 是一个动词短语，表明行动或状态。\n- \"the bulk of\" 是一个常用表达，表示 \"...的大部分\"。\n- \"where conditions allow\" 是一个定语从句，描述了特定的条件或环境。\n\n**6. 相似句子练习：**\n\n\"Located in the heart of the city, the skyscraper towers over the majority of the surrounding buildings, where its height provides a spectacular view of the cityscape.\"\n\n\"位于城市的中心，那座摩天大楼高出周围的大多数建筑，其高度为城市景观提供了壮观的视野。\""}]},{"sentences":[{"text":"Opposition to telescopes on Mauna Kea is nothing new.","explainMd":"**1. 翻译:**  \n\"对于在玛纳凯阿山上设置望远镜的反对声音并不是新鲜事。\"\n\n**2. 重难点词汇和短语：**  \n\n- **Opposition**: 反对\n- **telescopes**: 望远镜\n- **Mauna Kea**: 玛纳凯阿山\n- **nothing new**: 并不新鲜，不是新事物\n\n**3. 句子结构：**  \n\n这是一个简单句。句子结构如下：\n\n主语(Subject) + 谓语(Verb) + 宾语(Object)\n\n- 主语(Subject): Opposition to telescopes on Mauna Kea （对于在玛纳凯阿山上的望远镜的反对）\n- 谓语(Verb): is （是）\n- 宾语(Object): nothing new （并不新鲜）\n\n**4. 语法：**  \n\n这是一个简单句，主语是名词短语，谓语是系动词\"is\"，宾语是形容词短语。\n\n**5. 知识点总结：**  \n\n这个句子结构简单，主要是通过名词短语作为主语，形容词短语作为宾语，通过系动词\"is\"连接，形成了完整的句子。\n\n**6. 相似句子练习：**  \n\n\"Resistance to change is nothing new.\"  \n\"对改变的抵抗并不是新鲜事。\""},{"text":"A small but vocal group of Hawaiians and environmentalists have long viewed their presence as disrespect for sacred land and a painful reminder of the occupation of what was once a sovereign nation.","explainMd":"**1. 翻译：**\n\n\"一小群但声音很大的夏威夷人和环保人士长期以来都认为他们的存在是对神圣土地的不尊重，并且是对曾经是主权国家的占领的痛苦提醒。\"\n\n**2. 重难点词汇和短语：**\n\n- **A small but vocal group**: 一小群但声音很大的人\n- **Hawaiians**: 夏威夷人\n- **environmentalists**: 环保人士\n- **viewed their presence as**: 把他们的存在视为\n- **disrespect for sacred land**: 对神圣土地的不尊重\n- **a painful reminder**: 一个痛苦的提醒\n- **the occupation of what was once a sovereign nation**: 曾经是主权国家的占领\n\n**3. 句子结构：**\n\n这是一个复合句。句子结构如下：\n\n主语(Subject) + 谓语(Verb) + 宾语(Object)\n\n- 主语(Subject): A small but vocal group of Hawaiians and environmentalists （一小群但声音很大的夏威夷人和环保人士）\n- 谓语(Verb): have long viewed （长期以来都认为）\n- 宾语(Object): their presence as disrespect for sacred land and a painful reminder of the occupation of what was once a sovereign nation （他们的存在是对神圣土地的不尊重，并且是对曾经是主权国家的占领的痛苦提醒）\n\n**4. 语法：**\n\n这个句子中使用了现在完成时，表示过去发生的行为或者状态对现在造成的影响或者结果。此外，句子中还使用了\"as\"作为介词，表示\"被视为\"的意思。\n\n**5. 知识点总结：**\n\n这个句子中的主要知识点有两个：现在完成时的使用和\"as\"作为介词的使用。现在完成时表示过去发生的行为对现在的影响，而\"as\"作为介词则表示\"被视为\"的意思。\n\n**6. 相似句子练习：**\n\n\"A small but vocal group of students has long viewed the school rules as a restriction on their freedom.\"  \n\"一小群但声音很大的学生长期以来都认为学校的规定是对他们自由的限制。\""}]},{"sentences":[{"text":"Some blame for the current controversy belongs to astronomers.","explainMd":"**1. 翻译：**\n\n\"一些人认为，当前的争议部分归咎于天文学家。\"\n\n**2. 重难点词汇和短语：**\n\n- **Some**: 一些\n- **blame**: 归咎于，责备\n- **for the current controversy**: 对于当前的争议\n- **belongs to**: 属于\n- **astronomers**: 天文学家\n\n**3. 句子结构：**\n\n这是一个简单句。句子结构如下：\n\n主语(Subject) + 谓语(Verb) + 宾语(Object)\n\n- 主语(Subject): Some blame for the current controversy （对于当前争议的一些责备）\n- 谓语(Verb): belongs （属于）\n- 宾语(Object): astronomers （天文学家）\n\n**4. 语法：**\n\n这个句子使用了一般现在时，表达的是一种客观的，普遍存在的事实。此外，\"blame\"在这里作为名词，意思是\"责备\"；\"belongs to\"是一个短语，表示\"属于\"。\n\n**5. 知识点总结：**\n\n这个句子中的主要知识点有两个：一般现在时的使用和\"belongs to\"短语的使用。一般现在时用来表达客观的，普遍存在的事实；而\"belongs to\"短语则表示\"属于\"的意思。\n\n**6. 相似句子练习：**\n\n\"Some responsibility for the environmental problems belongs to the industries.\"\n\"一些对于环境问题的责任归咎于工业。\""},{"text":"In their eagerness to build bigger telescopes, they forgot that science is not the only way of understanding the world.","explainMd":"**1. 翻译：**\n\n\"在他们急于建立更大望远镜的过程中，他们忘记了科学并非理解世界的唯一方式。\"\n\n**2. 重难点词汇和短语：**\n\n- **In their eagerness to**: 在他们急于……的过程中\n- **build bigger telescopes**: 建立更大的望远镜\n- **forgot**: 忘记了\n- **science**: 科学\n- **is not the only way of**: 并非……的唯一方式\n- **understanding the world**: 理解世界\n\n**3. 句子结构：**\n\n这是一个复合句，包含一个主句和一个状语从句。句子结构如下：\n\n状语从句 + 主句\n\n- 状语从句：In their eagerness to build bigger telescopes （在他们急于建立更大望远镜的过程中）\n- 主句：\n  - 主语(Subject): they （他们）\n  - 谓语(Verb): forgot （忘记了）\n  - 宾语(Object): that science is not the only way of understanding the world （科学并非理解世界的唯一方式）\n\n**4. 语法：**\n\n该句子使用了一般过去时态，表达过去发生的行为或状态。另外，\"In their eagerness to\"是一个介词短语，用作状语，表达原因；\"that\"引导的宾语从句作为\"forgot\"的宾语。\n\n**5. 知识点总结：**\n\n这个句子中的主要知识点有两个：一般过去时的使用和介词短语作状语的用法。一般过去时用来表达过去的行为或状态；而介词短语作状语可以表达原因、条件、方式、目的等。\n\n**6. 相似句子练习：**\n\n\"In their haste to finish the project, they overlooked some critical details.\"\n\"在他们急于完成项目的过程中，他们忽视了一些关键的细节。\""},{"text":"They did not always prioritize the protection of Mauna Kea’s fragile ecosystems or its holiness to the islands’ inhabitants.","explainMd":"**1. 翻译：**\n\n\"他们并未总是优先考虑保护马纳基阿山脆弱的生态系统或对岛民神圣的尊重。\"\n\n**2. 重难点词汇和短语：**\n\n- **They did not always prioritize**: 他们并未总是优先考虑\n- **the protection of**: 保护\n- **Mauna Kea’s fragile ecosystems**: 马纳基阿山脆弱的生态系统\n- **or its holiness**: 或对其神圣的尊重\n- **to the islands’ inhabitants**: 对岛民\n\n**3. 句子结构：**\n\n这是一个复合句，包含一个主句和一个并列结构。句子结构如下：\n\n主句 + 并列结构\n\n- 主句：\n  - 主语(Subject): They （他们）\n  - 谓语(Verb): did not always prioritize （并未总是优先考虑）\n  - 宾语(Object): the protection of Mauna Kea’s fragile ecosystems （保护马纳基阿山脆弱的生态系统）\n\n- 并列结构：or its holiness to the islands’ inhabitants （或对岛民神圣的尊重）\n\n**4. 语法：**\n\n该句子使用了一般过去时态，表达过去的行为或习惯。\"They did not always prioritize\" 是一个否定句式，\"or\"连接了两个并列的宾语。\n\n**5. 知识点总结：**\n\n这个句子主要涉及的知识点有：一般过去时态的使用，否定句式的构造，以及并列结构的运用。\"They did not always prioritize\" 表达的是过去的一个持续或习惯的动作，并且是否定形式。\"or\" 用来连接两个并列的宾语，展示了两种不同的考虑点。\n\n**6. 相似句子练习：**\n\n\"They did not always consider the importance of maintaining a balanced diet or its benefits to their health.\"\n\"他们并未总是考虑维持均衡饮食的重要性或其对他们健康的益处。\""},{"text":"Hawaiian culture is not a relic of the past; it is a living culture undergoing a renaissance today.","explainMd":"**1. 翻译：**\n\n\"Hawaiian culture is not a relic of the past; it is a living culture undergoing a renaissance today.\"\n\n\"夏威夷文化并非过去的遗物；它是一种正在今天经历复兴的活生生的文化。\"\n\n**2. 重难点词汇和短语：**\n\n- **Hawaiian culture**: 夏威夷文化\n- **relic of the past**: 过去的遗物\n- **a living culture**: 活生生的文化\n- **undergoing a renaissance**: 正在经历复兴\n\n**3. 句子结构：**\n\n这是一个复合句，由两个并列的简单句通过分号连接。句子结构如下：\n\n- 句子1：主语+谓语+宾语\n  - 主语(Subject): Hawaiian culture （夏威夷文化）\n  - 谓语(Verb): is （是）\n  - 宾语(Object): not a relic of the past （并非过去的遗物）\n\n- 句子2：主语+谓语+宾语\n  - 主语(Subject): it （它）\n  - 谓语(Verb): is （是）\n  - 宾语(Object): a living culture undergoing a renaissance today （正在今天经历复兴的活生生的文化）\n\n**4. 语法：**\n\n这个句子使用了现在进行时，表示现在正在进行或发生的动作。\"is not\" 和 \"is\" 是 be 动词的现在时。\n\n**5. 知识点总结：**\n\n这个句子主要涉及的知识点有：现在进行时态的使用，以及复合句的构造。\"Hawaiian culture is not a relic of the past\" 和 \"it is a living culture undergoing a renaissance today\" 是两个并列的简单句，通过分号连接，形成一个复合句。\n\n**6. 相似句子练习：**\n\n\"Chinese calligraphy is not a lost art; it is a vibrant tradition experiencing a revival today.\"\n\"中国书法并非失落的艺术；它是一种正在今天经历复兴的充满活力的传统。\""}]},{"sentences":[{"text":"Yet science has a cultural history, too, with roots going back to the dawn of civilization.","explainMd":"**1. 翻译：**\n\n\"Yet science has a cultural history, too, with roots going back to the dawn of civilization.\"\n\n\"然而，科学也有其文化历史，其根源可以追溯到文明的黎明。\"\n\n**2. 重难点词汇和短语：**\n\n- **Yet**: 然而，用作转折连词。\n- **science**: 科学，这是一个名词。\n- **cultural history**: 文化历史，这是一个复合名词，由形容词\"cultural\"（文化的）和名词\"history\"（历史）构成。\n- **roots**: 根源，通常在比喻中用以指代事物的起源或基础。\n- **going back to**: 追溯到，这是一个介词短语，用以指事物的历史可以追溯到某个特定的时间或事件。\n- **the dawn of civilization**: 文明的黎明，这是一个具有象征意义的词组，指的是人类文明的起源或早期阶段。\n\n**3. 句子结构：**\n\n这是一个简单句。句子结构如下：\n\n- 状语(Adverbial): Yet\n- 主语(Subject): science\n- 谓语(Verb): has\n- 宾语(Object): a cultural history\n\n此外，还有一个带有状语的介词短语\"with roots going back to the dawn of civilization\"，修饰整个句子，提供主语\"science\"的额外信息。\n\n**4. 语法：**\n\n这个句子使用了现在完成时（has + 过去分词），表示的是从过去一直延续到现在的状态或动作。\n\n**5. 知识点总结：**\n\n这个句子主要涉及的知识点有：现在完成时态的使用，以及带状语的介词短语的应用。句子主要表达的是科学的文化历史可以追溯到文明的黎明，强调其深厚的历史根基。\n\n**6. 相似句子练习：**\n\n\"Yet literature has a profound history, too, with roots going back to the advent of written language.\"\n\n\"然而，文学也有其深远的历史，其根源可以追溯到文字的出现。\""},{"text":"The same curiosity to find what lies beyond the horizon that first brought early Polynesians to Hawaii’s shores inspires astronomers today to explore the heavens.","explainMd":"**1. 翻译：**\n\n\"那种最初驱使早期的波利尼西亚人抵达夏威夷海岸，去探寻地平线以外的未知的好奇心，如今也激励着天文学家探索天宇。\"\n\n**2. 重难点词汇和短语：**\n\n- **curiosity**: 好奇心，这是一个名词。\n- **to find what lies beyond the horizon**: 探寻地平线以外的未知，这是一个短语，字面意思是\"发现居于地平线以外的东西\"，用作比喻，表示对未知的探索和发现。\n- **that first brought early Polynesians to Hawaii’s shores**: 那最初引领早期波利尼西亚人到达夏威夷海岸的，这是一个定语从句，用以修饰前面的\"curiosity\"。\n- **inspires**: 激励，这是一个动词，表示激发、鼓舞之意。\n- **astronomers**: 天文学家，这是一个名词。\n- **to explore the heavens**: 探索天宇，这是一个不定式短语，作为动词\"inspires\"的宾语。\n\n**3. 句子结构：**\n\n这是一个复杂句。句子结构如下：\n\n- 主语(Subject): The same curiosity\n- 定语从句(Attributive clause): that first brought early Polynesians to Hawaii’s shores\n- 谓语(Verb): inspires\n- 宾语(Object): astronomers\n- 宾语补足语(Object Complement): to explore the heavens\n\n定语从句\"that first brought early Polynesians to Hawaii’s shores\"修饰主语\"The same curiosity\"，宾语补足语\"to explore the heavens\"用来补充说明宾语\"astronomers\"。\n\n**4. 语法：**\n\n这个句子使用了现在时态，并且使用了定语从句和宾语补足语的结构。定语从句用来修饰主语，宾语补足语用来补充说明宾语。\n\n**5. 知识点总结：**\n\n这个句子主要涉及的知识点有：定语从句的使用，宾语补足语的应用，以及对比和类比的手法。句子主要表达的是，同样的好奇心驱使了早期波利尼西亚人和现代的天文学家去探索未知的世界。\n\n**6. 相似句子练习：**\n\n\"The same passion for music that first brought early composers to create symphonies still inspires musicians today to compose new melodies.\"\n\n\"那种最初驱使早期作曲家创作交响乐的对音乐的热情，如今仍激励着音乐家创作新的旋律。\""},{"text":"Calls to disassemble all telescopes on Mauna Kea or to ban future development there ignore the reality that astronomy and Hawaiian culture both seek to answer big questions about who we are, where we come from and where we are going.","explainMd":"**1. 翻译：**\n\n\"那些呼吁在玛纳基亚山上拆除所有望远镜或禁止未来的开发活动，都忽视了一个现实，那就是天文学和夏威夷文化都在试图回答我们是谁，我们从哪里来，我们将去往何方这样的大问题。\"\n\n**2. 重难点词汇和短语：**\n\n- **Calls to**: 呼吁，这是一个短语，表示呼唤或请求某事发生。\n- **disassemble**: 拆除，这是一个动词，表示将某物拆解或解体。\n- **ignore**: 忽视，这是一个动词，表示忽略或不理会某事。\n- **the reality**: 现实，这是一个名词，表示事物的真实状态或情况。\n- **Hawaiian culture**: 夏威夷文化，这是一个名词短语，表示夏威夷的文化传统和习俗。\n- **seek to**: 试图，这是一个动词短语，表示尝试或努力去做某事。\n- **answer big questions about**: 对......提出重大问题，这是一个短语，表示对某事提出深刻的问题或疑问。\n\n**3. 句子结构：**\n\n这是一个复合句，其结构如下：\n\n- 主语(Subject): Calls to disassemble all telescopes on Mauna Kea or to ban future development there\n- 谓语(Verb): ignore\n- 宾语(Object): the reality that astronomy and Hawaiian culture both seek to answer big questions about who we are, where we come from and where we are going.\n\n这个句子的宾语部分是一个宾语从句，\"that astronomy and Hawaiian culture both seek to answer big questions about who we are, where we come from and where we are going\"，用来解释和详细说明了\"the reality\"的具体内容。\n\n**4. 语法：**\n\n这个句子使用了现在时态，同时使用了宾语从句的结构。宾语从句用来修饰并详细说明主句的宾语。\n\n**5. 知识点总结：**\n\n这个句子主要涉及的知识点有：宾语从句的使用，以及对比和类比的手法。句子主要表达的是，呼吁拆除望远镜或禁止开发的人忽视了天文学和夏威夷文化都在寻求解答关于我们自我认知和生命起源的重大问题。\n\n**6. 相似句子练习：**\n\n\"Calls to ban all forms of fossil fuels ignore the reality that modern industry and many aspects of our daily lives still heavily depend on them.\"\n\n\"呼吁禁止所有形式的化石燃料的声音忽视了一个现实，那就是现代工业和我们日常生活的许多方面仍然严重依赖它们。\""},{"text":"Perhaps that is why we explore the starry skies, as if answering a primal calling to know ourselves and our true ancestral homes.","explainMd":"**1. 翻译：**\n\n\"也许这就是我们探索繁星闪烁的天空的原因，仿佛在回应一种原始的召唤，去认识我们自己和我们真正的祖先的家园。\"\n\n**2. 重难点词汇和短语：**\n\n- **explore**: 探索，这是一个动词，表示对某个未知领域进行研究或探究。\n- **starry skies**: 繁星闪烁的天空，这是一个名词短语，用来描述星星繁多的天空。\n- **as if**: 仿佛，这是一个连词，用来引导一个表示假设或比喻的从句。\n- **a primal calling**: 一种原始的召唤，这是一个名词短语，用来描述一种内在的、原始的、强烈的欲望或冲动。\n- **ancestral homes**: 祖先的家园，这是一个名词短语，表示祖先曾经居住的地方或地区。\n\n**3. 句子结构：**\n\n这是一个复杂句，其结构如下：\n\n- 主语(Subject): we\n- 谓语(Verb): explore\n- 宾语(Object): the starry skies\n- 状语(Adverbial): Perhaps that is why, as if answering a primal calling to know ourselves and our true ancestral homes\n\n这个句子的状语部分是一个状语从句，\"as if answering a primal calling to know ourselves and our true ancestral homes\"，用来修饰主句的动作\"explore the starry skies\"的方式和原因。\n\n**4. 语法：**\n\n这个句子使用了现在时态，同时使用了状语从句的结构。状语从句用来修饰并详细说明主句中动词的状态或方式。\n\n**5. 知识点总结：**\n\n在这句话中，我们看到了以下重要的英语知识点：\n\n1. **动词 + 宾语的结构**：在这句话中，主语\"We\"和动词\"explore\"以及宾语\"the starry skies\"组成了基本的句子结构。这是英语中最基本的句子结构之一，它帮助我们明确句子的主题和行动。\n\n2. **状语从句**：这句话中的\"as if answering a primal calling to know ourselves and our true ancestral homes\"是一个状语从句，用来修饰主句中的动作\"explore\"。状语从句在英语中常常用来添加更多关于动作或状态的信息。\n\n3. **\"as if\"的使用**：这句话中的\"as if\"是一个非常重要的连词短语，它引导一个状语从句，表示假设或类似的情况。在这个例子中，\"as if\"引导的从句帮助作者创造了一种强烈的比喻，强调了我们探索星空的原因。\n\n**6. 相似句子练习：**\n\n\"Perhaps that is why we study history, as if answering a primal calling to understand our past and our cultural roots.\"\n\n\"也许这就是我们研究历史的原因，仿佛在回应一种原始的召唤，去理解我们的过去和我们的文化根源。\""}]},{"sentences":[{"text":"The astronomy community is making compromises to change its use of Mauna Kea.","explainMd":"**1. 翻译：**\n\n\"天文学社区正在作出妥协，以改变其对马瑙纳凯亚山的使用。\"\n\n**2. 重难点词汇和短语：**\n\n- **astronomy community**: 天文学社区，指的是从事天文学研究和工作的一群人。\n- **compromises**: 妥协，指的是在对立的立场或目标之间寻求折中或平衡的过程。\n- **change its use of**: 改变其使用，指的是改变对某物的使用方式或目的。\n- **Mauna Kea**: 马瑙纳凯亚山，是夏威夷的一座休眠火山，也是世界上最重要的天文观测点之一。\n\n**3. 句子结构：**\n\n这是一个简单句。句子结构：主语+谓语+宾语。\n\n- 主语(Subject): The astronomy community\n- 谓语(Verb): is making\n- 宾语(Object): compromises to change its use of Mauna Kea\n\n在这个句子中，宾语部分由\"compromises\"和\"to change its use of Mauna Kea\"构成，其中\"to change its use of Mauna Kea\"是一个不定式短语，用来修饰\"compromises\"，说明天文学社区为了什么而做出妥协。\n\n**4. 语法：**\n\n这个句子使用了现在进行时，表示正在进行的动作或状态。此外，它也使用了不定式短语作为宾语的一部分，来详细说明主语的动作。\n\n**5. 知识点总结：**\n\n这个句子主要涉及了以下几个英语知识点：\n\n- 现在进行时的使用\n- 不定式短语作为宾语的部分\n- 复合名词的使用（astronomy community）\n- 的字词的使用和理解\n\n这个句子是一个简单的声明句，表达了天文学社区正在为了改变对马瑙纳凯亚山的使用而做出妥协的情况。\n\n**6. 相似句子练习：**\n\n\"The environmental group is making efforts to change its approach to conservation.\"\n\n\"环保组织正在努力改变其对保护环境的方法。”"},{"text":"The TMT site was chosen to minimize the telescope’s visibility around the island and to avoid archaeological and environmental impact.","explainMd":"**1. 翻译：**\n\n\"TMT的选址是为了尽可能减小望远镜在岛上的可见度，并避免对考古和环境产生影响。\"\n\n**2. 重难点词汇和短语：**\n\n- **TMT site**: TMT的选址，TMT是Thirty Meter Telescope（三十米望远镜）的简写。\n- **minimize**: 尽可能减小，最小化。\n- **visibility**: 可见度，指的是一个物体在视觉上的明显程度。\n- **archaeological and environmental impact**: 考古和环境影响，考古影响可能指的是对历史遗址的破坏，环境影响可能指的是对生态环境的破坏。\n\n**3. 句子结构：**\n\n这是一个复合句。句子结构：主语+谓语+宾语。\n\n- 主语(Subject): The TMT site\n- 谓语(Verb): was chosen\n- 宾语(Object): to minimize the telescope’s visibility around the island and to avoid archaeological and environmental impact\n\n在这个句子中，宾语部分由两个不定式短语构成，\"to minimize the telescope’s visibility around the island\" 和 \"to avoid archaeological and environmental impact\"，它们分别解释了TMT选址的两个目的。\n\n**4. 语法：**\n\n这个句子使用了被动语态的过去时，表示TMT的选址已经被选定，并对选址的目的进行了解释。此外，它还使用了并列结构和不定式短语作为宾语的一部分，来详细说明主语的动作。\n\n**5. 知识点总结：**\n\n这个句子主要涉及了以下几个英语知识点：\n\n- 被动语态的过去时的使用\n- 不定式短语作为宾语的部分\n- 并列结构的使用\n\n这个句子是一个复合的声明句，表达了TMT选址的目的，即为了尽可能减小望远镜在岛上的可见度，并避免对考古和环境产生影响。\n\n**6. 相似句子练习：**\n\n\"The design was changed to enhance the product's efficiency and to reduce its environmental footprint.\"\n\n\"设计被修改是为了提高产品的效率并减少其对环境的影响。”"},{"text":"To limit the number of telescopes on Mauna Kea, old ones will be removed at the end of their lifetimes and their sites returned to a natural state.","explainMd":"**1. 翻译：**\n\n为了限制在Mauna Kea上望远镜的数量，旧的望远镜将在其使用寿命结束时被移除，并将其站点恢复到自然状态。\n\n**2. 重难点词汇和短语：**\n\n- **limit**: 限制，这里指的是减少或控制在Mauna Kea上望远镜的数量。\n- **remove**: 移除，这里指的是将旧的望远镜拆除。\n- **return to a natural state**: 恢复到自然状态，这里指的是将望远镜站点恢复到原来没有望远镜的自然状态。\n\n**3. 句子结构：**\n\n这是一个复合句。句子结构：主语+谓语+宾语。\n\n- 主语(Subject): old ones (旧的望远镜)\n- 谓语(Verb): will be removed (将被移除) / their sites returned to a natural state (其站点恢复到自然状态)\n- 宾语(Object): at the end of their lifetimes (在其使用寿命结束时)\n\n在这个句子中，主语是\"old ones\"，指的是旧的望远镜。谓语部分是\"will be removed\"和\"their sites returned to a natural state\"，分别表示望远镜将被移除和望远镜站点将被恢复到自然状态。宾语是\"at the end of their lifetimes\"，修饰谓语\"will be removed\"，表示望远镜将在其使用寿命结束时被移除。\n\n**4. 语法：**\n\n这个句子使用了将来时态的被动语态，表示未来望远镜将被移除。此外，这个句子还使用了简洁的句子结构，主语和谓语之间没有连接词，这是一种常见的省略句子结构。\n\n**5. 知识点总结：**\n\n这个句子主要涉及了以下几个英语知识点：\n\n- 将来时态的被动语态的使用\n- 省略句子结构的使用\n- 词汇的正确使用和理解\n\n这个句子是一个复合的声明句，表达了对Mauna Kea上望远镜数量的控制措施，即旧的望远镜将在其使用寿命结束时被移除，并将其站点恢复到自然状态。\n\n**6. 相似句子练习：**\n\n\"To reduce the amount of waste, old items will be recycled at the end of their usage period and their spaces will be returned to a clean state.\"\n\n\"为了减少废物的数量，旧物品将在其使用期结束时被回收，并将其空间恢复为干净的状态。\""},{"text":"There is no reason why everyone cannot be welcomed on Mauna Kea to embrace their cultural heritage and to study the stars.","explainMd":"**1. 翻译：**\n\n\"没有任何理由不能欢迎每个人来到Mauna Kea，拥抱他们的文化遗产并研究星星。\"\n\n**2. 重难点词汇和短语：**\n\n- **welcome**: 欢迎，这里指的是接纳每个人来到Mauna Kea。\n- **embrace**: 拥抱，这里指的是接受和尊重他们的文化遗产。\n- **cultural heritage**: 文化遗产，这里指的是来自各种文化背景的人们独特的传统和习俗。\n- **study the stars**: 研究星星，这里指的是天文学的研究。\n\n**3. 句子结构：**\n\n这是一个复合句。句子结构：状语+主语+谓语+宾语。\n\n- 状语(Adverbial): There is no reason why (没有任何理由)\n- 主语(Subject): everyone (每个人)\n- 谓语(Verb): cannot be welcomed on Mauna Kea (不能被欢迎来到Mauna Kea)\n- 宾语(Object): to embrace their cultural heritage and to study the stars (拥抱他们的文化遗产并研究星星)\n\n在这个句子中，状语是\"There is no reason why\"，表示没有任何理由，修饰整个句子。主语是\"everyone\"，谓语是\"cannot be welcomed on Mauna Kea\"，宾语是\"to embrace their cultural heritage and to study the stars\"。\n\n**4. 语法：**\n\n这个句子使用了被动语态，表示每个人都应该被欢迎来到Mauna Kea。另外，这个句子也使用了\"reason why\"的结构，表达了理由或原因。\n\n**5. 知识点总结：**\n\n这个句子主要涉及了以下几个英语知识点：\n\n- 被动语态的使用\n- \"reason why\"结构的使用\n- 词汇的正确使用和理解\n\n这个句子是一个复合的声明句，表达了作者对每个人都应该被欢迎来到Mauna Kea，尊重和接纳各自的文化遗产，并进行天文学研究的观点。\n\n**6. 相似句子练习：**\n\n\"There is no reason why everyone cannot be invited to the museum to appreciate their cultural art and learn about history.\"\n\n\"没有任何理由不能邀请每个人来到博物馆，欣赏他们的文化艺术并学习历史。\""}]}],"title":""}