{"translate":"","paragraphs":[{"sentences":[{"text":"States will be able to force more people to pay sales tax when they make online purchases under a Supreme Court decision Thursday that will leave shoppers with lighter wallets but is a big financial win for states.","explainMd":"### 1. 翻译\n在周四的最高法院的决定下，各州将能够迫使更多的人在进行网上购物时支付销售税，这将使消费者的钱包变得更轻，但对各州来说是一项巨大的财政胜利。\n\n### 2. 词汇和短语\n- States: 各州\n- will be able to: 将能够\n- force more people: 迫使更多的人\n- to pay sales tax: 支付销售税\n- when they make online purchases: 当他们进行网上购物时\n- under a Supreme Court decision Thursday: 在周四的最高法院的决定下\n- that will leave shoppers with lighter wallets: 这将使消费者的钱包变得更轻\n- but is a big financial win for states: 但对各州来说是一项巨大的财政胜利\n\n### 3. 句子结构\n此句结构可以分为两个主要部分：\n- \"States will be able to force more people to pay sales tax when they make online purchases\" 是主句，其中 \"States\" 是主语， \"will be able to force\" 是谓语，\"more people to pay sales tax when they make online purchases\" 是宾语，其中 \"when they make online purchases\" 是时间状语从句，修饰 \"to pay sales tax\"。\n- \"under a Supreme Court decision Thursday that will leave shoppers with lighter wallets but is a big financial win for states\" 是定语从句，修饰 \"States will be able to force more people to pay sales tax when they make online purchases\"，其中 \"that\" 是连接词，\"will leave shoppers with lighter wallets but is a big financial win for states\" 是从句的主句。\n\n### 4. 语法\n- **将来时**：在这个句子中，\"States will be able to force more people to pay sales tax when they make online purchases\" 是将来时的形式，用来描述未来可能发生的情况\n- **定语从句**：\"under a Supreme Court decision Thursday that will leave shoppers with lighter wallets but is a big financial win for states\" 是一个定语从句，用来修饰前面的主句\n\n### 5. 知识点总结\n此句主要使用了以下英语知识点：\n- **将来时**：将来时用来描述未来可能发生的情况\n- **定语从句**：定语从句用来修饰主句的某部分\n\n### 6. 相似句子练习\n\"Companies will be able to recruit more talented individuals due to the new immigration policy that will result in a more diverse workforce but is a significant challenge for the government.\"\n\n由于新的移民政策，公司将能够招募到更多的才华横溢的个体，这将导致劳动力更加多元化，但对政府来说是一个重大的挑战。"}]},{"sentences":[{"text":"The Supreme Court’s opinion Thursday overruled a pair of decades-old decisions that states said cost them billions of dollars in lost revenue annually.","explainMd":"### 1. 翻译\n周四，最高法院意见推翻了一对数十年的决定，各州称其每年使他们失去了数十亿美元的收入。\n\n### 2. 词汇和短语\n- The Supreme Court’s opinion: 最高法院的意见\n- Thursday: 周四\n- overruled: 推翻\n- a pair of decades-old decisions: 一对数十年的决定\n- that states said: 各州称\n- cost them: 使他们失去了\n- billions of dollars: 数十亿美元\n- in lost revenue annually: 每年的收入损失\n\n### 3. 句子结构\n这个句子比较直接，包含一个主句和一个定语从句：\n- \"The Supreme Court’s opinion Thursday overruled a pair of decades-old decisions\" 是主句，其中 \"The Supreme Court’s opinion\" 是主语，\"Thursday\" 是时间状语，\"overruled\" 是谓语，\"a pair of decades-old decisions\" 是宾语。\n- \"that states said cost them billions of dollars in lost revenue annually\" 是定语从句，修饰 \"decisions\"，其中 \"that\" 是关系代词，\"states said\" 是从句的主语+谓语，\"cost them billions of dollars in lost revenue annually\" 是从句的宾语。\n\n### 4. 语法\n- **过去时**：这个句子中的 \"overruled\" 是过去时，表示在过去某个时间点发生的动作。\n- **定语从句**：\"that states said cost them billions of dollars in lost revenue annually\" 是一个定语从句，用来修饰 \"decisions\"。\n\n### 5. 知识点总结\n此句主要使用了以下英语知识点：\n- **过去时**：过去时用来表示在过去某个时间点发生的动作。\n- **定语从句**：定语从句用来修饰主句的某部分。\n\n### 6. 相似句子练习\n\"The company's announcement yesterday terminated a long-standing contract that employees claimed was causing them significant financial loss every month.\"\n\n公司昨天的声明终止了一项长期存在的合同，员工们声称每月都因此造成他们重大的财务损失。"},{"text":"The decisions made it more difficult for states to collect sales tax on certain online purchases.","explainMd":"### 1. 翻译\n这些决定使各州在收集某些在线购物的销售税方面变得更加困难。\n\n### 2. 词汇和短语\n- The decisions: 这些决定\n- made it more difficult: 使之更困难\n- for states: 对于各州\n- to collect sales tax: 收集销售税\n- on certain online purchases: 在某些在线购物上\n\n### 3. 句子结构\n这个句子是一个复杂句，包括一个主句和一个不定式短语（作为宾语）：\n- \"The decisions made it more difficult\" 是主句，其中 \"The decisions\" 是主语，\"made\" 是谓语， \"it more difficult\" 是宾语。\n- \"for states to collect sales tax on certain online purchases\" 是不定式短语，作为宾语。\n\n### 4. 语法\n- **过去时**：这个句子中的 \"made\" 是过去时，表示在过去某个时间点发生的动作。\n- **不定式短语**： \"to collect sales tax on certain online purchases\" 是一个不定式短语，作为宾语，描述了使之更困难的具体内容。\n\n### 5. 知识点总结\n此句主要使用了以下英语知识点：\n- **过去时**：过去时用来表示在过去某个时间点发生的动作。\n- **不定式短语**：不定式可以用来作为主语、宾语、表语、定语和状语。\n\n### 6. 相似句子练习\n\"The new policies made it harder for students to access educational resources online.\"\n\n新的政策使学生更难在线获取教育资源。"}]},{"sentences":[{"text":"The cases the court overturned said that if a business was shipping a customer’s purchase to a state where the business didn’t have a physical presence such as a warehouse or office, the business didn’t have to collect sales tax for the state.","explainMd":"### 1. 翻译\n法院推翻的案例表明，如果一家企业将客户的购买物品运送到企业没有实体存在（如仓库或办公室）的州，那么该企业就不需要为该州收取销售税。\n\n### 2. 词汇和短语\n- The cases the court overturned: 法院推翻的案例\n- said that: 表明\n- if a business was shipping a customer’s purchase to a state: 如果一家企业将客户的购买物品运送到一个州\n- where the business didn’t have a physical presence such as a warehouse or office: 企业在那里没有实体存在（如仓库或办公室）\n- the business didn’t have to collect sales tax for the state: 该企业就不需要为该州收取销售税\n\n### 3. 句子结构\n这是一个复杂句，包括一个主句和一个条件状语从句：\n\n- \"The cases the court overturned said that\" 是主句，其中 \"The cases the court overturned\" 是主语，\"said\" 是谓语动词，后面的部分是宾语从句。\n\n- \"if a business was shipping a customer’s purchase to a state where the business didn’t have a physical presence such as a warehouse or office, the business didn’t have to collect sales tax for the state\" 是条件状语从句，用于描述在什么情况下，企业不需要为州收取销售税。\n\n### 4. 语法\n- **过去时**：这个句子中的 \"was shipping\" 和 \"didn’t have to collect\" 是过去时，表示在过去某个时间点发生的动作。\n- **条件状语从句**： \"if\" 引导的句子是条件状语从句，描述了某种条件或情况。\n\n### 5. 知识点总结\n此句主要使用了以下英语知识点：\n- **过去时**：过去时用来表示在过去某个时间点发生的动作。\n- **条件状语从句**： \"if\" 可以引导条件状语从句，描述了某种条件或情况。\n\n### 6. 相似句子练习\n\"If a student didn’t participate in the class activities, the student didn’t have to write a reflection paper.\"\n\n如果一个学生没有参加课堂活动，那么这个学生就不需要写反思论文。"},{"text":"Customers were generally responsible for paying the sales tax to the state themselves if they weren’t charged it, but most didn’t realize they owed it and few paid.","explainMd":"### 1. 翻译\n如果没有向他们收取销售税，客户通常需要自己向州政府支付销售税，但大多数人并未意识到他们欠税，且实际缴税的人数极少。\n\n### 2. 词汇和短语\n- Customers: 客户\n- were generally responsible for: 通常需要负责\n- paying the sales tax to the state themselves: 自己向州政府支付销售税\n- if they weren’t charged it: 如果没有向他们收取\n- but most didn’t realize they owed it: 但大多数人并未意识到他们欠税\n- and few paid: 并且少数人付款\n\n### 3. 句子结构\n这是一个复合句，包含一个主句和一个条件状语从句：\n\n- 主句：Customers were generally responsible for paying the sales tax to the state themselves, but most didn’t realize they owed it and few paid.\n- 条件状语从句：if they weren’t charged it.\n\n### 4. 语法\n- **过去时**：这个句子中的 \"were\", \"didn’t realize\", \"owed\" 和 \"paid\" 是过去时态的动词，表示在过去某个时间点发生的动作或状态。\n- **条件状语从句**： \"if\" 引导的句子是条件状语从句，描述了某种条件或情况。\n\n### 5. 知识点总结\n此句主要使用了以下英语知识点：\n- **过去时**：过去时用来表示在过去某个时间点发生的动作或状态。\n- **条件状语从句**： \"if\" 可以引导条件状语从句，描述了某种条件或情况。\n\n### 6. 相似句子练习\n\"If students weren't given homework, they were generally responsible for reviewing the lessons themselves, but most didn't realize they needed to, and few did.\"\n\n如果学生们没有被布置家庭作业，他们通常需要自己复习课程，但大多数人并未意识到他们需要这么做，而实际上做的人数极少。"}]},{"sentences":[{"text":"Justice Anthony Kennedy wrote that the previous decisions were flawed.","explainMd":"### 1. 翻译\n安东尼·肯尼迪法官写道，先前的决定是有缺陷的。\n\n### 2. 词汇和短语\n- Justice: 法官\n- Anthony Kennedy: 安东尼·肯尼迪（美国联邦最高法院大法官）\n- wrote: 写道\n- that: 那个，用于引导宾语从句\n- the previous decisions: 先前的决定\n- were flawed: 有缺陷的\n\n### 3. 句子结构\n这是一个简单句，由主语 (Justice Anthony Kennedy)、谓语 (wrote) 和宾语从句 (that the previous decisions were flawed) 构成。\n\n### 4. 语法\n- **一般过去时**：句子中的 \"wrote\" 和 \"were\" 均为过去时态的动词，表示在过去某个时间点发生的动作或状态。\n- **宾语从句**： \"that\" 引导的句子是宾语从句，用来说明 \"wrote\" 的内容。\n\n### 5. 知识点总结\n此句主要使用了以下英语知识点：\n- **一般过去时**：表示在过去某个时间点发生的动作或状态。\n- **宾语从句**： \"that\" 可以引导宾语从句，用来说明主句谓语的动作或状态。\n\n### 6. 相似句子练习\n\"Professor Wang wrote that the initial hypothesis was incorrect.\"\n\n王教授写道，最初的假设是错误的。"},{"text":"“Each year the physical presence rule becomes further removed from economic reality and results in significant revenue losses to the States,” he wrote in an opinion joined by four other justices.","explainMd":"### 英语知识讲解\n\n#### 1. 翻译\n\n\"每年，实体存在规则与经济现实的脱节越来越严重，导致各州损失了大量的税收收入，\"他在其他四位法官同意的意见中写道。\n\n#### 2. 词汇和短语\n\n- **Each year**: 每年\n- **physical presence rule**: 实体存在规则。这是一个法律术语，通常指的是公司或个人在某地有实体存在（例如，办公室或仓库），因此需要按照该地的法律进行操作。在这里，它指的是一种税收法规，即只有在具有实体存在的州才需要收集销售税。\n- **becomes further removed from**: 与……的脱节越来越严重\n- **economic reality**: 经济现实\n- **results in**: 导致\n- **significant revenue losses**: 大量的收入损失\n- **the States**: 各州，指美国的各个州。\n\n#### 3. 句子结构\n\n这是一个复合句，主要由两个独立的子句组成：\n\n- 子句1: \"Each year the physical presence rule becomes further removed from economic reality\" (每年，实体存在规则与经济现实的脱节越来越严重)\n- 子句2: \"and results in significant revenue losses to the States\" (并导致各州损失了大量的税收收入)\n\n两个子句通过并列连词 \"and\" 连接。\n\n#### 4. 语法\n\n- **主谓宾结构**: 句子遵循了主谓宾的基本句子结构。在子句1中，主语是 \"the physical presence rule\"，谓语是 \"becomes\"，宾语是 \"further removed from economic reality\"。在子句2中，主语是动词 \"results\"，宾语是 \"in significant revenue losses to the States\"。\n- **现在时态**: 句子使用了现在时态，意味着这是一个正在进行或常态存在的情况。\n\n#### 5. 知识点总结\n\n- 这句话提供了一个很好的例子，说明如何在一个句子中使用两个独立的子句来表达复杂的思想。\n- 句子的主题是一个具体的法律规则（实体存在规则），它是如何随着时间的推移与经济现实脱节，以及这种脱节导致的后果。\n- 句子使用了一些法律和经济的专业术语，了解这些术语的含义对理解句子的含义至关重要。\n\n#### 6. 相似句子练习\n\n\"Every year, the outdated tax laws become more out of sync with the modern economy, leading to substantial revenue losses for the country.\" (每年，过时的税法与现代经济的不同步程度越来越严重，导致国家损失了大量的税收收入。)"},{"text":"Kennedy wrote that the rule “limited states’ ability to seek long-term prosperity and has prevented market participants from competing on an even playing field.”","explainMd":"### 1. 翻译\n肯尼迪写道，这个规则“限制了各州寻求长期繁荣的能力，并阻止了市场参与者在公平的竞争环境中竞争。”\n\n### 2. 词汇和短语\n- Kennedy: 肯尼迪（指安东尼·肯尼迪，美国联邦最高法院大法官）\n- wrote: 写道\n- that: 那个，用于引导宾语从句\n- the rule: 这个规则\n- limited: 限制\n- states: 各州\n- ability: 能力\n- to seek: 寻求\n- long-term prosperity: 长期繁荣\n- and: 和，连接两个并列的动词短语\n- has prevented: 已经阻止\n- market participants: 市场参与者\n- from: 来自，表明动作的起始状态\n- competing on an even playing field: 在公平的竞争环境中竞争\n\n### 3. 句子结构\n这是一个复合句，由主语（Kennedy）、谓语（wrote）和两个宾语从句构成。第一个宾语从句是“that the rule limited states' ability to seek long-term prosperity”，第二个宾语从句是“and has prevented market participants from competing on an even playing field”。\n\n### 4. 语法\n- **一般过去时**：句子中的 \"wrote\" 和 \"limited\" 均为过去时态的动词，表示在过去某个时间点发生的动作。\n- **现在完成时**：“has prevented” 是现在完成时态，表示从过去开始一直延续到现在的动作或状态。\n- **宾语从句**： \"that\" 引导的句子是宾语从句，用来说明 \"wrote\" 的内容。\n- **介词短语**：“from competing on an even playing field” 是介词短语用作状语，修饰前面的动词“prevented”。\n\n### 5. 知识点总结\n此句主要使用了以下英语知识点：\n- **一般过去时**：表示在过去某个时间点发生的动作。\n- **现在完成时**：表示从过去开始一直延续到现在的动作或状态。\n- **宾语从句**： \"that\" 可以引导宾语从句，用来说明主句谓语的动作或状态。\n- **介词短语**：可以作状语，用来修饰前面的动词。\n\n### 6. 相似句子练习\n\"Smith argued that the policy has restrained the development of the industry and has kept innovators from bringing new products to the market.\"\n\n史密斯辩称，该政策已经抑制了行业的发展，并阻止了创新者将新产品推向市场。"}]},{"sentences":[{"text":"The ruling is a victory for big chains with a presence in many states, since they usually collect sales tax on online purchases already.","explainMd":"### 1. 翻译\n肯尼迪写道，这个规则“限制了各州寻求长期繁荣的能力，并阻止了市场参与者在公平的竞争环境中竞争。”\n\n### 2. 词汇和短语\n- Kennedy: 肯尼迪（指安东尼·肯尼迪，美国联邦最高法院大法官）\n- wrote: 写道\n- that: 那个，用于引导宾语从句\n- the rule: 这个规则\n- limited: 限制\n- states: 各州\n- ability: 能力\n- to seek: 寻求\n- long-term prosperity: 长期繁荣\n- and: 和，连接两个并列的动词短语\n- has prevented: 已经阻止\n- market participants: 市场参与者\n- from: 来自，表明动作的起始状态\n- competing on an even playing field: 在公平的竞争环境中竞争\n\n### 3. 句子结构\n这是一个复合句，由主语（Kennedy）、谓语（wrote）和两个宾语从句构成。第一个宾语从句是“that the rule limited states' ability to seek long-term prosperity”，第二个宾语从句是“and has prevented market participants from competing on an even playing field”。\n\n### 4. 语法\n- **一般过去时**：句子中的 \"wrote\" 和 \"limited\" 均为过去时态的动词，表示在过去某个时间点发生的动作。\n- **现在完成时**：“has prevented” 是现在完成时态，表示从过去开始一直延续到现在的动作或状态。\n- **宾语从句**： \"that\" 引导的句子是宾语从句，用来说明 \"wrote\" 的内容。\n- **介词短语**：“from competing on an even playing field” 是介词短语用作状语，修饰前面的动词“prevented”。\n\n### 5. 知识点总结\n此句主要使用了以下英语知识点：\n- **一般过去时**：表示在过去某个时间点发生的动作。\n- **现在完成时**：表示从过去开始一直延续到现在的动作或状态。\n- **宾语从句**： \"that\" 可以引导宾语从句，用来说明主句谓语的动作或状态。\n- **介词短语**：可以作状语，用来修饰前面的动词。\n\n### 6. 相似句子练习\n\"Smith argued that the policy has restrained the development of the industry and has kept innovators from bringing new products to the market.\"\n\n史密斯辩称，该政策已经抑制了行业的发展，并阻止了创新者将新产品推向市场。"},{"text":"Now, rivals will be charging sales tax where they hadn’t before.","explainMd":"### 1. 翻译\n现在，竞争对手将在之前未征收销售税的地方开始收税。\n\n### 2. 词汇和短语\n- **Now**: 现在\n- **rivals**: 竞争对手\n- **will be charging**: 将收取\n- **sales tax**: 销售税\n- **where**: 在哪里\n- **they hadn’t before**: 他们以前没有\n\n### 3. 句子结构\n这是一个简单句，主语是 \"rivals\"(竞争对手)，谓语是 \"will be charging sales tax\"(将收取销售税)，宾语是 \"where they hadn’t before\"(他们以前没有的地方)。\n\n### 4. 语法\n这句话中的语法特点是使用了将来进行时态 \"will be charging\"，表示将来某个时间点正在进行或持续的动作。此外，\"where\" 在这里作为关系副词，引导定语从句 \"where they hadn’t before\"，修饰前面的 \"sales tax\"。\n\n### 5. 知识点总结\n- **将来进行时态**: 表示将来某个时间点正在进行或持续的动作。\n- **关系副词**: 在句子中起连接作用，同时在定语从句中充当状语。\n\n### 6. 相似句子练习\n- From now on, we will be studying in the library where we hadn't before.\n- 从现在开始，我们将在之前未曾学习过的图书馆学习。"},{"text":"Big chains have been collecting sales tax nationwide because they typically have physical stores in whatever state a purchase is being shipped to.","explainMd":"### 英语知识讲解\n\n#### 1. 翻译\n\n\"大型连锁店一直在全国范围内收取销售税，因为他们通常在购物袋被运送到的任何州都有实体店。\"\n\n#### 2. 词汇和短语\n\n- **Big chains**: 大型连锁店。这是指在全国或全球范围内有多家分店的大型零售商。\n- **have been collecting sales tax nationwide**: 一直在全国范围内收取销售税。这表示大型连锁店在全美各地的分店都会收取销售税。\n- **because**: 因为。这是一个连接词，用来引导原因状语从句。\n- **they typically have physical stores in whatever state a purchase is being shipped to**: 他们通常在购物袋被运送到的任何州都有实体店。这是解释为什么大型连锁店能够在全国范围内收取销售税的原因。\n\n#### 3. 句子结构\n\n这是一个复杂句子，包含一个主句和一个由 \"because\" 引导的原因状语从句。\n\n- 主句： \"Big chains have been collecting sales tax nationwide\"（大型连锁店一直在全国范围内收取销售税）。\n- 原因状语从句： \"because they typically have physical stores in whatever state a purchase is being shipped to\"（因为他们通常在购物袋被运送到的任何州都有实体店）。\n\n#### 4. 语法\n\n- **现在完成进行时**: 主句使用了现在完成进行时（have been collecting），表示动作从过去开始，一直持续到现在，可能还会继续下去。\n- **原因状语从句**: \"because\" 引导的原因状语从句，用来解释主句的原因。\n\n#### 5. 知识点总结\n\n- 这句话说明了大型连锁店如何在全国范围内收取销售税，这主要是因为他们在购物袋被运送到的任何州都有实体店。\n- 句子使用了现在完成进行时，强调动作的持续性；以及原因状语从句，明确指出原因。\n\n#### 6. 相似句子练习\n\n\"Online retailers have been charging sales tax in all regions because they have digital platforms accessible from any location.\"（在线零售商一直在所有地区收取销售税，因为他们有可以在任何地点访问的数字平台。）"},{"text":"Amazon.com, with its network of warehouses, also collects sales tax in every state that charges it, though third-party sellers who use the site don’t have to.","explainMd":"### 1. 翻译\n拥有仓库网络的Amazon.com也在每个收税的州收取销售税，尽管使用该网站的第三方卖家不必这样做。\n\n### 2. 词汇和短语\n- **Amazon.com**: 亚马逊网站\n- **with its network of warehouses**: 拥有仓库网络\n- **also collects sales tax**: 也收取销售税\n- **in every state that charges it**: 在每个收税的州\n- **though**: 尽管\n- **third-party sellers**: 第三方卖家\n- **who use the site**: 使用该网站的\n- **don’t have to**: 不必\n\n### 3. 句子结构\n这是一个复合句，由两个主句和一个定语从句构成。第一个主句的主语是 \"Amazon.com with its network of warehouses\"，谓语是 \"also collects sales tax\"，宾语是 \"in every state that charges it\"。第二个主句的主语是 \"third-party sellers who use the site\"，谓语是 \"don’t have to\"。其中，“who use the site”是一个定语从句，修饰 \"third-party sellers\"。\n\n### 4. 语法\n这句话中的语法特点是使用了定语从句 \"who use the site\"，由关系代词 \"who\" 引导，修饰 \"third-party sellers\"。此外，\"though\" 是个并列连词，用来连接并列的主句。\n\n### 5. 知识点总结\n- **定语从句**：定语从句是修饰某个名词或代词的从句，它在句中作定语的作用。\n- **并列连词**：并列连词是用来连接两个并列的句子，或者在一个句子中连接并列的词或短语。\n\n### 6. 相似句子练习\n- Google.com, with its large database, also provides information for every user that needs it, though premium users who subscribe to the site get more features.\n- 拥有大型数据库的Google.com也为每个需要的用户提供信息，尽管订阅该网站的高级用户可以获得更多功能。"}]},{"sentences":[{"text":"Until now, many sellers that have a physical presence in only a single state or a few states have been able to avoid charging sales taxes when they ship to addresses outside those states.","explainMd":"### 1. 翻译\n直到现在，许多仅在一个州或少数几个州有实体存在的卖家，当他们向这些州之外的地址发货时，都能避免收取销售税。\n\n### 2. 词汇和短语\n\n- **Until now**: 直到现在\n- **many sellers**: 许多卖家\n- **that have a physical presence**: 有实体存在\n- **in only a single state or a few states**: 仅在一个州或少数几个州\n- **have been able to avoid**: 能够避免\n- **charging sales taxes**: 收取销售税\n- **when they ship**: 当他们发货\n- **to addresses outside those states**: 向这些州之外的地址\n\n### 3. 句子结构\n\n这是一个复合句子，包括一个主句和两个从句：\n\n- 主句：许多卖家能够避免收取销售税。\n- 定语从句：在一个州或少数几个州有实体存在的卖家。\n- 时间状语从句：当他们向这些州之外的地址发货。\n\n### 4. 语法\n\n- **定语从句**：这句话中的 \"that have a physical presence in only a single state or a few states\" 是一个定语从句，用来修饰 \"many sellers\"。\n- **时间状语从句**：\"when they ship to addresses outside those states\" 是一个时间状语从句，描述主句动作发生的时间。\n\n### 5. 知识点总结\n\n- **定语从句**：定语从句是一个子句，修饰某个名词或代词，通常由关系词（如 that, which, who, whom, whose 等）引导。在这个句子中，定语从句 \"that have a physical presence in only a single state or a few states\" 修饰了 \"many sellers\"。\n- **时间状语从句**：时间状语从句用来表示主句动作发生的时间。在这个句子中，时间状语从句 \"when they ship to addresses outside those states\" 描述了主句中的动作 \"have been able to avoid charging sales taxes\" 发生的时间。\n\n### 6. 相似句子练习\n\n- Until now, many students who study in only one or two subjects have been able to avoid doing homework when they attend online classes.\n- 直到现在，许多只在一门或两门课程中学习的学生在上网课时都能避免做作业。"},{"text":"Sellers that use eBay and Etsy, which provide platforms for smaller sellers, also haven’t been collecting sales tax nationwide.","explainMd":"**1. 翻译**\n\n\"使用eBay和Etsy的卖家，这两个平台为小型卖家提供服务，他们也没有在全国范围内收取销售税。\"\n\n**2. 词汇和短语**\n\n- **Sellers**: 卖家，指在交易中出售商品或服务的一方。\n- **Use**: 使用，指操作或应用某种工具或服务。\n- **eBay and Etsy**: eBay和Etsy，两个全球知名的在线交易平台。\n- **Provide platforms**: 提供平台，这里的\"platforms\"有广义和狭义两种解读，广义上指为人们提供进行交易或交流的场所或机会，狭义上指为人们提供进行线上交易的网站或应用。\n- **Smaller sellers**: 小型卖家，指规模较小的商家或个人卖家。\n- **Haven't been collecting sales tax**: 过去一直没有收取销售税，这里使用了现在完成进行时态，表示从过去某个时刻开始一直持续到现在的动作。\n- **Nationwide**: 全国范围内，指的是在整个国家的范围内。\n\n**3. 句子结构**\n\n这是一个复合句，主要由两个部分组成，主句和非限制性定语从句。\n\n主句为 \"Sellers that use eBay and Etsy also haven’t been collecting sales tax nationwide.\"（使用eBay和Etsy的卖家也没有在全国范围内收取销售税）。这里\"that use eBay and Etsy\"是定语从句，修饰\"Sellers\"。\n\n非限制性定语从句为 \"which provide platforms for smaller sellers\"（为小型卖家提供平台）。这里\"which\"引导定语从句，修饰前面的\"eBay and Etsy\"。\n\n**4. 语法**\n\n这个句子的语法主要涉及到了定语从句和现在完成进行时态。\n\n- **定语从句**：\"that use eBay and Etsy\"和\"which provide platforms for smaller sellers\"都是定语从句，分别修饰\"Sellers\"和\"eBay and Etsy\"。在英语中，定语从句通常位于它所修饰的名词之后，用来描述或者限定该名词。\n\n- **现在完成进行时态**：\"haven’t been collecting\"是现在完成进行时态的形式，表示的是从过去某一时刻开始一直持续到现在的动作或状态。通常用于强调动作的持续性。\n\n**5. 知识点总结**\n\n这个句子主要涉及到了现在完成进行时态和定语从句的使用，以及一些商业词汇的理解。理解和掌握现在完成进行时态和定语从句对于英语学习者来说是非常重要的，它们在英语中的应用非常广泛。同时，对于商业词汇的理解也能帮助我们更好地理解和分析商业文本。\n\n**6. 相似句子练习**\n\n\"Companies that use digital platforms like Alibaba and Amazon, which serve as marketplaces for smaller businesses, also don't collect income tax on a global scale.\"\n\n\"使用像阿里巴巴和亚马逊这样的数字平台的公司，这些平台为小型企业提供市场，也没有在全球范围内征收所得税。\""},{"text":"Under the ruling Thursday, states can pass laws requiring out-of-state sellers to collect the state’s sales tax from customers and send it to the state.","explainMd":"**1. 翻译**\n\n\"根据周四的裁决，各州可以通过法律要求境外卖家从客户那里收取该州的销售税并将其交给该州。\"\n\n**2. 词汇和短语**\n\n- **Under the ruling Thursday**: 周四的裁决下\n- **States**: 各州\n- **Pass laws**: 通过法律\n- **Requiring**: 要求\n- **Out-of-state sellers**: 境外卖家\n- **Collect the state’s sales tax from customers**: 从客户那里收取该州的销售税\n- **Send it to the state**: 将其交给该州\n\n**3. 句子结构**\n\n这是一个复合句，主句由\"States can pass laws\"组成，而\"requiring out-of-state sellers to collect the state’s sales tax from customers and send it to the state\"则是一个由\"requiring\"引导的非限制性定语从句，用来修饰\"laws\"。\n\n**4. 语法**\n\n- **\"Can pass laws\"**: 这里使用了\"can\"来表示可能性，后接动词原形形成modal verb phrase。\n- **\"Requiring out-of-state sellers to...\"**: 这是一个由\"requiring\"引导的非限制性定语从句，用来修饰前面的\"laws\"。在英语中，非限制性定语从句通常用来添加一些额外的信息，不是句子主要意思的必要部分。\n- **\"To collect...and send...\"**: 这是一个由\"to\"引导的不定式短语，用来表示目的或意图。\n\n**5. 知识点总结**\n\n在这个句子中，主要涉及到以下几个关键的英语语法知识点：\n\n- **Modal Verb Phrase**：模态动词短语在英语中用来表示能力、可能性、必要性等。在本句中，“can pass laws” 使用了\"can\"来表示可能性。\n\n- **Nonrestrictive Attribute Clause**：非限制性定语从句用来添加一些额外的信息，但并非句子主要意思的必要部分。在本句中，“requiring out-of-state sellers to collect the state’s sales tax from customers and send it to the state” 是一个由\"requiring\"引导的非限制性定语从句，用来修饰\"laws\"。\n\n- **Infinitive Phrase**：不定式短语在英语中通常用来表示目的或意图。在本句中，“to collect...and send...” 是一个由\"to\"引导的不定式短语，表示的是境外卖家需要做的动作。\n\n**6. 相似句子练习**\n\n\"Under the new regulations, companies can implement policies demanding employees to follow strict security measures and report any breaches.\"\n\n\"根据新的规定，公司可以实施政策，要求员工遵守严格的安全措施并报告任何违规行为。\""}]},{"sentences":[{"text":"Retail trade groups praised the ruling, saying it levels the playing field for local and online businesses.","explainMd":"**1. 翻译**\n\n\"零售贸易团体赞扬了这项裁决，称它为本地和在线商业创造了公平的竞争环境。\"\n\n**2. 词汇和短语**\n\n- **Retail trade groups**: 零售贸易团体\n- **Praised**: 赞扬\n- **The ruling**: 这项裁决\n- **Saying**: 说，称\n- **It levels the playing field**: 它创造了公平的竞争环境\n- **For local and online businesses**: 对于本地和在线商业\n\n**3. 句子结构**\n\n这是一个相对简单的复合句，主句是 \"Retail trade groups praised the ruling\"，其中 \"saying it levels the playing field for local and online businesses\" 是一个现在分词短语作为主句的非限定性定语，用来解释或扩展主句的内容。\n\n**4. 语法**\n\n- **Retail trade groups praised the ruling**: 这是一个简单的主谓宾结构句子，\"Retail trade groups\" 是主语，\"praised\" 是谓语，\"the ruling\" 是宾语。\n\n- **Saying it levels the playing field for local and online businesses**: 这是一个现在分词短语作为非限定性定语，现在分词短语在句中可以用来作为附加信息，解释或扩展主句的内容。\n\n**5. 知识点总结**\n\n在这个句子中，主要涉及到以下几个关键的英语语法知识点：\n\n- **Simple Sentence**: 这是一个简单的主谓宾结构句子，主语，谓语和宾语都非常清楚。\n\n- **Present Participle Phrase**: 现在分词短语在句子中常常被用来作为附加信息，解释或扩展主句的内容。在本句中，“saying it levels the playing field for local and online businesses” 是一个现在分词短语作为非限定性定语。\n\n**6. 相似句子练习**\n\n\"Environmentalists applauded the policy, stating it promotes the sustainable use of natural resources.\"\n\n\"环保人士赞扬了这项政策，称它促进了自然资源的可持续利用。\""},{"text":"The losers, said retail analyst Neil Saunders, are online-only retailers, especially smaller ones.","explainMd":"**1. 翻译**\n\n\"零售分析师尼尔·桑德斯说，失败的一方是只在网上营业的零售商，尤其是较小的零售商。\"\n\n**2. 词汇和短语**\n\n- **The losers**: 失败的一方\n- **Said**: 表达，说\n- **Retail analyst Neil Saunders**: 零售分析师尼尔·桑德斯\n- **Are**: 是\n- **Online-only retailers**: 只在网上营业的零售商\n- **Especially**: 尤其\n- **Smaller ones**: 较小的零售商\n\n**3. 句子结构**\n\n这是一个简单的句子，结构是 \"主语 + 谓语 + 宾语\"，其中 \"Retail analyst Neil Saunders\" 是主语，\"said\" 是谓语，而 \"The losers are online-only retailers, especially smaller ones\" 是宾语。\n\n**4. 语法**\n\n- **The losers, said Retail analyst Neil Saunders, are online-only retailers, especially smaller ones**: 这个句子的主语是 \"The losers\"，谓语是 \"are\"，而宾语是 \"online-only retailers, especially smaller ones\"。\"Said Retail analyst Neil Saunders\" 是一个插入语，用来注明信息的来源。\n\n**5. 知识点总结**\n\n在这个句子中，主要涉及到以下几个关键的英语语法知识点：\n\n- **Simple Sentence**: 这是一个简单的主谓宾结构句子，主语，谓语和宾语都非常清楚。\n\n- **Parenthetical Expression**: \"said Retail analyst Neil Saunders\" 是一个插入语，用来注明信息的来源。\n\n**6. 相似句子练习**\n\n\"The winners, stated sports commentator John Smith, are the underdogs, particularly the young players.\"\n\n\"体育评论员约翰·史密斯表示，胜利的一方是不被看好的一方，尤其是年轻的运动员们。\""},{"text":"Those retailers may face headaches complying with various state sales tax laws.","explainMd":"**1. 翻译**\n\n\"这些零售商可能会在遵守各州的销售税法规时遇到困难。\"\n\n**2. 词汇和短语**\n\n- **Those retailers**: 这些零售商\n- **May face**: 可能会面临\n- **Headaches**: 困难，麻烦\n- **Complying with**: 遵守\n- **Various**: 各种各样的\n- **State sales tax laws**: 各州的销售税法规\n\n**3. 句子结构**\n\n这是一个复杂句子，结构为 \"主语 + 谓语 + 宾语\"，其中 \"Those retailers\" 是主语，\"may face\" 是谓语，\"headaches complying with various state sales tax laws\" 是宾语。\n\n**4. 语法**\n\n- **Those retailers may face headaches complying with various state sales tax laws**: 主语是 \"Those retailers\"，谓语是 \"may face\"，而宾语是 \"headaches complying with various state sales tax laws\"。这里 \"complying with various state sales tax laws\" 是现在分词短语作为宾语补足语，描述零售商可能会面临的情况。\n\n**5. 知识点总结**\n\n在这个句子中，主要涉及到以下几个关键的英语语法知识点：\n\n- **Complex sentence**: 这是一个复杂句子。主语很直接，而宾语部分包含了现在分词短语作为补足语。\n  \n- **Present participle phrase as object complement**: \"complying with various state sales tax laws\" 是现在分词短语作为宾语补足语，用来描述主语可能会面临的困难。\n\n**6. 相似句子练习**\n\n\"Those students may face challenges adapting to the new education system.\"\n\n\"这些学生可能会在适应新的教育系统时遇到挑战。\""},{"text":"The Small Business & Entrepreneurship Council advocacy group said in a statement, “Small businesses and internet entrepreneurs are not well served at all by this decision.”","explainMd":"**1. 翻译**\n\n小企业和互联网创业者的倡导组织“小企业与创业委员会”在一份声明中表示，“这一决定对小企业和互联网创业者没有任何好处。”\n\n**2. 词汇和短语**\n\n- **The Small Business & Entrepreneurship Council advocacy group**: 小企业与创业委员会倡导组织\n- **Said in a statement**: 在一份声明中表示\n- **Small businesses and internet entrepreneurs**: 小企业和互联网创业者\n- **Are not well served at all**: 完全没有得到好处\n- **By this decision**: 由这个决定\n\n**3. 句子结构**\n\n这个句子的结构是 \"主语 + 谓语 + 宾语\"。其中，“The Small Business & Entrepreneurship Council advocacy group” 是主语，\"said in a statement\" 是谓语，而双引号内的部分是宾语。\n\n**4. 语法**\n\n- **The Small Business & Entrepreneurship Council advocacy group said in a statement, “Small businesses and internet entrepreneurs are not well served at all by this decision.”**: 这是一个简单句，主语是 \"The Small Business & Entrepreneurship Council advocacy group\"，谓语是 \"said in a statement\"，宾语是引号内的直接引语。这里的直接引语用来描绘该组织对最高法院决定的反应。\n\n**5. 知识点总结**\n\n这个句子主要涉及到以下几个英语语法知识点：\n\n- **Simple Sentence structure**: 这是一个简单句子，主语-谓语-宾语的结构清晰明了。\n  \n- **Direct Quotation**: 这个句子中使用了直接引语来表示该组织的观点，这是英语中常见的表达方式，特别是在新闻报道或者官方声明中。\n\n**6. 相似句子练习**\n\n\"The Environmental Protection Agency announced in a press release, 'The new regulations will not significantly improve air quality.'\"\n\n\"环保局在一份新闻发布中宣布，‘新的规定不会显著改善空气质量。’\""}]}],"title":""}