{"translate":"","paragraphs":[{"sentences":[{"text":"Financial regulators in Britain have imposed a rather unusual rule on the bosses of big banks.","explainMd":"### 1. 翻译\n\"英国的金融监管机构对大银行的高层领导实施了一项相当不寻常的规定。\"\n\n### 2. 词汇和短语\n- **Financial regulators** - 金融监管机构：这是一个专门的术语，用来指代负责监督和管理金融系统的公共机构或政府机构。\n- **Imposed** - 实施，强加：在这里，它表示规则或法律被正式实施或施加。\n- **Rather unusual** - 相当不寻常： \"Rather\" 是一个副词，用来增加描述的强度。\"Unusual\" 是形容词，意思是“不常见的，不寻常的”。\n- **Rule** - 规则，规定：在这里，它指的是被强制实施的法律或规定。\n- **The bosses of big banks** - 大银行的老板：这是一个短语，用来指代大银行的高层管理人员或领导人。\n\n### 3. 句子结构\n这是一个简单的主-谓-宾结构的句子，中文对应结构如下：\n- **主语** - \"Financial regulators in Britain\"（英国的金融监管机构）\n- **谓语** - \"have imposed\"（已经实施）\n- **宾语** - \"a rather unusual rule on the bosses of big banks\"（对大银行的老板实施了一项相当不寻常的规定）\n\n### 4. 语法\n这是一个使用了现在完成时态的句子。现在完成时态由助动词“have”或“has”和过去分词（这里是“imposed”）组成，用来表示过去发生的某个行动对现在仍有影响或结果。\n\n### 5. 知识点总结\n这个句子的主题是新的金融监管规定。它使用了现在完成时态来描述一个对现在仍有影响的过去行动。此外，它还使用了专门的金融术语（如\"financial regulators\"和\"the bosses of big banks\"）和一些描述性的词语（如\"rather unusual\"）。\n\n### 6. 相似句子练习\n\"Health authorities in Australia have implemented a new policy on the distribution of vaccines.\"（澳大利亚的卫生部门对疫苗的分发实施了一项新的政策。）"},{"text":"Starting next year, any guaranteed bonus of top executives could be delayed 10 years if their banks are under investigation for wrongdoing.","explainMd":"### 1. 翻译\n\"从明年开始，如果他们的银行因为违法行为被调查，那么高级管理人员的任何保证性奖金可能会被延迟10年发放。\"\n\n### 2. 词汇和短语\n- **Starting next year** - 从明年开始：这是一个时间短语，用来指示动作或事件的开始时间。\n- **Any guaranteed bonus** - 任何保证性奖金：这是一个短语，指的是一种确定会获得的奖金或额外收入。\n- **Top executives** - 高级管理人员：这是一个短语，指的是一个公司或组织中的高级领导者或决策者。\n- **Could be delayed** - 可能会被延迟：\"Could\" 是模态动词，表示可能性。\"Delayed\" 是被动语态的动词，表示被推迟或延迟。\n- **Under investigation for wrongdoing** - 因为违法行为而被调查：这是一个短语，指的是正接受调查以确定是否有不当行为或违法行为的情况。\n\n### 3. 句子结构\n这是一个复杂句，由一个主句和一个条件从句组成，对应的中文结构如下：\n- **主句** - \"any guaranteed bonus of top executives could be delayed 10 years\"（高级管理人员的任何保证性奖金可能会被延迟10年发放）\n- **条件从句** - \"if their banks are under investigation for wrongdoing\"（如果他们的银行因为违法行为而被调查）\n\n### 4. 语法\n这个句子使用了条件句语法，即\"if\"引导的条件从句。\"If\"后面的句子描述了一个可能的条件或情况，主句则描述了在该条件或情况下可能发生的结果。\n\n### 5. 知识点总结\n这个句子的主题是关于新的金融监管规则对银行高层的影响。它使用条件句来描述这种影响，即如果发生一种特定的情况（银行因违法行为被调查），则会有一个特定的结果（高级管理人员的保证性奖金可能会被延迟10年）。此外，这个句子也使用了一些金融和商业术语，如\"guaranteed bonus\"和\"top executives\"。\n\n### 6. 相似句子练习\n\"Beginning next semester, students' scholarships could be suspended if they fail more than two classes.\"（从下个学期开始，如果学生挂科超过两门，他们的奖学金可能会被暂停。）"},{"text":"The main purpose of this “clawback” rule is to hold bankers accountable for harmful risk-taking and to restore public trust in financial institutions.","explainMd":"### 1. 翻译\n\"这个“追回”规则的主要目的是要求银行家对有害的风险承担负责，并恢复公众对金融机构的信任。\"\n\n### 2. 词汇和短语\n- **The main purpose** - 主要目的：用于描述某个计划、规则或行动的主要意图或目标。\n- **clawback rule** - “追回”规则：这是金融术语，指的是一个允许公司或机构在特定条件下追回已经支付或分配的资金的规则。\n- **hold bankers accountable** - 要求银行家负责：这是一个短语，表示需要银行家为他们的行为或决策负责。\n- **harmful risk-taking** - 有害的风险承担：这是一个短语，指的是那些可能导致损害或负面结果的风险决策。\n- **restore public trust** - 恢复公众信任：这是一个短语，指的是重建或提升公众对某个个体、组织或系统的信任度。\n- **financial institutions** - 金融机构：这是一个短语，指的是提供金融服务的组织，如银行、保险公司、投资公司等。\n\n### 3. 句子结构\n这是一个简单的句子，它由一个主题（主要目的）和两个并列的述语（要求银行家对有害的风险承担负责，并恢复公众对金融机构的信任）构成。对应的中文结构如下：\n- **主题** - \"The main purpose of this “clawback” rule\"（这个“追回”规则的主要目的）\n- **述语1** - \"is to hold bankers accountable for harmful risk-taking\"（是要求银行家对有害的风险承担负责）\n- **述语2** - \"and to restore public trust in financial institutions\"（并恢复公众对金融机构的信任）\n\n### 4. 语法\n这个句子的语法特点是使用“并列句”，即用“and”连接两个或多个并列的句子成分。在这个句子中，“to hold bankers accountable for harmful risk-taking”和“to restore public trust in financial institutions”是两个并列的不定式短语，共享同一个主题“The main purpose of this “clawback” rule”。\n\n### 5. 知识点总结\n这个句子的主题是关于新的金融监管规则的主要目的。它使用并列句语法来描述这个目的，即要求银行家对有害的风险承担负责，并恢复公众对金融机构的信任。此外，这个句子也使用了一些金融和商业术语，如\"clawback rule\"和\"financial institutions\"。\n\n### 6. 相似句子练习\n\"The primary goal of this new policy is to make manufacturers responsible for the environmental impact of their products and to increase public awareness about recycling.\"（这个新政策的主要目标是让制造商对他们产品的环境影响负责，并提高公众对回收的意识。）"},{"text":"Yet officials also hope for a much larger benefit: more long-term decision-making, not only by banks but by all corporations, to build a stronger economy for future generations.","explainMd":"### 1. 翻译\n\"然而，官员们还希望获得更大的好处：更多的长期决策制定，不仅是银行，而且是所有公司，以便为未来的几代人建设更强大的经济。\"\n\n### 2. 词汇和短语\n- **Yet officials also hope** - 然而，官员们还希望：这是一个转折短语，用于引出另一个相关的观点或信息。\n- **a much larger benefit** - 更大的好处：这个短语用来描述一个更大的或更重要的优势或利益。\n- **long-term decision-making** - 长期决策制定：这个短语用于描述在一个较长的时间范围内做出的决策。\n- **not only... but...** - 不仅...而且...：这是一个固定短语，用于强调两个或更多的事物或概念都适用。\n- **build a stronger economy** - 建设更强大的经济：这个短语用来描述提升或改善一个地区或国家的经济状况。\n- **for future generations** - 为未来的几代人：这个短语用来描述一种长期的、面向未来的视角或目标。\n\n### 3. 句子结构\n这个句子是一个复合句，它包含一个主句（Yet officials also hope for a much larger benefit）和一个冒号后的解释性附加信息（more long-term decision-making, not only by banks but by all corporations, to build a stronger economy for future generations）。对应的中文结构如下：\n- **主句** - \"Yet officials also hope for a much larger benefit\"（然而，官员们还希望获得更大的好处）\n- **解释性附加信息** - \"more long-term decision-making, not only by banks but by all corporations, to build a stronger economy for future generations\"（更多的长期决策制定，不仅是银行，而且是所有公司，以便为未来的几代人建设更强大的经济）\n\n### 4. 语法\n这个句子使用了“not only... but...”的并列结构，强调长期决策制定的好处不仅适用于银行，还适用于所有公司。此外，句子还使用了冒号来引入与主句直接相关的解释或详细信息。\n\n### 5. 知识点总结\n这个句子的主题是新的金融监管规则的潜在好处。它使用了“not only... but...”的并列结构和冒号引入的解释，来详细描述这些好处：更多的长期决策制定，不仅是银行，而且是所有公司，以便为未来的几代人建设更强大的经济。\n\n### 6. 相似句子练习\n\"However, the teachers also anticipate a greater advantage: more independent learning, not only from students but also from parents, to cultivate a more knowledgeable society for future generations.\"（然而，老师们也期待一个更大的优势：更多的独立学习，不仅来自学生，也来自家长，以培养一个对未来几代人更有知识的社会。）"}]},{"sentences":[{"text":"“Short-termism” or the desire for quick profits, has worsened in publicly traded companies, says the Bank of England’s top economist, Andrew Haldane.","explainMd":"### 1. 翻译\n\"英国央行的首席经济学家Andrew Haldane表示，'短视主义'或追求快速利润的欲望，已经在上市公司中恶化。\"\n\n### 2. 词汇和短语\n- **\"Short-termism\"** - '短视主义'：这是一个描述只关注短期利益而忽视长期效果的词语。\n- **or the desire for quick profits** - 或者追求快速利润的欲望：这是一个并列的概念，用来进一步解释\"Short-termism\"。\n- **has worsened** - 已经恶化：这个短语用来描述一个不良状况的加剧。\n- **in publicly traded companies** - 在上市公司中：这个短语指的是在公开交易的公司中，这些公司的股票可以在公开的股票市场上买卖。\n- **says the Bank of England’s top economist, Andrew Haldane** - 英国央行的首席经济学家Andrew Haldane表示：这是一个引述某人观点的短语。\n\n### 3. 句子结构\n这是一个简单的主谓宾句型，主语是\"Short-termism\"，谓语是\"has worsened\"，宾语是\"in publicly traded companies\"。\"says the Bank of England’s top economist, Andrew Haldane\"是一个描述句子来源的定语从句。对应的中文结构如下：\n- **主语** - \"'短视主义'或追求快速利润的欲望\"（'Short-termism' or the desire for quick profits）\n- **谓语** - \"已经恶化\"（has worsened）\n- **宾语** - \"在上市公司中\"（in publicly traded companies）\n- **定语从句** - \"英国央行的首席经济学家Andrew Haldane表示\"（says the Bank of England’s top economist, Andrew Haldane）\n\n### 4. 语法\n这个句子的主谓宾结构很清晰，主语是\"Short-termism\"，谓语是\"has worsened\"，宾语是\"in publicly traded companies\"。此外，定语从句\"says the Bank of England’s top economist, Andrew Haldane\"用来引述Andrew Haldane的观点。\n\n### 5. 知识点总结\n这个句子是对\"短视主义\"在上市公司中恶化的情况的描述，通过引述英国央行的首席经济学家Andrew Haldane的观点给出了权威的支持。它使用了主谓宾结构和定语从句，是一个很好的实例来学习如何引述他人的观点。\n\n### 6. 相似句子练习\n\"Pollution, or the excessive emission of harmful substances, has escalated in industrial cities, says the UN's chief environmental scientist, Dr. Maria Neira.\"（污染，或者有害物质的过度排放，在工业城市中已经升级，联合国首席环境科学家Maria Neira博士说。）"},{"text":"He quotes a giant of classical economics, Alfred Marshall, in describing this financial impatience as acting like “children who pick the plums out of their pudding to eat them at once” rather than putting them aside to be eaten last.","explainMd":"### 1. 翻译\n\"他引用了经济学经典巨匠阿尔弗雷德·马歇尔的话来描述这种金融上的急躁，就像“孩子们把布丁里的梅子一次性吃掉”，而不是把它们放在一边最后吃。\"\n\n### 2. 词汇和短语\n- **He quotes a giant of classical economics, Alfred Marshall** - 他引用了经济学经典巨匠阿尔弗雷德·马歇尔的话：这里的\"quote\"意为引用，\"giant of classical economics\"指的是经济学界的巨人，这里特指阿尔弗雷德·马歇尔。\n- **in describing this financial impatience** - 在描述这种金融上的急躁时：这里的\"financial impatience\"指的是金融领域的短期行为，追求快速的收益。\n- **as acting like “children who pick the plums out of their pudding to eat them at once”** - 就像“孩子们把布丁里的梅子一次性吃掉”：这是一个 metaphor (隐喻)，用来形象地描绘短期行为。\n- **rather than putting them aside to be eaten last** - 而不是把它们放在一边最后吃：这是一个对比短语，用来进一步强调长期行为的重要性。\n\n### 3. 句子结构\n这句话是一个复杂的长句，包含了多个从句。其主体结构是\"He quotes Alfred Marshall in describing this financial impatience as...\"，然后是一个比喻，然后是一个对比结构。对应的中文结构如下：\n- **主句** - \"他引用了经济学经典巨匠阿尔弗雷德·马歇尔的话\"（He quotes a giant of classical economics, Alfred Marshall）\n- **定语从句** - \"在描述这种金融上的急躁时\"（in describing this financial impatience）\n- **宾语从句** - \"就像孩子们把布丁里的梅子一次性吃掉\"（as acting like “children who pick the plums out of their pudding to eat them at once”）\n- **并列句** - \"而不是把它们放在一边最后吃\"（rather than putting them aside to be eaten last）\n\n### 4. 语法\n这个句子的主体部分使用了直接引语，并在引语中使用了比喻和对比结构。\"He quotes\"是主句的动词，\"a giant of classical economics, Alfred Marshall\"是引语的对象，\"in describing this financial impatience\"是引语中的定语从句，\"as acting like\"引导的是宾语从句，最后的\"rather than\"引导的是对比结构。\n\n### 5. 知识点总结\n这个句子很好地展示了如何在一个句子中使用引语、比喻和对比结构来表达观点。它让我们看到了如何引述他人的观点，并用生动的语言来描绘和解释这个观点。\n\n### 6. 相似句子练习\n\"She cites the renowned psychologist, Sigmund Freud, in describing this irrational fear as behaving like 'children who refuse to sleep in the dark', rather than confronting their fear and overcoming it.\"（她引用了著名心理学家西格蒙德·弗洛伊德的话来描述这种非理性的恐惧，就像'害怕黑暗而拒绝入睡的孩子们'，而不是面对和克服他们的恐惧。）"}]},{"sentences":[{"text":"The average time for holding a stock in both the United States and Britain, he notes, has dropped from seven years to seven months in recent decades.","explainMd":"### 1. 翻译\n\"他指出，在过去的几十年里，无论在英国还是在美国，持有股票的平均时间已经从七年降至七个月。\"\n\n### 2. 词汇和短语\n- **The average time for holding a stock** - 持有股票的平均时间：这里的\"average time\"是主语，\"for holding a stock\"是它的定语从句，用来描述这个平均时间是关于什么的。\n- **in both the United States and Britain** - 在美国和英国：这是一个介词短语，用来指明这个平均时间是在哪些地方测量的。\n- **he notes** - 他指出：这是一个主动语态的动词短语，用来引入作者的观察或者评论。\n- **has dropped from seven years to seven months** - 已经从七年降至七个月：这是一个表示变化的动词短语，\"dropped from...to...\"用来描述变化的范围。\n\n### 3. 句子结构\n这句话是一个简单的句子，包含一个主语和一个谓语，以及一个宾语从句。\n- **主句** - \"他指出\" (He notes)\n- **宾语从句** - \"在过去的几十年里，无论在英国还是在美国，持有股票的平均时间已经从七年降至七个月。\" (The average time for holding a stock in both the United States and Britain has dropped from seven years to seven months in recent decades.)\n\n### 4. 语法\n这个句子的主体部分使用了现在时态的动词\"notes\"，而宾语从句部分则使用了现在完成时态的动词\"has dropped\"，用来描述过去某段时间内发生的变化，并且这种变化一直持续到现在。\n\n### 5. 知识点总结\n这个句子很好地展示了如何在一句话中使用现在完成时态来描述过去发生的变化，并且这种变化一直持续到现在。它还展示了如何使用\"from...to...\"的结构来描述变化的范围。\n\n### 6. 相似句子练习\n\"The average time for reading a book, she observes, has decreased from three weeks to three days in recent years.\"（她观察到，近年来，阅读一本书的平均时间已经从三周减少到三天。）"},{"text":"Transient investors, who demand high quarterly profits from companies, can hinder a firm’s efforts to invest in long-term research or to build up customer loyalty.","explainMd":"### 1. 翻译\n\"追求高季度利润的短期投资者可能会阻碍公司投资于长期研究或建立客户忠诚度的努力。\"\n\n### 2. 词汇和短语\n- **Transient investors** - 短期投资者：这里的 \"transient\" 指的是短暂的、不持久的，常常用于描述那些只关注短期利润的投资者。\n- **Demand high quarterly profits** - 追求高季度利润：这里的 \"demand\" 意味着对利润的高要求或期望，\"quarterly profits\" 指的是公司每季度的盈利。\n- **Hinder a firm's efforts** - 阻碍公司的努力：这里的 \"hinder\" 表示阻碍或妨碍，\"a firm's efforts\" 指的是公司为达到某个目标所做的努力。\n- **Invest in long-term research or to build up customer loyalty** - 投资于长期研究或建立客户忠诚度：这里的 \"invest in\" 指的是投资于某个领域或项目，\"long-term research\" 可以理解为长期研究，\"build up customer loyalty\" 则可以理解为建立客户忠诚度。\n\n### 3. 句子结构\n这是一个复合句，由主句和两个并列的宾语从句构成：\n- **主句** - \"短期投资者可能会阻碍公司的努力\" (Transient investors can hinder a firm's efforts)\n- **宾语从句1** - \"投资于长期研究\" (to invest in long-term research)\n- **宾语从句2** - \"或建立客户忠诚度\" (or to build up customer loyalty)\n\n### 4. 语法\n这个句子中使用了 \"can\" 来表达可能性。在这个上下文中，\"can\" 表示短期投资者可能会阻碍公司的长期研究和客户忠诚度的建立。此外，句子中还使用了 \"or\" 来连接两个并列的宾语从句。\n\n### 5. 知识点总结\n这个句子为我们提供了一个很好的例子，展示了如何使用 \"can\" 来表达可能性。同时，它也展示了如何使用 \"or\" 来连接两个并列的宾语从句，以及如何在一个句子中同时描述两种可能性。\n\n### 6. 相似句子练习\n\"Short-term customers, who demand quick service, can hinder a restaurant's efforts to provide quality dishes or to create a relaxed dining atmosphere.\"（追求快速服务的短期顾客可能会阻碍餐厅提供优质菜品或创建轻松就餐氛围的努力。）"},{"text":"This has been dubbed “quarterly capitalism.”","explainMd":"### 1. 翻译\n\"这被称为'季度资本主义'。\"\n\n### 2. 词汇和短语\n- **This** - 这：在这个上下文中，\"this\" 指的是前文提到的现象或情况，即短期投资者对公司高季度利润的追求。\n- **Has been dubbed** - 被称为：这是一个常见的短语，用来表示某物或某人被赋予了一个新的名称或称号。\n- **Quarterly capitalism** - 季度资本主义：这是一个新的词组，用来描述那些只关注每个季度利润的公司或投资者的行为或态度。\n\n### 3. 句子结构\n这是一个被动语态的简单句，它的结构是：\n- **主语** - \"这\" (This)\n- **谓语** - \"被称为\" (has been dubbed)\n- **宾语** - \"'季度资本主义'\" (quarterly capitalism)\n\n### 4. 语法\n这个句子使用了被动语态。在被动语态中，动作的接受者（\"this\"）成为句子的主语，而动作的执行者则通常在 \"by\" 短语中表示或省略不提。在这里，动作的执行者（给 \"this\" 取名的人）并未明确提及。\n\n### 5. 知识点总结\n这个句子为我们提供了一个很好的例子，展示了如何在英语中使用被动语态。同时，\"has been dubbed\" 是一个常见的短语，用来表示某物或某人被赋予了一个新的名称或称号。此外，\"quarterly capitalism\" 是一个新的词组，可以用来描述只关注每个季度利润的公司或投资者的行为或态度。\n\n### 6. 相似句子练习\n\"His innovative approach has been dubbed 'creative engineering'.\"（他的创新方法被称为'创意工程'。）"}]},{"sentences":[{"text":"In addition, new digital technologies have allowed more rapid trading of equities, quicker use of information, and thus shorter attention spans in financial markets.","explainMd":"### 1. 翻译\n\"此外，新的数字技术已经允许更快的交易股票，更快地使用信息，从而导致金融市场关注度的缩短。\"\n\n### 2. 词汇和短语\n- **In addition** - 此外：用于添加或引入与前文相关的附加信息或点。\n- **New digital technologies** - 新的数字技术：指新兴的、有助于改变或改善现有实践的数字技术。\n- **Have allowed** - 已经允许：表示某事已经变成可能。\n- **More rapid trading of equities** - 更快的交易股票：指使用新技术可以更快地买卖股票。\n- **Quicker use of information** - 更快地使用信息：指新技术使得人们能更快地获取和使用信息。\n- **And thus** - 从而：表示前述情况或行为导致了后述结果或情况。\n- **Shorter attention spans in financial markets** - 金融市场关注度的缩短：指在金融市场中，人们对于特定投资或资产的关注时间变短。\n\n### 3. 句子结构\n这是一种复合句，包含两个独立子句，用 \"and thus\" 连接，表示因果关系。结构如下：\n- **主句** - \"New digital technologies have allowed more rapid trading of equities, quicker use of information\"\n- **从句** - \"and thus shorter attention spans in financial markets\"\n\n### 4. 语法\n此句子使用了现在完成时态（have allowed），表示从过去某一时间开始并持续到现在的动作或状态。在这里，表示新的数字技术已经让更快的股票交易和信息使用成为可能。\n\n### 5. 知识点总结\n这个句子为我们提供了一个很好的例子，展示了如何在英语中使用现在完成时态，并且连接了两个独立子句来形成因果关系。\"In addition\" 是一个常见的过渡短语，用于添加或引入与前文相关的附加信息或点。\n\n### 6. 相似句子练习\n\"In addition, the rise of the internet has allowed easier access to information, leading to a more knowledgeable public.\"（此外，互联网的崛起使得人们更容易获取信息，从而导致公众更加知识渊博。）"},{"text":"“There seems to be a predominance of short-term thinking at the  expense  of long-term investing,” said Commissioner Daniel Gallagher of the US Securities and Exchange Commission in a speech this week.","explainMd":"### 1. 翻译\n\"美国证券交易委员会的委员Daniel Gallagher在本周的一次演讲中说，'似乎短期思维在牺牲长期投资的情况下占了上风。'\"\n\n### 2. 词汇和短语\n- **There seems to be** - 似乎……：表示对某种状态或情况的推测。\n- **Predominance** - 占优势，占上风：在比较或竞争中占主导地位。\n- **Short-term thinking** - 短期思维：关注短期目标或利益而忽视长期后果的思考方式。\n- **At the expense of** - 以……为代价，牺牲：表示为了获得某种利益或结果而舍弃或牺牲另一种事物。\n- **Long-term investing** - 长期投资：指长期投入资源（如时间、金钱等）以期望在将来获得回报的行为。\n\n### 3. 句子结构\n这是一个简单句，其中包含一个主语（\"There\"），一个谓语（\"seems to be\"），一个宾语（\"a predominance of short-term thinking at the expense of long-term investing\"）。\n\n### 4. 语法\n此句子使用了\"there seems to be\"这个短语来表达某种情况或状态的存在。\"At the expense of\"是一个常见的短语，表示为了获得某种利益或结果而舍弃或牺牲另一种事物。\n\n### 5. 知识点总结\n此句子向我们展示了如何使用\"there seems to be\"这个短语来表达对某种情况或状态的推测，并且使用了\"at the expense of\"这个短语来表达一种牺牲或舍弃的概念。\n\n### 6. 相似句子练习\n\"There seems to be a trend of prioritizing profits at the expense of environmental protection,\" said the environmentalist in her lecture today.（环保主义者在今天的演讲中说，\"似乎存在着以牺牲环境保护为代价优先考虑利润的趋势。\"）"}]},{"sentences":[{"text":"In the US, the Sarbanes-Oxley Act of 2002 has pushed most public companies to defer performance bonuses for senior executives by about a year, slightly helping reduce “short-termism.” In its latest survey of CEO pay, The Wall Street Journal finds that “a substantial part” of executive pay is now tied to performance.","explainMd":"### 1. 翻译\n\"在美国，2002年的萨班斯-奥克斯利法案推动了大多数上市公司将高级执行官的绩效奖金推迟发放大约一年，这在一定程度上帮助减少了'短期主义'。《华尔街日报》在其最新的CEO薪酬调查中发现，现在'一大部分'的高管薪酬与绩效挂钩。\"\n\n### 2. 词汇和短语\n- **The Sarbanes-Oxley Act of 2002** - 2002年的萨班斯-奥克斯利法案：这是一部美国的联邦法律，旨在保护投资者免受会计欺诈和其他金融欺诈。\n- **Defer** - 推迟：推迟某事的发生或完成。\n- **Performance bonuses** - 绩效奖金：基于某人或某团队在特定期间的表现或成果而提供的额外薪酬。\n- **Short-termism** - 短期主义：关注短期目标或利益，而忽视长期后果的思考方式。\n- **Tied to performance** - 与绩效挂钩：某种奖励或惩罚与某人的表现或成果直接相关。\n\n### 3. 句子结构\n这是一个复合句，包含两个独立的主句：\n1. \"The Sarbanes-Oxley Act of 2002 has pushed most public companies to defer performance bonuses for senior executives by about a year, slightly helping reduce 'short-termism.'\"\n2. \"The Wall Street Journal finds that 'a substantial part' of executive pay is now tied to performance.\"\n\n### 4. 语法\n这个句子使用了现在完成时(\"has pushed\")来表达一个在过去开始且对现在仍有影响的动作或状态。另外，使用了引用('short-termism' 和 'a substantial part')来表达特定的概念或引述他人的话。\n\n### 5. 知识点总结\n这个句子展示了如何使用现在完成时来表达一个对现在仍有影响的动作或状态，并且如何使用引用来表达特定的概念或引述他人的话。此外，还引入了一些特定于金融和经济领域的词汇和概念。\n\n### 6. 相似句子练习\n\"In China, the recent reforms have urged many corporations to link managerial pay with company's performance, which is an attempt to promote more accountability among executives,\" reported The Financial Times. (\"金融时报\"报道称，\"在中国，最近的改革推动了许多公司将管理层的薪酬与公司的绩效挂钩，这是一种促进高管更加负责任的尝试。\")"}]},{"sentences":[{"text":"Much more could be done to encourage “long-termism,” such as changes in the tax code and quicker disclosure of stock acquisitions.","explainMd":"### 1. 翻译\n\"可以做更多的事情来鼓励'长期主义'，例如改变税收法规和加快股票收购的披露。\"\n\n### 2. 词汇和短语\n- **Much more** - 更多：用来表示可以做得更多。\n- **Encourage** - 鼓励：激励或促使某种行为。\n- **Long-termism** - 长期主义：关注长期目标或利益，而非短期结果的思维方式。\n- **Changes in the tax code** - 改变税收法规：引入新的税法，或修改现有的税法。\n- **Quicker disclosure of stock acquisitions** - 加快股票收购的披露：更快地公开或公布股票收购的信息。\n\n### 3. 句子结构\n这是一个简单句，主要由一个主句组成：\"Much more could be done to encourage 'long-termism'\". 在这个主句之后，作者使用了一个列举的短语：\"such as changes in the tax code and quicker disclosure of stock acquisitions\" 来具体说明可以做什么。\n\n### 4. 语法\n这个句子使用了模态动词 \"could\" 来表达可能性。\"Such as\" 是一个常用的短语，用来引入一个或多个例子来具体说明前面的陈述。\n\n### 5. 知识点总结\n这个句子主要展示了如何使用模态动词来表达可能性，以及如何使用\"such as\"来引入例子。此外，它还引入了一些特定于金融和经济领域的词汇和概念。\n\n### 6. 相似句子练习\n\"More initiatives could be taken to promote sustainability, such as implementing green policies and encouraging recycling.\" (\"可以采取更多的措施来推广可持续性，例如实施绿色政策和鼓励回收。\")"},{"text":"In France, shareholders who hold onto a company investment for at least two years can sometimes earn more voting rights in a company.","explainMd":"### 1. 翻译\n\"在法国，如果股东持有公司投资不少于两年，他们有时可以在公司中获得更多的投票权。\"\n\n### 2. 词汇和短语\n- **In France** - 在法国：表示地点的介词短语。\n- **Shareholders** - 股东：拥有公司部分所有权的个人或机构。\n- **Who hold onto** - 持有：继续保持某物，不放手。\n- **A company investment** - 公司投资：投资在某个公司的资金。\n- **For at least two years** - 至少两年：时间段的表示。\n- **Can sometimes** - 有时可以：表示可能性或不确定性。\n- **Earn more voting rights** - 获得更多的投票权：在公司决策中有更多的决定权。\n\n### 3. 句子结构\n这个句子是一个复杂句，主要由两个部分构成：一个主句 \"shareholders ... can sometimes earn more voting rights in a company\"，和一个定语从句 \"who hold onto a company investment for at least two years\" (修饰 \"shareholders\")。\n\n### 4. 语法\n这个句子使用了\"who\"引导的定语从句来修饰主句中的\"shareholders\"。\"Can\"是模态动词，表示可能性。\"Sometimes\"是副词，用来表示不确定的频率。\n\n### 5. 知识点总结\n这个句子主要展示了如何使用\"who\"引导的定语从句来修饰名词，以及如何使用模态动词和副词表达可能性和不确定性。此外，它还引入了一些特定于金融和经济领域的词汇和概念。\n\n### 6. 相似句子练习\n\"In China, customers who keep their money in the bank for more than five years can sometimes receive higher interest rates.\" (\"在中国，将他们的钱存入银行超过五年的客户有时可以收到更高的利率。\")"}]},{"sentences":[{"text":"Within companies, the right compensation design can provide incentives for executives to think beyond their own time at the company and on behalf of all stakeholders.","explainMd":"### 1. 翻译\n\"在公司内部，正确的薪酬设计可以为高管提供激励，使他们超越自身在公司的时间，代表所有利益相关者去思考问题。\"\n\n### 2. 词汇和短语\n- **Within companies** - 在公司内部：表示地点的介词短语。\n- **The right compensation design** - 正确的薪酬设计：refers to the strategy or plan to reward employees for their work.\n- **Can provide incentives for** - 可以为...提供激励：表示可能为某人或某物提供动力或激励。\n- **Executives** - 高管：公司的高层管理人员。\n- **To think beyond their own time at the company** - 超越他们自身在公司的时间去思考：这是一个带有动词不定式的短语，表示在公司的时间之外去思考。\n- **On behalf of all stakeholders** - 代表所有利益相关者：表示代表所有与公司有利害关系的人。\n\n### 3. 句子结构\n这是一个复合句，主要由主句 \"The right compensation design can provide incentives for executives\" 和两个并列的不定式短语 \"to think beyond their own time at the company\" 和 \"on behalf of all stakeholders\" 构成。\n\n### 4. 语法\n此句使用了动词不定式 \"to think\" 和 \"on behalf\" 来表示目的或意图。\"Can\" 是模态动词，表示可能性。\"For\" 是介词，引导介词短语 \"for executives\"。\n\n### 5. 知识点总结\n此句主要展示了如何使用动词不定式表示目的或意图，以及如何使用模态动词表示可能性。此外，它还引入了一些特定于公司管理和薪酬设计的词汇和概念。\n\n### 6. 相似句子练习\n\"Within schools, the right curriculum design can provide incentives for students to study beyond their own grade level and on behalf of their future careers.\" (\"在学校内部，正确的课程设计可以为学生提供激励，使他们超越自身的年级水平，为他们的未来职业去学习。\")"},{"text":"Britain’s new rule is a reminder to bankers that society has an interest in their performance, not just for the short term but for the long term.","explainMd":"### 1. 翻译\n\"英国的新规则是对银行家的提醒，社会对他们的表现有着关注，不仅仅是短期，而且是长期的。\"\n\n### 2. 词汇和短语\n- **Britain’s new rule** - 英国的新规则：指的是文章中提到的英国对大银行高管做出的规定。\n- **Is a reminder to bankers** - 是对银行家的提醒：表示这个新规则的目的是提醒银行家某件事情。\n- **That society has an interest in their performance** - 社会对他们的表现有着关注：\"That\" 引导的是宾语从句，解释了提醒的内容是什么。\n- **Not just for the short term but for the long term** - 不仅仅是短期，而且是长期的：这是一个对比的结构，强调社会对他们的表现的关注是长期的，而不仅仅是短期的。\n\n### 3. 句子结构\n此句是一个复合句，由主句 \"Britain’s new rule is a reminder to bankers\" 和宾语从句 \"that society has an interest in their performance\" 构成。在宾语从句中，又有一个并列的结构 \"not just for the short term but for the long term\"。\n\n### 4. 语法\n在这个句子中，\"that\" 引导的是一个宾语从句，用来说明 \"reminder\" 的具体内容。而 \"not...but...\" 是用来表示对比的并列结构。\n\n### 5. 知识点总结\n此句主要展示了如何使用宾语从句来详细说明主句中的某个概念，并通过 \"not...but...\" 的对比结构来强调某个观点。此外，它还引入了一些特定于银行规定和社会关注的词汇和概念。\n\n### 6. 相似句子练习\n\"School's new policy is a reminder to students that society values their knowledge, not just for the purpose of passing exams but for the lifelong learning.\" (\"学校的新政策是对学生的提醒，社会重视他们的知识，不仅仅是为了通过考试，更是为了终身学习。\")"}]}],"title":""}