{"translate":"","paragraphs":[{"sentences":[{"text":"It is true that CEO pay has gone up—top ones  may  make 300  times the pay  of typical workers on average, and since the mid-1970s, CEO pay for large publicly traded American corporations has, by varying estimates, gone up by about 500%.","explainMd":"**1. 翻译:**\n\n确实，CEO的薪酬已经上升——最顶级的CEO平均可能获得普通工人薪酬的300倍，并且自上世纪70年代中期以来，美国大型上市公司的CEO薪酬已经根据不同的估算上涨了大约500%。\n\n**2. 重难点词汇和短语:**\n\n- **It is true that**: 确实\n- **CEO pay has gone up**: CEO的薪酬已经上升\n- **top ones may make 300 times the pay of typical workers on average**: 最顶级的CEO平均可能获得普通工人薪酬的300倍\n- **since the mid-1970s, CEO pay for large publicly traded American corporations has, by varying estimates, gone up by about 500%**: 自上世纪70年代中期以来，美国大型上市公司的CEO薪酬已经根据不同的估算上涨了大约500%\n\n**3. 句子结构:**\n\n这是一个由两个子句组成的复合句，分别为\"It is true that CEO pay has gone up—top ones may make 300 times the pay of typical workers on average\"和\"since the mid-1970s, CEO pay for large publicly traded American corporations has, by varying estimates, gone up by about 500%\"。这两个子句通过并列连词\"and\"连接。\n\n**4. 语法:**\n\n1. \"It is true that\"引导一个宾语从句。\n1. \"top ones may make 300 times the pay of typical workers on average\"是一个主谓宾结构，\"may make\"为情态动词+动词，\"300 times the pay of typical workers on average\"为目标补语。\n1. \"since the mid-1970s\"为时间状语，\"by varying estimates\"为方式状语，\"has gone up by about 500%\"为谓语。\n\n**5. 知识点总结:**\n\n1. \"It is true that\"可以引导宾语从句，表示\"确实，的确\"的意思。\n1. 情态动词\"may\"表示可能性，后接动词原形。\n1. \"since\"表示从某个时间点开始直到现在的持续状态。\n1. \"by varying estimates\"表示\"根据不同的估算\"，常用来引入一些不确定的信息。\n\n**6. 相似句子练习:**\n\nIt is true that the cost of living has gone up—most families may spend 50% more on necessities on average, and since the 2000s, the cost of living in major cities has, by varying estimates, gone up by about 200%.\n\n确实，生活成本已经上升——大多数家庭在必需品上的支出平均可能增加了50%，并且自2000年以来，大城市的生活成本已经根据不同的估算上涨了大约200%。"},{"text":"The typical CEO of a top American corporation now makes about $18.9 million a year.","explainMd":"**1. 翻译:**\n\n现在，一家顶级美国公司的典型CEO每年可以获得大约1890万美元的薪酬。\n\n**2. 重难点词汇和短语:**\n\n- **The typical CEO of a top American corporation**: 一家顶级美国公司的典型CEO\n- **now makes about $18.9 million a year**: 现在每年可以获得大约1890万美元的薪酬\n\n**3. 句子结构:**\n\n这是一个简单句，主语是\"The typical CEO of a top American corporation\"，谓语是\"now makes\"，宾语是\"about $18.9 million a year\"。\n\n**4. 语法:**\n\n1. \"The typical CEO of a top American corporation\"是一个名词短语，作为句子的主语。\n1. \"now makes\"是一个动词短语，\"now\"是一个时间状语，\"makes\"是一个一般现在时的动词。\n1. \"about $18.9 million a year\"是一个名词短语，作为句子的宾语。\n\n**5. 知识点总结:**\n\n1. \"The typical...of\"是一个常见的表达方式，表示\"……的典型\"。\n1. \"now\"是一个常见的时间状语，表示\"现在\"。\n1. \"makes\"在这里的意思是\"赚取，获得\"，常用来表示赚钱。\n1. \"about\"是一个常见的修饰词，表示\"大约，差不多\"。\n\n**6. 相似句子练习:**\n\nThe typical professor at a top American university now makes about $150,000 a year.\n\n一所顶级美国大学的典型教授现在每年可以获得大约15万美元的薪酬。"}]},{"sentences":[{"text":"The best model for understanding the growth of CEO pay is that of limited CEO talent in a world where business opportunities for the top firms are growing rapidly.","explainMd":"**1. 翻译：**\n\n理解CEO薪酬增长的最佳模型是在一个顶级公司的商业机会迅速增长的世界中，CEO人才的数量有限。\n\n**2. 重难点词汇和短语：**\n\n- **The best model for understanding the growth of CEO pay**: 理解CEO薪酬增长的最佳模型\n- **limited CEO talent**: 有限的CEO人才\n- **in a world where business opportunities for the top firms are growing rapidly**: 在一个顶级公司的商业机会迅速增长的世界中\n\n**3. 句子结构：**\n\n这是一个复杂句，主句是\"The best model for understanding the growth of CEO pay is that of limited CEO talent\"，它由一个定语从句\"in a world where business opportunities for the top firms are growing rapidly\"修饰。\n\n**4. 语法：**\n\n1. \"The best model for understanding the growth of CEO pay\"是一个名词短语，作为句子的主语。\n1. \"is\"是一个系动词，用于连接主语和表语。\n1. \"that of limited CEO talent\"是一个名词短语，作为句子的表语。\n1. \"in a world where business opportunities for the top firms are growing rapidly\"是一个定语从句，用于修饰主句。\n\n**5. 知识点总结：**\n\n1. \"The best model for...\"是一个常见的表达方式，表示\"对于...的最佳模型\"。\n1. \"that of\"是一个常见的代词短语，用于替代前面提到的名词。\n1. \"in a world where...\"是一个常见的定语从句，用于修饰名词。\n\n**6. 相似句子练习：**\n\nThe best strategy for understanding the rise of technology companies is that of rapid innovation in a world where market demands are changing quickly.\n\n理解科技公司崛起的最佳策略是在一个市场需求快速变化的世界中，科技的快速创新。"},{"text":"The efforts of America’ s highest-earning 1% have been one of the more dynamic elements of the global economy.","explainMd":"**1. 翻译：**\n\n美国最高收入的1%的努力已经成为全球经济中最为活跃的元素之一。\n\n**2. 重难点词汇和短语：**\n\n- **The efforts of America's highest-earning 1%**: 美国最高收入的1%的努力\n- **have been one of the more dynamic elements**: 已经成为最为活跃的元素之一\n- **of the global economy**: 全球经济中\n\n**3. 句子结构：**\n\n这是一个简单的主谓宾句型。主语是\"The efforts of America's highest-earning 1%\"，谓语是\"have been\"，宾语是\"one of the more dynamic elements of the global economy\"。\n\n**4. 语法：**\n\n1. \"The efforts of America's highest-earning 1%\"是一个名词短语，作为句子的主语。\n1. \"have been\"是一个完全动词，表示已经成为。\n1. \"one of the more dynamic elements of the global economy\"是一个名词短语，作为句子的宾语。\n\n**5. 知识点总结：**\n\n1. \"The efforts of...\"是一个常见的表达方式，表示\"某人或某些人的努力\"。\n1. \"have been\"是一个完成时态的动词，表示过去已经完成的动作或状态。\n1. \"one of the...\"是一个常见的表达方式，表示\"其中之一\"。\n\n**6. 相似句子练习：**\n\nThe contributions of the world's leading scientists have been one of the most significant factors in the advancement of technology.\n\n世界领先科学家的贡献已经成为技术进步中最重要的因素之一。"},{"text":"It’s not popular to say.","explainMd":"**1. 翻译：**\n\n这不是一种流行的说法。\n\n**2. 重难点词汇和短语：**\n\n- **popular to say**: 流行的说法\n- **It's not**: 这不是\n\n**3. 句子结构：**\n\n这是一个否定形式的简单主谓宾句子。主语是\"It\"，谓语是\"is not\"，宾语是\"popular to say\"。\n\n**4. 语法：**\n\n1. \"It's not\"是一个否定形式的主谓词组，\"It\"是第三人称单数，所以谓语动词用\"is\"，并且加上否定词\"not\"。\n1. \"popular to say\"是一个形容词短语，\"popular\"是形容词，\"to say\"是不定式，作为形容词的补足语。\n\n**5. 知识点总结：**\n\n1. \"It's not...\"是一个常见的表达方式，用来否定某种情况或事实。\n1. \"popular to...\"是一个形容词短语，表示\"流行的做...的事\"。\n\n**6. 相似句子练习：**\n\nIt's not easy to understand.\n\n这不是一件容易理解的事情。"},{"text":"but one reason their pay has gone up so much is that CEOs really have upped their game relative to many other workers in the U.S. economy.","explainMd":"**1. 翻译：**\n\n但他们的薪酬之所以大幅上涨的一个原因是，相比美国经济中的许多其他员工，CEO们的表现确实有了大幅提升。\n\n**2. 重难点词汇和短语：**\n\n- **upped their game**: 提升了他们的表现\n- **relative to**: 相对于\n\n**3. 句子结构：**\n\n这是一个复合句，由主句和由连接词\"that\"引导的宾语从句构成。主句的主语是\"one reason\"，谓语是\"is\"，宾语是整个宾语从句。宾语从句的主语是\"CEOs\"，谓语是\"have upped their game\"，宾语是\"many other workers in the U.S. economy\"。\n\n**4. 语法：**\n\n1. 使用了\"but\"作为并列连词，用来连接两个独立的句子，表示对前面情况的转折。\n1. \"one reason\"作为主句的主语，后面接由\"that\"引导的宾语从句。\n1. 在宾语从句中，使用了\"have upped their game\"这个表达，\"upped their game\"是一个习语，表示提升了他们的表现。\"have upped\"是现在完成时，表示过去发生的事情对现在造成的影响。\n1. \"relative to\"是一个介词短语，表示\"相对于\"。\n\n**5. 知识点总结：**\n\n1. \"but\"作为转折并列连词的使用。\n1. \"that\"引导的宾语从句的构成和用法。\n1. \"have + 过去分词\"构成的现在完成时的用法。\n1. \"relative to\"介词短语的用法。\n\n**6. 相似句子练习：**\n\nOne reason they have achieved so much is that students have put more effort into their studies relative to their peers.\n\n他们之所以取得如此大的成就的一个原因是，相较于他们的同龄人，学生们在学习上投入了更多的努力。"}]},{"sentences":[{"text":"Today’ s CEO, at least for major American firms, must have many mere skills than simply being able to “run the company.” CEOs must have a good sense of financial markets and maybe even how the company should trade in them .They also need better public relations skills than their predecessors, as the costs of even a minor slipup can be significant.","explainMd":"**1. 翻译：**\n\n至少对于主要的美国公司来说，今天的CEO必须拥有比仅仅\"运营公司\"更多的技能。CEO们必须对金融市场有深刻的理解，甚至需要知道公司应如何在其中进行交易。他们还需要比前任CEO更好的公关技巧，因为即使是小小的失误也可能造成重大的损失。\n\n**2. 重难点词汇和短语：**\n\n- **skills**: 技能\n- **simply being able to “run the company”**: 仅仅能“运营公司”\n- **a good sense of**: 对...有深刻的理解\n- **public relations skills**: 公关技巧\n- **minor slipup**: 小小的失误\n- **significant**: 重大的\n\n**3. 句子结构：**\n\n这是一个复合句，由主句和两个并列的从句组成。主句的主语是\"Today's CEO\"，谓语是\"must have\"，宾语是\"many mere skills than simply being able to “run the company.”\"。并列的两个从句分别是\"CEOs must have a good sense of financial markets and maybe even how the company should trade in them\"和\"They also need better public relations skills than their predecessors, as the costs of even a minor slipup can be significant.\"\n\n**4. 语法：**\n\n1. 在主句中，使用了\"than\"进行比较，表示CEO需要的技能比\"仅仅能运营公司\"要多。\n1. 在第一个从句中，使用了\"and\"将两个并列的内容连接起来，\"maybe even\"表示可能甚至需要更多。\n1. 在第二个从句中，使用了\"as\"引导原因状语从句，表示因为小失误可能造成重大的损失，所以需要更好的公关技巧。\n\n**5. 知识点总结：**\n\n1. \"than\"用于比较级的构成和使用。\n1. \"and\"用于连接并列的内容。\n1. \"as\"引导原因状语从句的使用。\n1. \"must have\"表示必须拥有的用法。\n\n**6. 相似句子练习：**\n\nToday's teachers, at least for high-level educational institutions, must have more skills than simply being able to \"teach classes\". Teachers must have a deep understanding of education psychology and perhaps even how to apply it in the classroom. They also need better communication skills than their predecessors, as the consequences of even a minor misunderstanding can be significant.\n\n至少对于高等教育机构来说，今天的教师必须拥有比仅仅\"教课\"更多的技能。教师们必须对教育心理学有深刻的理解，甚至需要知道如何在课堂上应用它。他们还需要比前任教师更好的沟通技巧，因为即使是小小的误解也可能造成重大的影响。"},{"text":"Then there’s the fact that large American companies are much more globalized than ever before, with supply chains spread across a larger number of countries.","explainMd":"**1. 翻译：**\n\n然后有一个事实，那就是大型美国公司比以往任何时候都更加全球化，供应链散布在更多的国家。\n\n**2. 重难点词汇和短语：**\n\n- **Then there’s the fact that**: 然后有一个事实，那就是\n- **large American companies**: 大型美国公司\n- **more globalized than ever before**: 比以往任何时候都更加全球化\n- **supply chains**: 供应链\n- **spread across**: 散布在\n\n**3. 句子结构：**\n\n这个句子结构相对简单，主语是\"the fact that large American companies are much more globalized than ever before, with supply chains spread across a larger number of countries\"，谓语是\"there's\"，表示存在的意思。\n\n**4. 语法：**\n\n1. 使用\"Then there's the fact that\"来引出一个事实。\n1. 使用\"more... than...\"来进行比较，表示\"比...更...\"。\n1. \"with\"引导的状语从句，表示原因、方式或结果。\n\n**5. 知识点总结：**\n\n1. \"Then there's the fact that\"引出事实的表达方式。\n1. \"more... than...\"的比较级结构。\n1. \"with\"引导的状语从句的用法。\n\n**6. 相似句子练习：**\n\nThen there's the fact that digital technology is more integrated into our lives than ever before, with its applications spread across many aspects of our daily routines.\n\n然后有一个事实，那就是数字技术比以往任何时候都更加融入我们的生活，其应用已经渗透到我们日常生活的许多方面。"},{"text":"To lead in that system requires knowledge that is fairly mind-boggling.","explainMd":"**1. 翻译：**\n\n在那种体系中领导需要的知识是相当令人难以置信的。\n\n**2. 重难点词汇和短语：**\n\n- **To lead in that system**: 在那种体系中领导\n- **requires**: 需要\n- **knowledge**: 知识\n- **fairly**: 相当\n- **mind-boggling**: 令人难以置信的\n\n**3. 句子结构：**\n\n这是一个简单的主谓宾结构，主语是\"to lead in that system\"，谓语是\"requires\"，宾语是\"knowledge that is fairly mind-boggling\"。\n\n**4. 语法：**\n\n1. 使用\"to\"引导的不定式作主语。\n1. \"that is fairly mind-boggling\"是定语从句，修饰前面的名词\"knowledge\"。\n\n**5. 知识点总结：**\n\n1. \"to\"引导的不定式作主语的用法。\n1. 定语从句的构成及用法。\n\n**6. 相似句子练习：**\n\nTo succeed in this field requires skills that are fairly impressive.\n\n在这个领域取得成功需要相当令人印象深刻的技能。"},{"text":"Plus, virtually all major American companies are becoming tech companies, one way or another.","explainMd":"**1. 翻译：**\n\n再者，实际上所有的主要美国公司都在以这样或那样的方式变成技术公司。\n\n**2. 重难点词汇和短语：**\n\n- **Plus**: 再者\n- **virtually**: 实际上\n- **all major American companies**: 所有的主要美国公司\n- **are becoming**: 正在变成\n- **tech companies**: 技术公司\n- **one way or another**: 以这样或那样的方式\n\n**3. 句子结构：**\n\n这个句子的主语是\"virtually all major American companies\"，谓语是\"are becoming\"，宾语是\"tech companies\"，\"one way or another\"是状语，修饰整个句子。\n\n**4. 语法：**\n\n1. 使用\"are becoming\"表示正在进行的动作。\n1. \"one way or another\"是固定短语，表示\"以某种方式\"。\n\n**5. 知识点总结：**\n\n1. \"are becoming\"的使用表示正在进行的动作。\n1. \"one way or another\"的用法和含义。\n\n**6. 相似句子练习：**\n\nPlus, virtually all students are becoming more tech-savvy, one way or another.\n\n再者，实际上所有的学生都在以这样或那样的方式变得更懂技术。"},{"text":"Beyond this, major CEOs still have to do all the day-to-day work they have always done.","explainMd":"**1. 翻译：**\n\n除此之外，主要的首席执行官仍然需要做他们一直以来都在做的日常工作。\n\n**2. 重难点词汇和短语：**\n\n- **Beyond this**: 除此之外\n- **major CEOs**: 主要的首席执行官\n- **still have to do**: 仍然需要做\n- **all the day-to-day work**: 所有的日常工作\n- **they have always done**: 他们一直以来都在做\n\n**3. 句子结构：**\n\n这是一个简单句，主语是\"major CEOs\"，谓语是\"still have to do\"，宾语是\"all the day-to-day work they have always done\"。\n\n**4. 语法：**\n\n1. \"Beyond this\"作为短语引导的状语，表示除此之外。\n1. \"have to do\"表示必须做某事的义务或责任。\n1. \"they have always done\"是定语从句，修饰前面的名词\"the day-to-day work\"。\n\n**5. 知识点总结：**\n\n1. \"Beyond this\"作为短语引导的状语的用法。\n1. \"have to do\"表示必须做某事的义务或责任的表达方式。\n1. 定语从句的构成及用法。\n\n**6. 相似句子练习：**\n\nBeyond this, students still have to do all the homework they have always done.\n\n除此之外，学生们仍然需要做他们一直以来都在做的所有作业。"}]},{"sentences":[{"text":"The common idea that high CEO pay is mainly about ripping people off doesn’t explain history very well.","explainMd":"**1. 翻译：**\n\n常见的观点认为，高额的CEO薪酬主要是一种剥削行为，但这并不能很好地解释历史。\n\n**2. 重难点词汇和短语：**\n\n- **The common idea**: 常见的观点\n- **high CEO pay**: 高额的CEO薪酬\n- **is mainly about**: 主要是关于\n- **ripping people off**: 剥削人们\n- **doesn't explain history very well**: 并不能很好地解释历史\n\n**3. 句子结构：**\n\n这是一个简单句，主语是\"The common idea\"，谓语是\"is\"，宾语是\"about ripping people off\"，\"that high CEO pay\"是定语，修饰\"idea\"，\"doesn't explain history very well\"是状语，修饰整个句子。\n\n**4. 语法：**\n\n1. \"Is about\"用来表示主题或关于什么的意思。\n1. \"Doesn't explain history very well\"是一个否定句，\"doesn't\"是助动词，\"explain\"是动词。\n\n**5. 知识点总结：**\n\n1. \"Is about\"的用法和含义。\n1. 否定句的构成及用法。\n\n**6. 相似句子练习：**\n\nThe common idea that high tuition fees are mainly about exploiting students doesn't explain the education system very well.\n\n常见的观点认为，高额的学费主要是剥削学生，但这并不能很好地解释教育系统。"},{"text":"By most measures, corporate governance has become a lot tighter and more rigorous since the 1970s.","explainMd":"**1. 翻译：**\n\n按照大多数的衡量标准，自1970年代以来，公司治理已经变得更加严格和精细。\n\n**2. 重难点词汇和短语：**\n\n- **By most measures**: 按照大多数的衡量标准\n- **corporate governance**: 公司治理\n- **has become**: 已经变得\n- **a lot tighter and more rigorous**: 更加严格和精细\n- **since the 1970s**: 自1970年代以来\n\n**3. 句子结构：**\n\n这是一个简单句，主语是\"corporate governance\"，谓语是\"has become\"，宾语是\"a lot tighter and more rigorous\"，\"By most measures\"和\"since the 1970s\"是状语。\n\n**4. 语法：**\n\n1. \"By most measures\"是短语引导的状语，表示通过大多数的衡量标准。\n1. \"Has become\"是现在完成时态，表示过去发生的事情对现在仍有影响。\n1. \"Since the 1970s\"是时间状语，表示从1970年代开始直到现在的时间。\n\n**5. 知识点总结：**\n\n1. 短语引导的状语的用法。\n1. 现在完成时态的构成及用法。\n1. 时间状语的使用。\n\n**6. 相似句子练习：**\n\nBy most measures, environmental protection has become a lot more important since the 1970s.\n\n按照大多数的衡量标准，自1970年代以来，环境保护已经变得更加重要。"},{"text":"Yet it is principally during this period of stronger governance that CEO pay has been high and rising.That suggests it is in the broader corporate interest to recruit top candidates for increasingly tough jobs.","explainMd":"**1. 翻译：**\n\n然而，正是在这个治理更为强大的时期，CEO的薪酬一直居高不下，且在上升。这暗示了在更广泛的公司利益中，招聘顶级人才来应对日益严峻的工作任务是有益的。\n\n**2. 重难点词汇和短语：**\n\n- **Yet**: 然而\n- **it is principally during this period of stronger governance**: 正是在这个治理更为强大的时期\n- **CEO pay has been high and rising**: CEO的薪酬一直居高不下，且在上升\n- **That suggests**: 这暗示了\n- **it is in the broader corporate interest**: 在更广泛的公司利益中\n- **to recruit top candidates for increasingly tough jobs**: 招聘顶级人才来应对日益严峻的工作任务\n\n**3. 句子结构：**\n\n这是两个简单句。第一句的主语是\"it\"，谓语是\"is\"，宾语是\"during this period of stronger governance\"，\"Yet\"和\"that CEO pay has been high and rising\"是状语。第二句的主语是\"That\"，谓语是\"suggests\"，宾语是\"it is in the broader corporate interest to recruit top candidates for increasingly tough jobs\"。\n\n**4. 语法：**\n\n1. \"Yet\"作为连词，用来引导转折的句子。\n1. \"Has been high and rising\"是现在完成进行时，表示从过去某一时间开始一直持续到现在的动态。\n1. \"That suggests\"中的\"That\"作为形式主语，真正的主语是后面的\"It is in the broader corporate interest to recruit top candidates for increasingly tough jobs\"。\n\n**5. 知识点总结：**\n\n1. 连词\"Yet\"的用法和含义。\n1. 现在完成进行时的构成及用法。\n1. 形式主语的使用。\n\n**6. 相似句子练习：**\n\nYet it is principally during this period of environmental awareness that energy consumption has been high and rising. That suggests it is in the broader societal interest to develop more sustainable energy sources.\n\n然而，正是在这个环保意识更强的时期，能源消耗一直居高不下且在上升。这表明，在更广泛的社会利益中，发展更可持续的能源是有益的。"}]},{"sentences":[{"text":"Furthermore, the highest CEO salaries are paid to outside candidates, not to the cozy insider picks, another sign that high CEO pay is not some kind of depredation at the expense of the rest of the company.","explainMd":"**1. 翻译：**\n\n此外，最高的CEO薪酬是支付给外部候选人，而不是给亲和的内部人选，这再次表明高CEO薪酬并非以牺牲公司其他部分为代价的一种掠夺行为。\n\n**2. 重难点词汇和短语：**\n\n- **Furthermore**: 此外\n- **the highest CEO salaries**: 最高的CEO薪酬\n- **are paid to outside candidates**: 是支付给外部候选人\n- **not to the cozy insider picks**: 而不是给亲和的内部人选\n- **another sign that**: 这再次表明\n- **high CEO pay is not some kind of depredation at the expense of the rest of the company**: 高CEO薪酬并非以牺牲公司其他部分为代价的一种掠夺行为\n\n**3. 句子结构：**\n\n这是一个复合句。主句的主语是\"the highest CEO salaries\"，谓语是\"are paid\"，宾语是\"to outside candidates\"。\"not to the cozy insider picks\"是并列结构，\"another sign that high CEO pay is not some kind of depredation at the expense of the rest of the company\"是定语从句，修饰\"another sign\"。\n\n**4. 语法：**\n\n1. \"Furthermore\"作为副词，用来引导补充说明。\n1. \"are paid to\"是一种被动结构，表示动作的承受者。\n1. \"not to\"用来表示对比或排除。\n1. \"that\"引导定语从句。\n\n**5. 知识点总结：**\n\n1. 副词\"Furthermore\"的用法和含义。\n1. 被动结构的构成及用法。\n1. \"not to\"的用法。\n1. \"that\"引导定语从句的用法。\n\n**6. 相似句子练习：**\n\nFurthermore, the highest scholarships are awarded to overseas students, not to the local ones, another sign that international education is not some kind of burden on the expense of local education.\n\n此外，最高的奖学金是授予海外学生，而不是给本地的学生，这再次表明国际教育并非以牺牲本地教育为代价的一种负担。"},{"text":"And the stock market reacts positively when companies tie CEO pay to, say, stock prices, a sign that those practices build up corporate value not just for the CEO.","explainMd":"**1. 翻译：**\n\n当公司将CEO的薪酬与，比如说，股票价格挂钩时，股市会做出积极反应，这表明这些做法不仅增加了CEO的价值，也增加了公司的价值。\n\n**2. 重难点词汇和短语：**\n\n- **And the stock market reacts positively**: 股市会做出积极反应\n- **when companies tie CEO pay to, say, stock prices**: 当公司将CEO的薪酬与，比如说，股票价格挂钩\n- **a sign that**: 这表明\n- **those practices build up corporate value not just for the CEO**: 这些做法不仅增加了CEO的价值，也增加了公司的价值\n\n**3. 句子结构：**\n\n这是一个复合句。主句的主语是\"the stock market\"，谓语是\"reacts positively\"，宾语是\"when companies tie CEO pay to, say, stock prices\"。\"a sign that those practices build up corporate value not just for the CEO\"是定语从句，修饰\"a sign\"。\n\n**4. 语法：**\n\n1. \"when\"作为连词，引导时间状语从句。\n1. \"say\"作为插入语使用，表示举例。\n1. \"that\"引导定语从句。\n\n**5. 知识点总结：**\n\n1. \"when\"引导时间状语从句的用法和含义。\n1. \"say\"作为插入语的用法。\n1. \"that\"引导定语从句的用法。\n\n**6. 相似句子练习：**\n\nAnd the public reacts positively when schools tie teacher salaries to, say, student performance, a sign that those practices improve education quality not just for the teachers.\n\n当学校将教师的薪酬与，比如说，学生的表现挂钩时，公众会做出积极反应，这表明这些做法不仅提高了教师的教育质量，也提高了整个学校的教育质量。"}]}],"title":""}