{"translate":"","paragraphs":[{"sentences":[{"text":"Progressives often support diversity mandates as a path to equality and a way to level the playing field.","explainMd":"1. **翻译**:\n\n   \"进步派人士通常支持多元化的要求，作为实现平等和平衡竞争环境的途径。\"\n\n2. **词汇和短语**:\n\n   - Progressives: 进步派人士\n   - often support: 通常支持\n   - diversity mandates: 多元化的要求\n   - as a path to: 作为通向...的途径\n   - equality: 平等\n   - and a way to: 和一种方式\n   - level the playing field: 平衡竞争环境\n\n3. **句子结构**:\n\n   这是一个复合句，主语是 \"Progressives\"，谓语是 \"support\"，宾语是 \"diversity mandates\"。接着是两个并列的介词短语 \"as a path to equality\" 和 \"and a way to level the playing field\"，用来说明主语支持宾语的原因或目的。\n\n4. **语法**:\n\n   句子使用了现在时态，表明进步派人士通常或习惯性地支持多元化的要求。\"as a path to\" 和 \"a way to\" 都是常用的表达方式，用来引导目的或结果。\n\n5. **知识点总结**:\n\n   - \"as a path to\" 和 \"a way to\" 是表达目的或结果的常用短语，后面通常跟名词或动名词。\n   - \"level the playing field\" 是一个常用的英语习语，意思是使竞争环境公平，没有人具有不公平的优势。\n\n6. **练习相似句子**:\n\n   \"Entrepreneurs often view innovation as a means to disrupt the market and a strategy to gain a competitive edge.\"\n\n   \"企业家们通常将创新视为打破市场常规和获得竞争优势的手段和策略。\""},{"text":"But all too often such policies are an insincere form of virtue-signaling that benefits only the most privileged and does little to help average people.","explainMd":"1. **翻译**:\n\n   \"但是，这类政策往往只是一种虚伪的道德标榜，只对最特权的人群有利，对普通人的帮助甚微。\"\n\n2. **词汇和短语**:\n\n   - But all too often: 但是往往\n   - such policies: 这类政策\n   - are an insincere form of: 是一种虚伪的\n   - virtue-signaling: 道德标榜\n   - that benefits only the most privileged: 只对最特权的人群有利\n   - and does little to help: 对...的帮助甚微\n   - average people: 普通人\n\n3. **句子结构**:\n\n   这是一个复合句。主句的主语是 \"such policies\"，谓语是 \"are\"，宾语是 \"an insincere form of virtue-signaling\"。然后有两个并列的关系从句 \"that benefits only the most privileged\" 和 \"and does little to help average people\"，用来进一步描述 \"such policies\"。\n\n4. **语法**:\n\n   句子使用了现在时态，表明这类政策通常的性质和结果。\"that\" 引导的是关系从句，用来修饰前面的名词 \"such policies\"。\n\n5. **知识点总结**:\n\n   - \"But all too often\" 是一个常用的短语，用来强调某种情况的频繁出现。\n   - \"that\" 可以引导关系从句，修饰前面的名词或代词，关系从句中的 \"that\" 可以作主语或宾语。\n   - \"virtue-signaling\" 是一个较为新的词汇，指通过公开表达或展示自己的道德立场或行为，以求得他人的认同或好感。\n\n6. **练习相似句子**:\n\n   \"However, such measures are merely superficial attempts at reform that only serve the interests of the elite and offer little assistance to the common people.\"\n\n   \"然而，这些措施只不过是改革的表面文章，只服务于精英的利益，对普通人民的帮助微乎其微。\""}]},{"sentences":[{"text":"A pair of bills sponsored by Massachusetts state Senator Jason Lewis and House Speaker Pro Tempore Patricia Haddad, to ensure “gender parity” on boards and commissions, provide a case in point.","explainMd":"1. **翻译**:\n\n   \"马萨诸塞州参议员 Jason Lewis 和众议院临时议长 Patricia Haddad 提出的一对法案，旨在确保董事会和委员会的“性别平等”，就是一个恰当的例证。\"\n\n2. **词汇和短语**:\n\n   - A pair of bills: 一对法案\n   - sponsored by: 由...提出\n   - Massachusetts state Senator Jason Lewis and House Speaker Pro Tempore Patricia Haddad: 马萨诸塞州参议员 Jason Lewis 和众议院临时议长 Patricia Haddad\n   - to ensure “gender parity” on boards and commissions: 旨在确保董事会和委员会的“性别平等”\n   - provide a case in point: 提供了一个恰当的例证\n\n3. **句子结构**:\n\n   这是一个复合句。主句的主语是 \"A pair of bills\"，谓语是 \"provide\"，宾语是 \"a case in point\"。然后它包含了一个状语从句 \"sponsored by Massachusetts state Senator Jason Lewis and House Speaker Pro Tempore Patricia Haddad, to ensure “gender parity” on boards and commissions\"，用来修饰 \"a pair of bills\"。\n\n4. **语法**:\n\n   句子使用了现在时态，表明这对法案现在提供了一个恰当的例证。\"sponsored by\" 是被动语态的结构，用来表示法案是由谁提出的。\n\n5. **知识点总结**:\n\n   - \"A pair of\" 是一个常用的量词短语，用来表达一对或一双的意思。\n   - \"sponsored by\" 是一个常用的被动语态结构，表明动作的执行者。\n   - \"provide a case in point\" 是一个常用的短语，表示提供了一个恰当或相关的例证。\n\n6. **练习相似句子**:\n\n   \"A recent policy proposed by New York Mayor John Smith, intending to enhance 'racial equality' in public schools, serves as a fitting example.\"\n\n   \"纽约市长 John Smith 提出的一项旨在提高公立学校'种族平等'的最新政策，就是一个恰当的例子。\""}]},{"sentences":[{"text":"Haddad and Lewis are concerned that more than half the state-government boards are less than 40 percent female.","explainMd":"1. **翻译**:\n\n   \"Haddad 和 Lewis 担忧的是，超过一半的州政府董事会的女性成员不到 40%。\"\n\n2. **词汇和短语**:\n\n   - Haddad and Lewis: Haddad 和 Lewis\n   - are concerned that: 担忧\n   - more than half the state-government boards: 超过一半的州政府董事会\n   - are less than 40 percent female: 女性成员不到 40%\n\n3. **句子结构**:\n\n   这是一个简单句。主语是 \"Haddad and Lewis\"，谓语是 \"are concerned\"，宾语是 \"that more than half the state-government boards are less than 40 percent female\"。其中，宾语部分是一个宾语从句，描述的是 Haddad 和 Lewis 所关心的内容。\n\n4. **语法**:\n\n   这个句子使用了现在进行时态，表示 Haddad 和 Lewis 目前的担忧。\"are concerned that\" 是一个常用的结构，用来表示某人担心某件事情。\n\n5. **知识点总结**:\n\n   - \"more than half\" 是一个常用的量词短语，用来描述数量超过一半。\n   - \"are less than\" 也是一个常见的描述比例的短语，表示“不到”。\n   - \"are concerned that\" 是一个表达担忧的常用结构。\n\n6. **练习相似句子**:\n\n   \"Parents are worried that less than 30 percent of school classes are taught by male teachers.\"\n\n   \"家长们担心不到 30% 的学校课程由男性教师教授。\""},{"text":"In order to ensure that elite women have more such opportunities, they have proposed imposing government quotas.","explainMd":"1. **翻译**:\n\n   \"为了确保精英女性有更多此类机会，他们提议施行政府配额。\"\n\n2. **词汇和短语**:\n\n   - In order to: 为了\n   - ensure: 确保\n   - elite women: 精英女性\n   - have more such opportunities: 有更多此类机会\n   - they have proposed: 他们已经提议\n   - imposing government quotas: 施行政府配额\n\n3. **句子结构**:\n\n   这是一个复杂句。主句是 \"they have proposed imposing government quotas\"，其中 \"imposing government quotas\" 是动名词短语作为宾语。\"In order to ensure that elite women have more such opportunities\" 是目的状语从句，描述提议施行政府配额的目的。\n\n4. **语法**:\n\n   该句使用了 \"in order to\" 引导的目的状语从句，表示目的或者原因。\"have proposed\" 是一个现在完成时，表示过去发生的动作对现在的影响。\n\n5. **知识点总结**:\n\n   - \"In order to\" 常用来引导目的状语从句。\n   - 动名词短语可以作为宾语。\n   - 现在完成时用来表示过去发生的动作对现在的影响。\n\n6. **练习相似句子**:\n\n   \"In order to provide more job opportunities for the unemployed, the government has proposed a job creation plan.\"\n\n   \"为了为失业者提供更多工作机会，政府已经提出了一个创造就业的计划。\""},{"text":"If the bills become law, state boards and commissions will be required to set aside 50 percent of board seats for women by 2022.","explainMd":"1. **翻译**:\n\n   \"如果这些法案成为法律，那么到2022年，州政府的董事会和委员会将被要求为女性预留50%的董事会席位。\"\n\n2. **词汇和短语**:\n\n   - If the bills become law: 如果这些法案成为法律\n   - state boards and commissions: 州政府的董事会和委员会\n   - will be required to: 将被要求\n   - set aside: 预留\n   - 50 percent of board seats: 50%的董事会席位\n   - for women: 为女性\n   - by 2022: 到2022年\n\n3. **句子结构**:\n\n   这是一个条件句。\"If the bills become law\" 是条件状语从句，描述的是法案成为法律的情况。主句是 \"state boards and commissions will be required to set aside 50 percent of board seats for women by 2022\"，描述的是如果法案成为法律，将会发生的事情。\n\n4. **语法**:\n\n   该句使用了一种常见的 \"if...then...\" 结构，其中 \"then\" 通常被省略。这是一种条件句的形式，用来描述如果某件事情发生，那么将会有什么结果。\"will be required to\" 表示将来要做的事情。\n\n5. **知识点总结**:\n\n   - \"If...then...\" 结构用于构建条件句。\n   - \"will be required to\" 用于表示将来要做的事情。\n   - \"set aside\" 是一个常用的短语，表示预留或者留出。\n\n6. **练习相似句子**:\n\n   \"If the policy is implemented, companies will be required to pay a minimum wage of $15 per hour by the end of the year.\"\n\n   \"如果这项政策得到实施，那么到年底，公司将被要求支付每小时至少15美元的最低工资。\""}]},{"sentences":[{"text":"The bills are similar to a measure recently adopted in Califomia, which last year became the first state to require gender quotas for private companies.","explainMd":"1. **翻译**:\n\n    \"这些法案与加利福尼亚州最近采纳的一项措施相似，该措施使得加利福尼亚州在去年成为第一个要求私营公司设定性别配额的州。\"\n\n2. **词汇和短语**:\n\n    - The bills: 这些法案\n    - are similar to: 与...相似\n    - a measure: 一项措施\n    - recently adopted: 最近采纳的\n    - in California: 在加利福尼亚州\n    - which last year became: 在去年成为\n    - the first state: 第一个州\n    - to require: 要求\n    - gender quotas: 性别配额\n    - for private companies: 对于私营公司\n\n3. **句子结构**:\n\n    这是一个比较复杂的句子，包含了一个主句和一个定语从句。主句是 \"The bills are similar to a measure recently adopted in California\"，而定语从句是 \"which last year became the first state to require gender quotas for private companies\"，用来修饰先行词 \"a measure\"。\n\n4. **语法**:\n\n    这个句子中，定语从句 \"which last year became the first state to require gender quotas for private companies\" 使用了关系代词 \"which\" 来引导，并且在这个从句中，\"became\" 是谓语动词，后面跟着的 \"the first state to require gender quotas for private companies\" 是宾语。\n\n5. **知识点总结**:\n\n    - 关系代词 \"which\" 可以用来引导定语从句，修饰先行词。\n    - \"become\" 是连接动词，后面通常跟名词、形容词、代词或者数词作表语。\n\n6. **练习相似句子**:\n\n    \"The initiatives are similar to a policy recently implemented in New York, which last month became the first city to mandate safe bike lanes.\"\n\n    \"这些倡议与纽约最近实施的一项政策相似，该政策使纽约在上个月成为第一个要求设立安全自行车道的城市。\""},{"text":"In signing the measure, California Governor Jerry Brown admitted that the law, which expressly classifies people on the basis of sex, is probably unconstitutional.","explainMd":"1. **翻译**:\n\n    \"在签署这项措施时，加利福尼亚州州长杰瑞·布朗承认，这项明确根据性别对人进行分类的法律，可能违反了宪法。\"\n\n2. **词汇和短语**:\n\n    - In signing the measure: 在签署这项措施时\n    - California Governor Jerry Brown: 加利福尼亚州州长杰瑞·布朗\n    - admitted: 承认\n    - that the law: 该法律\n    - which expressly classifies people on the basis of sex: 明确根据性别对人进行分类\n    - is probably unconstitutional: 可能违反了宪法\n\n3. **句子结构**:\n\n    这个句子的主体部分是 \"California Governor Jerry Brown admitted that the law is probably unconstitutional\"，其中含有一个宾语从句 \"that the law is probably unconstitutional\"。另外，宾语从句 \"that the law is probably unconstitutional\" 中的 \"the law\" 又被定语从句 \"which expressly classifies people on the basis of sex\" 进一步修饰。\n\n4. **语法**:\n\n    这个句子主要使用了宾语从句和定语从句的结构。宾语从句 \"that the law is probably unconstitutional\" 作为 \"admitted\" 的宾语，定语从句 \"which expressly classifies people on the basis of sex\" 使用了关系代词 \"which\" 来引导，并修饰 \"the law\"。\n\n5. **知识点总结**:\n\n    - 宾语从句通常用来作为动词或者介词的宾语，通常由关联词（如 that, if, whether 等）引导。\n    - 定语从句是用来修饰某个名词或者代词的从句，通常由关系代词（如 which, that, who, whom 等）或者关系副词（如 where, when, why 等）引导。\n\n6. **练习相似句子**:\n\n    \"In announcing the plan, the company CEO John Smith acknowledged that the strategy, which specifically targets young consumers, might be controversial.\"\n\n    \"在宣布这项计划时，公司首席执行官约翰·史密斯承认，这项明确针对年轻消费者的策略，可能会引起争议。\""}]},{"sentences":[{"text":"The US Supreme Court frowns on sex-based classifications unless they are designed to address an “important” policy interest, Because the California law applies to all boards, even where there is no history of prior discrimination, courts are likely to rule that the law violates the constitutional guarantee of “equal protection”.","explainMd":"**1. 翻译：**\n\n美国最高法院对基于性别的分类持质疑态度，除非它们是为了解决一个“重要”的政策问题。因为加利福尼亚的法律适用于所有董事会，即使在没有之前的歧视历史的情况下，法院可能会裁定该法律违反了宪法对“平等保护”的保障。\n\n**2. 词汇和短语：**\n\n- Frowns on: 质疑，反对\n- Sex-based classifications: 基于性别的分类\n- Policy interest: 政策问题\n- Applies to: 适用于，指向\n- Prior discrimination: 之前的歧视，过往的歧视\n- Violates: 违反\n- Constitutional guarantee: 宪法保障\n- Equal protection: 平等保护\n\n**3. 句子结构：**\n\n这是一个复杂句子，包含了两个主要部分，它们被连接词 \"Because\" 连接在一起。第一部分是关于美国最高法院对基于性别分类的看法，第二部分是关于加利福尼亚法律可能违反宪法“平等保护”原则的预测。\n\n**4. 语法：**\n\n这个句子主要使用的是现在时态，同时它使用了连词 \"unless\" 和 \"because\" 来连接子句。\"Unless\" 子句表达了一个条件，\"because\" 子句则提供了一个原因。\n\n**5. 知识点总结：**\n\n- “Frowns on” 是一个常见的表达，表示对某事持质疑或反对的态度。\n- “Unless” 和 “Because” 是用于连接子句的常见连词，分别表示条件和原因。\n- “Equal protection” 是美国宪法中的重要概念，意为所有公民在法律面前享有平等的权利和保护。\n\n**6. 练习相似句子：**\n\n> \"The school administration frowns on bullying unless it is addressed with an effective anti-bullying policy. Because this policy applies to all students, even where there is no history of prior bullying, the school is likely to provide a safer environment for everyone.\"\n\n\"学校管理层对校园欺凌持质疑态度，除非采取有效的反欺凌政策。因为这项政策适用于所有学生，即使在没有之前欺凌历史的情况下，学校可能为所有人提供一个更安全的环境。\""}]},{"sentences":[{"text":"But are such government mandates even necessary?","explainMd":"**1. 翻译：**\n\n这些政府规定真的有必要吗？\n\n**2. 词汇和短语：**\n\n- mandates: 规定，指令\n- necessary: 必要的\n\n**3. 句子结构：**\n\n这是一个简单的疑问句，以\"but\"开始，表达了对某种观点的质疑或疑问。其句子结构为：“连词 + 主语 + 谓语 + 表语 + 结束符”。\n\n**4. 语法：**\n\n这个句子使用了现在时态，并使用了疑问句的语法结构。在英语中，疑问句通常通过改变词序或添加助动词或疑问词来构造。\n\n**5. 知识点总结：**\n\n- “Mandates”通常指政府或权威机构的规定或命令。\n- “Necessary”是一个常见的形容词，表示某事必要或重要。\n- “But” 在这里是一个转折连词，用来引出一个对前面内容的反问或质疑。\n\n**6. 练习相似句子(英文加中文翻译，一句)：**\n\n> \"But are these strict regulations really necessary?\"\n\n但是，这些严格的规定真的有必要吗？"},{"text":"Female participation on corporate boards may not currently mirror the percentage of women in the general population, but so what?","explainMd":"**1. 翻译：**\n\n女性在公司董事会上的参与可能并不完全反映出总人口中女性的比例，但这又有什么关系呢？\n\n**2. 词汇和短语：**\n\n- Female participation: 女性参与\n- Corporate boards: 公司董事会\n- Mirror: 反映，映射\n- The general population: 总人口\n- So what: 那又怎样\n\n**3. 句子结构：**\n\n这是一个复合句。其主要结构是：“主语 + 谓语 + 宾语，连词 + 疑问词 + 结束符”。\n\n**4. 语法：**\n\n这个句子的语法结构相对简单，主句使用了现在时态。然后通过逗号和连词 \"but\" 连接一个简短的疑问句，用以表达对前述观点的质疑或挑战。\n\n**5. 知识点总结：**\n\n- “Female participation” 和 “corporate boards” 这两个词组在商业和政策讨论中常常出现，分别表示 \"女性的参与\" 和 \"公司董事会\"。\n- “Mirror” 在此处作为动词使用，表示 \"反映\" 或 \"映射\" 的意思。\n- “So what” 是一个口语表达，用来表达不在乎，或质疑某事的重要性。\n\n**6. 练习相似句子(英文加中文翻译，一句)：**\n\n> \"Student performance may not currently mirror the quality of our education system, but so what?\"\n\n学生的表现可能并不能完全反映我们的教育系统的质量，但那又有什么关系呢？"},{"text":"The number of women on corporate boards has been steadily increasing without government interference.","explainMd":"**1. 翻译：**\n\n没有政府干预，公司董事会上的女性人数一直在稳步增长。\n\n**2. 词汇和短语：**\n\n- The number of women: 女性人数\n- Corporate boards: 公司董事会\n- Steadily increasing: 稳步增长\n- Without government interference: 没有政府干预\n\n**3. 句子结构：**\n\n这是一个简单句，其主要结构为：“主语 + 谓语 + 状语 + 结束符”。\n\n**4. 语法：**\n\n这个句子的语法结构简洁，使用了现在进行时。主语 \"The number of women on corporate boards\" 是一个名词短语，谓语 \"has been steadily increasing\" 是现在完成进行时态，表达了一个持续发生的动作或状态。状语 \"without government interference\" 是一个介词短语，用来描述这个动作在没有政府干预的情况下发生。\n\n**5. 知识点总结：**\n\n- “The number of women” 和 “corporate boards” 这两个词组在商业和政策讨论中常常出现，分别表示 \"女性人数\" 和 \"公司董事会\"。\n- “Steadily increasing” 是一个常用词组，表示某者在持续稳定地增长。\n- “Without government interference” 是一个介词短语，表示在没有政府干预的情况下。\n\n**6. 练习相似句子(英文加中文翻译，一句)：**\n\n> \"The use of renewable energy has been steadily increasing without significant policy support.\"\n\n没有显著的政策支持，可再生能源的使用一直在稳步增长。"},{"text":"According to a study by Catalyst, between 2010 and 2015 the share of women on the boards of global corporations increased by 54 percent.","explainMd":"**1. 翻译：**\n\n根据Catalyst的研究，2010年至2015年间，全球公司董事会的女性份额增加了54%。\n\n**2. 词汇和短语：**\n\n- Catalyst：Catalyst，一个专门研究女性在职场中的问题的非盈利组织。\n- The share of women：女性的份额，这里指的是董事会中女性的比例。\n- Increased by：增加了，用于表示增长的比例。\n\n**3. 句子结构：**\n\n这个句子的结构可以分为以下几部分：\n\n- 状语：According to a study by Catalyst\n- 时间状语：Between 2010 and 2015\n- 主语：The share of women on the boards of global corporations\n- 谓语：increased\n- 宾语：by 54 percent\n\n整个句子呈现出一个 \"状语 + 时间状语 + 主语 + 谓语 + 宾语\" 的结构。\n\n**4. 语法：**\n\n这个句子使用了过去时态，表示在过去的一段时间（2010年至2015年）内，全球公司董事会的女性份额有所增加。在这里，\"increased by 54 percent\" 是一个动词短语，用于表示主语（女性的份额）的变化情况。\n\n**5. 知识点总结：**\n\n- 研究引用的表示方式：\"According to a study by Catalyst\"，用于引述研究的来源。\n- 表示变化的构造：\"increased by 54 percent\"，用于描述某个指标的增长情况。\n- 时间状语的使用：\"Between 2010 and 2015\"，用于限定事件发生的时间范围。\n\n**6. 练习相似句子(英文加中文翻译，一句)：**\n\n> \"According to a survey by UNICEF, the rate of child malnutrition decreased by 20% between 2005 and 2010.\"\n\n根据联合国儿童基金会的一项调查，2005年至2010年间，儿童营养不良的比率下降了20%。"}]},{"sentences":[{"text":"Requiring companies to make gender the primary qualification for board membership will inevitably lead to less experienced private sector boards.","explainMd":"**1. 翻译：**\n\n要求公司以性别作为董事会成员资格的主要条件，必然会导致私营部门董事会的经验不足。\n\n**2. 词汇和短语：**\n\n- Requiring: 要求，指示必须做某事。\n- Companies: 公司，进行商业交易的组织或公司。\n- Gender: 性别，男性或女性。\n- Primary qualification: 主要条件，最重要的标准或要求。\n- Board membership: 董事会成员资格，指的是成为一个组织或公司董事会的成员的资格。\n- Inevitably: 必然地，无法避免的。\n- Less experienced: 经验不足的，缺乏经验或熟悉的。\n- Private sector boards: 私营部门董事会，非公共部门，如政府或非营利组织的公司或组织的决策机构。\n\n**3. 句子结构：**\n\n这个句子的结构可以分为以下几部分：\n\n- 主语：Requiring companies to make gender the primary qualification for board membership\n- 谓语：will inevitably lead to\n- 宾语：less experienced private sector boards\n\n整个句子的结构为 \"主语 + 谓语 + 宾语\"。\n\n**4. 语法：**\n\n这个句子使用了简单的未来时态（will），表示预测或确定将要发生的情况。主语部分使用了动词的现在分词形式（Requiring），形成复合结构来描述主体（companies）的行为。\n\n**5. 知识点总结：**\n\n- \"Requiring\" 的用法：在这个句子中，\"Requiring\" 用作现在分词，作为主句的主语，表示某种要求或规定。\n- \"Inevitably\" 的用法：这个副词用来强调某件事情肯定会发生，常用于表达预测或未来的情况。\n- \"Less experienced\" 的用法：这是一个比较级的形容词短语，用来描述“经验不足的”或“经验较少的”。\n\n**6. 练习相似句子(英文加中文翻译，一句)：**\n\n> \"Insisting schools to make grades the primary criteria for admission will inevitably lead to less diverse student bodies.\"\n\n坚持让学校把成绩作为录取的主要标准，必然会导致学生群体的多样性降低。"},{"text":"That is exactly what happened when Norway adopted a nationwide corporate gender quota.","explainMd":"**1. 翻译：**\n\n这正是挪威全国实施企业性别配额时发生的情况。\n\n**2. 词汇和短语：**\n\n- That is exactly what happened: 这正是发生的情况，表示对某个情况的确认或强调。\n- When: 当...时候，表示在某个时间点或某种情况下。\n- Norway: 挪威，一个欧洲北部的国家。\n- Adopted: 实施，采用，表示接受并开始使用某种政策或方法。\n- Nationwide: 全国的，全国范围内的。\n- Corporate gender quota: 企业性别配额，政策或规定，要求公司的董事会或其他领导岗位上的性别比例达到一定标准。\n\n**3. 句子结构：**\n\n这个句子的结构可以分为以下几部分：\n\n- 主语：That\n- 谓语：is exactly what happened\n- 定语从句：when Norway adopted a nationwide corporate gender quota\n\n整个句子的结构为 \"主语 + 谓语 + 定语从句\"。\n\n**4. 语法：**\n\n这个句子使用了简单的一般过去时态（happened），表示过去发生的事情。定语从句用的是when引导的时间状语从句。\n\n**5. 知识点总结：**\n\n- \"That is exactly what happened\"的用法：这是一个强调句型，用来强调某个事实或情况确实发生过。\n- \"When\"的用法：在这个句子中，\"when\"用作引导时间状语从句的连词，表示在某个时间点或某种情况下发生的情况。\n- \"Adopted\"的用法：这个词通常用来表示接受并开始使用某种政策或方法。\n\n**6. 练习相似句子(英文加中文翻译，一句)：**\n\n> \"That is exactly what happened when France implemented a nationwide recycling program.\"\n\n这正是法国全国实施回收计划时发生的情况。"}]},{"sentences":[{"text":"Writing in The New Republic, Alice Lee notes that increasing the number of opportunities for board membership without increasing the pool of qualified women to serve on such boards has led to a “golden skirt” phenomenon, where the same elite women scoop up multiple seats on a variety of boards.","explainMd":"**1. 翻译：**\n\n在《新共和国》中写作的Alice Lee指出，增加董事会成员的机会而不增加有资格在这些董事会服务的女性数量，导致了“金裙子”现象，即同样的精英女性在各种董事会上占据多个席位。\n\n**2. 词汇和短语：**\n\n- Writing in The New Republic: 在《新共和国》中写作，这里表示Alice Lee在某个媒体（《新共和国》）上发表了她的观点。\n- Notes: 指出，表示Alice Lee在她的文章中表达了某项观察或观点。\n- Increasing the number of opportunities for board membership: 增加董事会成员的机会。\n- Without increasing the pool of qualified women: 而没有增加有资格的女性的数量。\n- Golden skirt phenomenon: \"金裙子\"现象，这是一个比喻，指的是少数精英女性在多个董事会上占据席位。\n- Scoop up: 拿走，获取，这里表示在董事会席位上占据优势。\n\n**3. 句子结构：**\n\n该句子的结构可以分为以下部分：\n\n- 主句：Alice Lee notes\n- 宾语从句：that increasing the number of opportunities for board membership without increasing the pool of qualified women to serve on such boards has led to a “golden skirt” phenomenon\n- 定语从句：where the same elite women scoop up multiple seats on a variety of boards\n\n整个句子的结构为 \"主句 + 宾语从句 + 定语从句\"。\n\n**4. 语法：**\n\n这个句子使用了现在时态，表示Alice Lee的观察或观点是一种持续的状态。同时，句子中的宾语从句和定语从句也是该句子的重要语法内容。\n\n**5. 知识点总结：**\n\n- \"Writing in X\"的用法：这是一个常见的表达方式，表示在某个媒体或平台上发表观点或文章。\n- \"Notes\"的用法：此处用于表示作者在文章中表达的观点。\n- \"Increasing the number of opportunities for X without increasing Y\" 的结构：这是一个常见的表达方式，用来比较两个并行的概念或事物。\n\n**6. 练习相似句子(英文加中文翻译，一句)：**\n\n> \"Writing in The New York Times, John Smith notes that increasing the number of electric cars without increasing the number of charging stations has led to a 'charging crisis', where the same few charging stations are congested with numerous cars.\"\n\n约翰·史密斯在《纽约时报》上写道，增加电动汽车的数量而不增加充电站的数量导致了“充电危机”，即同样少数的充电站被众多汽车拥挤。"}]},{"sentences":[{"text":"Next time somebody pushes corporate quotas as a way to promote gender equity, remember that such policies are largely self-serving measures that make their sponsors feelgood but do little to help average women.","explainMd":"**1. 翻译：**\n\n下次有人推动企业配额作为促进性别平等的手段时，记得这些政策大多是自我服务的举措，让发起人感觉良好，但对普通女性的帮助不大。\n\n**2. 词汇和短语：**\n\n- Pushes: 推动，这里指某人正在积极倡导或推进某项政策或观念。\n- Corporate quotas: 企业配额，指在企业的决策层面（如董事会）对性别、种族等进行的一种强制性分配。\n- Promote: 促进，表示增强或改善某种状态或条件。\n- Gender equity: 性别平等，指男性和女性在社会、经济、政治等方面享有平等的权利和机会。\n- Self-serving: 自我服务的，表示行为或决策主要以满足自身利益为目的。\n- Feel good: 感觉良好，这里指政策的发起人因为推动这项政策而感到自我满足。\n\n**3. 句子结构：**\n\n该句子的主要结构可以分为以下部分：\n\n- 主句：Next time somebody pushes corporate quotas as a way to promote gender equity\n- 并列句：remember that such policies are largely self-serving measures and do little to help average women\n\n整个句子的结构为 \"主句 + 并列句\"。\n\n**4. 语法：**\n\n这个句子使用了现在时态，表示一种通常或经常的情况。同时，句子中的并列句也是该句子的重要语法内容。\n\n**5. 知识点总结：**\n\n- \"Pushes\"的用法：此处用于表示某人正在积极倡导或推进某项政策或观念。\n- \"Corporate quotas\"的含义：在企业的决策层面（如董事会）对性别、种族等进行的一种强制性分配。\n- \"Self-serving\"的含义：表示行为或决策主要以满足自身利益为目的。\n\n**6. 练习相似句子(英文加中文翻译，一句)：**\n\n> \"Next time somebody pushes tax cuts as a way to stimulate the economy, remember that such policies largely benefit the wealthy and do little to assist low-income individuals.\"\n\n下次有人推动减税作为刺激经济的手段时，记住这些政策大多数只对富人有利，对低收入人士的帮助不大。"}]}],"title":""}