{"translate":"","paragraphs":[{"sentences":[{"text":"Rats and other animals need to be highly attuned to social signals from others so they can identify friends to cooperate with and enemies to avoid.To find out if this extends to non-living beings, Laleh Quinn at the University of California, San Diego, and her colleagues tested whether rats can detect social signals from robotic rats.","explainMd":"**1. 翻译：**\n\n\"老鼠和其他动物需要高度敏感于他人的社交信号，这样他们才能识别出需要与之合作的朋友和需要避免的敌人。为了探究这是否延伸到非生物体，加利福尼亚大学圣地亚哥分校的Laleh Quinn和她的同事们测试了老鼠是否能检测到机器鼠的社交信号。\"\n\n**2. 重难点词汇和短语：**\n\n- **Attuned to**：适应，对...敏感\n- **Social signals**：社交信号\n- **Cooperate with**：与...合作\n- **Enemies to avoid**：需要避开的敌人\n- **Extends to**：扩展到\n- **Non-living beings**：非生物\n- **Detect**：检测\n\n**3. 句子结构：**\n\n\"Rats and other animals need to be highly attuned to social signals from others so they can identify friends to cooperate with and enemies to avoid.\"\n\n这个句子的主干是\"Rats and other animals need to be highly attuned to social signals from others.\"，其中\"so they can identify friends to cooperate with and enemies to avoid.\"是结果状语从句，解释了为什么他们需要对社交信号高度敏感。\n\n**4. 语法：**\n\n本句中使用了模态动词\"need to\"来表达必要性。\"so...that...\" 结构用来表示结果。\"identify\"后跟两个并列的宾语短语，\"friends to cooperate with\"和\"enemies to avoid\"，其中使用了\"to+动词原形\"结构表示目的。\n\n**5. 知识点总结：**\n\n1. 模态动词\"need to\"的使用。\n1. \"so...that...\" 结构的使用，表示结果。\n1. \"to+动词原形\"结构的使用，表示目的。\n1. \"and\"用以连接并列结构。\n\n**6. 相似句子练习：**\n\n\"Children need to be highly aware of the rules so they can identify what is right to do and what is wrong to avoid.\"\n\n\"儿童需要高度了解规则，这样他们才能识别出哪些是正确的行为，哪些是需要避免的错误行为。\""}]},{"sentences":[{"text":"They housed eight adult rats with two types of robotic rat—one social and one asocial—for four days.The robot rats were quite minimalist, resembling a chunkier version of a computer mouse with wheels-to move around and colorful markings.","explainMd":"**1. 翻译：**\n\n\"他们把八只成年老鼠与两种类型的机器鼠——一种社交型，一种非社交型——一起饲养了四天。机器鼠设计得相当简约，类似于一个更胖一些的带轮子的电脑鼠标，可以四处移动，上面有丰富的色彩标记。\"\n\n**2. 重难点词汇和短语：**\n\n- **Housed**：饲养，安置\n- **Robotic rat**：机器鼠\n- **Social**：社交型的\n- **Asocial**：非社交型的\n- **Minimalist**：简约的\n- **Resembling**：类似于\n- **Chunkier version**：更胖的版本\n- **Markings**：标记\n\n**3. 句子结构：**\n\n\"They housed eight adult rats with two types of robotic rat—one social and one asocial—for four days.\"\n\n这个句子的主干是\"They housed eight adult rats with two types of robotic rat for four days.\"，其中\"one social and one asocial\"是对“two types of robotic rat”的详细解释。后半句\"The robot rats were quite minimalist, resembling a chunkier version of a computer mouse with wheels-to move around and colorful markings.\"是对前半句的进一步解释和补充。\n\n**4. 语法：**\n\n本句中使用了一般过去时的被动语态\"were housed\"，表示过去的动作。同时使用了现在分词\"resembling\"作为描述形容词，用来描述机器鼠的样子。\n\n**5. 知识点总结：**\n\n1. 一般过去时的被动语态的使用。\n1. 现在分词作为形容词的使用，描述事物的特征和状态。\n1. 并列结构“one... and one...”的使用，描述两种不同的类型。\n\n**6. 相似句子练习：**\n\n\"They planted two types of flowers—one red and one blue—in the garden for a whole summer. The flowers were quite beautiful, resembling a vibrant palette with petals to add colors and delightful scents.\"\n\n\"他们在花园里种了两种花——一种红色，一种蓝色——整个夏天。这些花非常美丽，像一个充满活力的调色盘，用花瓣增添色彩和愉快的香气。\""}]},{"sentences":[{"text":"During the experiment, the social robot rat followed the living rats around,  played with the same toys, and opened cage doors to let trapped rats escape.","explainMd":"**1. 翻译：**\n\n\"在实验过程中，社交型机器鼠跟随生物鼠在周围活动，玩同样的玩具，还会打开笼子门让被困的鼠逃出来。\"\n\n**2. 重难点词汇和短语：**\n\n- **Experiment**: 实验\n- **Social robot rat**: 社交型机器鼠\n- **Followed around**: 在周围跟随\n- **Played with the same toys**: 玩同样的玩具\n- **Opened cage doors**: 打开笼子门\n- **Trapped rats escape**: 让被困的鼠逃出来\n\n**3. 句子结构：**\n\n\"During the experiment, the social robot rat followed the living rats around, played with the same toys, and opened cage doors to let trapped rats escape.\"\n\n这个句子是一个复合句，主干是\"the social robot rat followed the living rats around, played with the same toys, and opened cage doors\"，而\"During the experiment\"是时间状语，\"to let trapped rats escape\"是目的状语。\n\n**4. 语法：**\n\n这个句子使用了一般过去时，表明实验中机器鼠的行为都发生在过去。此外，\"to let trapped rats escape\"中的\"to\"是一个不定式符号，用来表示目的。\n\n**5. 知识点总结：**\n\n1. 使用一般过去时描述过去的行为或状态。\n1. 使用不定式表示目的。\n1. 使用逗号分隔并列的动作。\n\n**6. 相似句子练习：**\n\n\"During the party, the little boy followed his mother around, played with the same toys as his friends, and opened doors to let trapped pets out.\"\n\n\"在派对期间，小男孩跟随他的母亲在周围活动，和他的朋友们玩同样的玩具，还打开门让被困的宠物出去。\""},{"text":"Meanwhile, the asocial robot simply moved forwards and backwards and side to side.","explainMd":"**1. 翻译：**\n\n\"与此同时，非社交型的机器鼠只是简单地前后左右移动。\"\n\n**2. 重难点词汇和短语：**\n\n- **Meanwhile**: 与此同时\n- **Asocial robot**: 非社交型的机器鼠\n- **Simply**: 简单地\n- **Moved forwards and backwards and side to side**: 前后左右移动\n\n**3. 句子结构：**\n\n\"Meanwhile, the asocial robot simply moved forwards and backwards and side to side.\"\n\n这是一个简单句，主干是\"the asocial robot simply moved forwards and backwards and side to side\"，而\"Meanwhile\"是时间状语。\n\n**4. 语法：**\n\n这个句子使用了一般过去时，说明非社交型的机器鼠的行为发生在过去。同时，\"and\"被用来连接并列的动词短语。\n\n**5. 知识点总结：**\n\n1. 使用一般过去时描述过去的行为或状态。\n1. 使用\"and\"连接并列的动词短语。\n1. 使用副词\"simply\"来修饰动词，强调动作的简单性。\n\n**6. 相似句子练习：**\n\n\"Meanwhile, the shy child simply moved closer to his mother and held her hand.\"\n\n\"与此同时，害羞的小孩只是简单地靠近他的母亲，并抓住了她的手。\""}]},{"sentences":[{"text":"Next, the researchers trapped the robots in cages and gave  the  rats  the  opportunity to release them by pressing a lever.Across 18 trials each, the living rats were 52 per  cent more likely on average to set the social robot free than the asocial  one.","explainMd":"**1. 翻译：**\n\n\"接下来，研究人员将机器鼠困在笼子中，并给予活鼠通过按动杆子释放它们的机会。在每个活鼠进行的18次试验中，平均来看，活鼠有52%的可能性更倾向于释放社交型的机器鼠，而不是非社交型的机器鼠。\"\n\n**2. 重难点词汇和短语：**\n\n- **Next**: 接下来\n- **Researchers**: 研究人员\n- **Trapped**: 困住\n- **Robots in cages**: 笼子中的机器鼠\n- **Opportunity**: 机会\n- **Release them**: 释放它们\n- **Pressing a lever**: 按动杆子\n- **Across 18 trials each**: 在每个活鼠进行的18次试验中\n- **More likely on average**: 平均来看，更有可能\n- **Set the social robot free**: 释放社交型的机器鼠\n\n**3. 句子结构：**\n\n这是一个复合句，由两个主句和一个副词短语组成。副词短语\"Across 18 trials each\" 描述了主句 \"the living rats were 52 per cent more likely on average to set the social robot free than the asocial one\"的详细情况。\n\n**4. 语法：**\n\n此句使用了一般过去时态来描述过去的行为或状态。同时，使用了比较级\"more likely\"来比较活鼠释放两种机器鼠的可能性。\n\n**5. 知识点总结：**\n\n1. 使用一般过去时态描述过去的行为或状态。\n1. 使用副词短语来描述主句的详细情况。\n1. 使用比较级来进行比较。\n\n**6. 相似句子练习：**\n\n\"Next, the teachers gave the students the opportunity to answer the question by raising their hands. Across 10 classes each, the boys were 30 per cent more likely on average to raise their hands than the girls.\"\n\n\"接下来，老师们给了学生们举手回答问题的机会。在每个班级进行的10次课中，平均来看，男生举手回答问题的可能性比女生高30%。\""},{"text":"This suggests that the rats perceived the social robot as a genuine social being,  says Quinn.","explainMd":"**1. 翻译：**\n\n\"这表明，这些鼠类将社交型的机器鼠视为真正的社交生物，\"奎因说。\n\n**2. 重难点词汇和短语：**\n\n- **This suggests**: 这表明\n- **The rats**: 这些鼠类\n- **Perceived**: 视为\n- **The social robot**: 社交型的机器鼠\n- **As a genuine social being**: 作为真正的社交生物\n- **Says Quinn**: 奎因说\n\n**3. 句子结构：**\n\n这是一个简单句，由主语（This），谓语（suggests），宾语（that the rats perceived the social robot as a genuine social being），以及定语从句（says Quinn）组成。\n\n**4. 语法：**\n\n句子使用了一般现在时态来表述一般的事实或观点。同时，使用了\"as\"来作为介词，表明鼠类将机器鼠视为何种角色。\n\n**5. 知识点总结：**\n\n1. 使用一般现在时态来表述一般的事实或观点。\n1. \"as\"作为介词，用于表达角色或状态。\n1. 使用引述语（says Quinn）来明确表述的来源。\n\n**6. 相似句子练习：**\n\n\"This suggests that the children regarded the new teacher as a role model,\" says Principal Smith.\n\n\"这表明，孩子们将新老师视为榜样，\"校长史密斯说。"},{"text":"The rats may have bonded more with the  social  robot  because it displayed behaviors like communal exploring and playing.","explainMd":"**1. 翻译：**\n\n\"鼠类可能更加与社交型的机器鼠建立了紧密的关系，因为它表现出了像是集体探索和玩耍的行为。\"\n\n**2. 重难点词汇和短语：**\n\n- **The rats**: 鼠类\n- **May have bonded more with**: 可能更加与...建立了紧密的关系\n- **The social robot**: 社交型的机器鼠\n- **Because it displayed behaviors**: 因为它表现出了行为\n- **Like communal exploring and playing**: 像是集体探索和玩耍\n\n**3. 句子结构：**\n\n这是一个复合句，由主句（The rats may have bonded more with the social robot）和宾语从句（because it displayed behaviors like communal exploring and playing）构成。\n\n**4. 语法：**\n\n句子使用了虚拟语气（may have bonded）来表述可能的情况。同时，\"because\"作为连词，引导原因状语从句，解释为什么鼠类与社交机器鼠更加建立了紧密的关系。\n\n**5. 知识点总结：**\n\n1. 使用虚拟语气来表述可能的情况。\n1. \"because\"作为连词，引导原因状语从句。\n1. \"like\"作为介词，引导比喻，表明机器鼠的行为类似于什么。\n\n**6. 相似句子练习：**\n\n\"The students may have learned more with the new teacher because she used methods like interactive games and group discussions.\"\n\n\"学生们可能更加从新教师那里学到了更多，因为她使用了像是互动游戏和小组讨论的方法。\""}]},{"sentences":[{"text":"This could lead to the rats better remembering having freed it earlier, and wanting the robot to return the favour when they get trapped, she says .","explainMd":"**1. 翻译：**\n\n\"这可能使得老鼠更好地记住它们之前释放过机器鼠，当它们被困住的时候，希望机器鼠能回报他们的好意。\"\n\n**2. 重难点词汇和短语：**\n\n- **This could lead to**: 这可能会导致\n- **The rats better remembering having freed it earlier**: 老鼠更好地记住它们之前释放过机器鼠\n- **And wanting the robot to return the favour**: 并且希望机器鼠能回报他们的好意\n- **When they get trapped**: 当它们被困住的时候\n\n**3. 句子结构：**\n\n这是一个复杂句子，由两个并列的主句构成，即 \"This could lead to the rats better remembering having freed it earlier\" 和 \"wanting the robot to return the favour when they get trapped\"。\n\n**4. 语法：**\n\n1. 句子使用了情态动词 \"could\" 来表明可能性。\n1. 使用了现在分词结构 \"remembering having freed\" 来表述连续的动作。\n1. \"when\" 引导的时间状语从句描述了希望机器鼠回报好意的具体时机。\n\n**5. 知识点总结：**\n\n1. 使用情态动词来表达可能性。\n1. 现在分词结构可以用来表述连续的动作。\n1. \"when\" 可以引导时间状语从句，描述动作发生的时间。\n\n**6. 相似句子练习：**\n\n\"This could lead to students better understanding the lesson and wanting the teacher to give more examples when they get confused.\"\n\n\"这可能会让学生更好地理解课程，并且在他们感到困惑的时候，希望老师能给出更多的例子。\""}]},{"sentences":[{"text":"“Rats have been shown to engage in multiple forms of reciprocal help and cooperation, including what is referred to as direct reciprocity where a rat will help another rat that has previously helped them,” says Quinn.","explainMd":"**1. 翻译：**\n\n\"已经证明，老鼠会表现出多种形式的互助和合作，包括所谓的直接互惠原则，即一只老鼠会帮助另一只曾经帮助过它的老鼠。\" - 奎因说。\n\n**2. 重难点词汇和短语：**\n\n- **Rats have been shown to engage in**: 已经证明，老鼠会参与\n- **Multiple forms of reciprocal help and cooperation**: 多种形式的互助和合作\n- **including what is referred to as direct reciprocity**: 包括所谓的直接互惠原则\n- **where a rat will help another rat that has previously helped them**: 一只老鼠会帮助另一只曾经帮助过它的老鼠\n\n**3. 句子结构：**\n\n这是一个复杂句子，包含一个主句(\"Rats have been shown to engage in multiple forms of reciprocal help and cooperation\")，和一个由\"including\"引导的非限制性定语从句，定语从句中还包含一个由\"where\"引导的地点状语从句。\n\n**4. 语法：**\n\n1. 句子使用了现在完成时态 \"have been shown to\" 来表达过去发生的事情对现在的影响。\n1. \"including\" 为介词，引导非限制性定语从句。\n1. \"where\" 用于引导地点状语从句，描述了直接互惠原则的具体场景。\n\n**5. 知识点总结：**\n\n1. 现在完成时态可以用来表达过去的事情对现在的影响。\n1. \"including\" 可以用来引导非限制性定语从句。\n1. \"where\" 可以引导地点状语从句，描述地点或者场景。\n\n**6. 相似句子练习：**\n\n\"Dogs have been shown to demonstrate multiple forms of emotional responses, including what is referred to as empathy, where a dog will comfort another dog that has shown signs of distress.\" - Smith says.\n\n\"已经证明，狗会表现出多种形式的情绪反应，包括所谓的共情，即一只狗会安慰另一只显示出困扰迹象的狗。\" - 史密斯说。"}]},{"sentences":[{"text":"The readiness of the rats to befriend the social robot was surprising given its minimal design.The robot was the same size as a regular rat but resembled a simple plastic box on wheels.","explainMd":"**1. 翻译：**\n\n\"考虑到机器鼠的简单设计，老鼠愿意和社交性的机器鼠交朋友的情况令人惊讶。这个机器鼠和普通鼠一样大，但看起来像一个装有轮子的简单塑料盒子。\"\n\n**2. 重难点词汇和短语：**\n\n- **The readiness of the rats to befriend the social robot**: 老鼠愿意和社交性的机器鼠交朋友的情况\n- **was surprising given its minimal design**: 考虑到其简单的设计，这是令人惊讶的\n- **resembled a simple plastic box on wheels**: 看起来像一个装有轮子的简单塑料盒子\n\n**3. 句子结构：**\n\n这是一种包含两个主要子句的复合句子。第一个子句是 \"The readiness of the rats to befriend the social robot was surprising given its minimal design\"，第二个子句是 \"The robot was the same size as a regular rat but resembled a simple plastic box on wheels.\"\n\n**4. 语法：**\n\n1. \"The readiness of the rats to befriend the social robot\" 是一个名词短语，其中的 \"to befriend the social robot\" 为不定式作定语，修饰 \"readiness\"。\n1. \"given its minimal design\" 是一个过去分词短语，作状语，表示原因。\n1. \"was the same size as a regular rat but resembled a simple plastic box on wheels\" 是一个并列句，连接了两个子句。\n\n**5. 知识点总结：**\n\n1. 不定式可以作定语，修饰名词。\n1. 过去分词短语可以作状语，表示原因。\n1. 并列句可以用来连接两个或更多的子句。\n\n**6. 相似句子练习：**\n\n\"The eagerness of the kids to play with the toy car was unexpected considering its simple design. The toy car was the same size as a regular toy car but looked like a small wooden block on wheels.\"\n\n\"考虑到玩具车的简单设计，孩子们急切想要与玩具车玩耍的情况是出乎意料的。这个玩具车和普通的玩具车一样大，但看起来像一个装有轮子的小木块。\""},{"text":"“ We’d assumed we’d have to give it a moving head and tail, facial features, and put a scent on it to make it smell like a real rat, but that wasn’t necessary,”says Janet Wiles at the University of Queensland in Australia, who helped with the research.","explainMd":"**1. 翻译:**\n\n\"我们原本以为我们需要给它一个会动的头和尾巴，面部特征，并且让它散发出真正的鼠类气味，但实际上这并不必要,\" 这是澳大利亚昆士兰大学的Janet Wiles说的，她参与了这项研究。\n\n**2. 重难点词汇和短语:**\n\n- **We'd assumed**: 我们原本以为\n- **give it a moving head and tail, facial features, and put a scent on it**: 给它一个会动的头和尾巴，面部特征，并且让它散发出鼠类的气味\n- **that wasn't necessary**: 这并不必要\n\n**3. 句子结构:**\n\n这是一个复合句，主句是\"We'd assumed we'd have to give it a moving head and tail, facial features, and put a scent on it\"，但是有一个并列的转折句\"that wasn't necessary\"。\n\n**4. 语法:**\n\n1. \"We'd assumed\"是一个包含过去完成时的句子，表示对过去的假设。\n1. \"give it a moving head and tail, facial features, and put a scent on it\"，这是一个并列结构，列举了原本计划中的多项操作。\n1. \"that wasn't necessary\"，这个是一个简单句，用that引导的并列句，表示转折。\n\n**5. 知识点总结:**\n\n1. 过去完成时可以用来表示对过去的假设。\n1. 并列结构可以用来列举多项操作或者物品。\n1. “that”可以用来引导并列句，表示转折。\n\n**6. 相似句子练习:**\n\n\"We'd assumed we'd have to install a new system, train the staff, and upgrade the hardware, but that wasn't necessary,\" says John Smith, the project manager.\n\n\"我们原本以为我们需要安装一个新系统，培训员工，并升级硬件，但实际上这并不必要,\" 这是项目经理约翰·史密斯说的。"}]},{"sentences":[{"text":"The finding shows how sensitive rats are to social cues, even when they come from basic robots.","explainMd":"**1. 翻译:**\n\n这个发现显示，即使是来自基础机器人的，老鼠对社交信号也十分敏感。\n\n**2. 重难点词汇和短语:**\n\n- **The finding**: 这个发现\n- **shows**: 显示\n- **how sensitive rats are**: 老鼠有多敏感\n- **to social cues**: 对于社交信号\n- **even when they come from basic robots**: 即使它们来自基础的机器人\n\n**3. 句子结构:**\n\n这是一个简单的主从复合句，主句是\"The finding shows how sensitive rats are to social cues\"，从句是\"even when they come from basic robots\"。\n\n**4. 语法:**\n\n1. \"The finding shows\"是一个简单的主谓宾结构，主语是\"The finding\"，谓语是\"shows\"，宾语是后面的宾语从句。\n1. \"how sensitive rats are to social cues\"，这是一个宾语从句，使用了how来引导的疑问词从句。\n1. \"even when they come from basic robots\"，这是一个时间状语从句，用even when来表示对比的同时。\n\n**5. 知识点总结:**\n\n1. \"show\"可以用来引导宾语从句，表示显示或者表明某件事情。\n1. 可以使用how来引导宾语从句，表示\"……是多么的……\"。\n1. \"even when\"可以用来引导时间状语从句，表示在对比的情况下同时发生。\n\n**6. 相似句子练习:**\n\n\"The study shows how diligent students are in their studies, even when they are under great pressure.\"\n\n这个研究显示，即使在巨大的压力下，学生们在学习上依然非常勤奋。"},{"text":"says Wiles.","explainMd":"怀尔斯说"},{"text":"Similarly, children tend to treat robots as if they are fellow beings, even when they display only simple social signals.","explainMd":"**1. 翻译:**\n\n\"同样地，即使机器人只是展示简单的社交信号，孩子们也倾向于将机器人视为他们的同伴。\"\n\n**2. 重难点词汇和短语:**\n\n- **Similarly**: 同样地\n- **children tend to treat**: 孩子们倾向于对待\n- **robots**: 机器人\n- **as if they are fellow beings**: 好像他们是同伴\n- **even when they display only simple social signals**: 即使他们只是展示简单的社交信号\n\n**3. 句子结构:**\n\n这是一个复合句，主句是\"children tend to treat robots as if they are fellow beings\"，然后有一个时间状语从句\"even when they display only simple social signals\"。\n\n**4. 语法:**\n\n1. \"children tend to treat robots\"是一个主谓宾结构，表明主语\"孩子们\"进行的动作\"倾向于对待\"。\n1. \"as if they are fellow beings\"，这是一个方式状语从句，\"as if\"引导，修饰\"treat\"。\n1. \"even when they display only simple social signals\"，这是一个时间状语从句，\"even when\"引导，修饰主句。\n\n**5. 知识点总结:**\n\n1. 主谓宾结构可以用来清晰地表达主语进行的动作。\n1. \"as if\"可以引导方式状语从句，修饰动词。\n1. \"even when\"可以引导时间状语从句，修饰主句。\n\n**6. 相似句子练习:**\n\n\"Interestingly, even when the puppy shows only basic signs of affection, people tend to treat it as a family member.\"\n\n\"有趣的是，即使小狗只是展示基本的亲显行为，人们也倾向于将其视为家庭成员。\""},{"text":"“We humans seem to be fascinated by robots, and it turns out other animals are too,” says Wiles.","explainMd":"**1. 翻译:**\n\n\"我们人类似乎对机器人很着迷，事实证明，其他动物也是如此，\"威尔斯说。\n\n**2. 重难点词汇和短语:**\n\n- **We humans**: 我们人类\n- **seem to be fascinated by**: 似乎对...很着迷\n- **robots**: 机器人\n- **and it turns out**: 结果证明\n- **other animals are too**: 其他动物也是如此\n- **says Wiles**: 威尔斯说\n\n**3. 句子结构:**\n\n这是一个复合句。主句为\"We humans seem to be fascinated by robots\"，连接词\"and\"连接了两个并列的句子，其后的句子是\"it turns out other animals are too\"。\n\n**4. 语法:**\n\n1. \"We humans seem to be fascinated by robots\"是一个主谓宾结构，其中\"seem to be fascinated by\"是一个复杂谓语，\"seem\"是情态动词，\"to be fascinated by\"是动词不定式作为情态动词的补语。\n1. \"and it turns out other animals are too\"，\"it turns out\"是一个固定短语，后面跟从句，\"other animals are too\"是省略的从句，完整应为\"other animals are fascinated by robots too\"。\n\n**5. 知识点总结:**\n\n1. 主谓宾结构可以用来清晰地表达主语进行的动作。\n1. \"seem to\"可以引导动词不定式，用来表达看起来似乎是某种状态或情况。\n1. \"it turns out\"是一个常用固定短语，用来引出结果或事实。\n1. 在并列句中，如果两个句子的主语、谓语都相同，可以在第二个句子中省略。\n\n**6. 相似句子练习:**\n\n\"We adults seem to be attracted by nature, and it turns out children are too,\" says Smith.\n\n\"我们成年人似乎对自然很着迷，事实证明，孩子们也是如此，\"史密斯说。"}]}],"title":""}