{"translate":"","paragraphs":[{"sentences":[{"text":"As a historian, who’s always searching for the text or the image that makes us re-evaluate the past.","explainMd":"**1. 翻译**\n\n作为一位历史学家，我总是在寻找那些能让我们重新评估过去的文字或者图像。\n\n**2. 词汇和短语**\n\n- As a historian: 作为一位历史学家\n- who’s always searching for: 总是在寻找\n- the text or the image: 文字或者图像\n- that makes us re-evaluate: 让我们重新评估\n- the past: 过去\n\n**3. 句子结构**\n\n这是一个主从复合句，主句是 \"As a historian\"，从句是 \"who’s always searching for the text or the image that makes us re-evaluate the past\"。\n\n**4. 语法**\n\n这个句子中使用了关系代词 \"who\" 引导的定语从句，修饰 \"a historian\"。在定语从句中，又使用了连接词 \"that\" 引导的宾语从句，修饰 \"the text or the image\"。\n\n**5. 知识点总结**\n\n- 学习了如何使用 \"As a\" 来引导身份说明。\n- 学习了 \"who’s always searching for\" 的用法，表示一种持续的动作或习惯。\n- 学习了如何构建复杂的定语从句，描述复杂的观点或信息。\n\n**6. 练习相似句子**\n\nAs a scientist, who's always looking for the evidence that challenges our current understanding of the universe.\n（作为一位科学家，我总是在寻找那些能挑战我们现有宇宙理解的证据。）"},{"text":"I’ve become preoccupied with looking for photographs that show our Victorian ancestors smiling (what better way to shatter the image of 19th-century prudery?).","explainMd":"**1. 翻译**\n\n我已经开始专注于寻找那些展示我们19世纪维多利亚时代祖先笑容的照片（还有什么比这更能粉碎19世纪假正经的形象呢？）。\n\n**2. 词汇和短语**\n\n- I’ve become preoccupied with: 我已经开始专注于\n- looking for: 寻找\n- photographs: 照片\n- that show: 展示\n- our Victorian ancestors: 我们的维多利亚时代祖先\n- smiling: 笑容\n- what better way: 还有什么比这更好的方法\n- to shatter: 粉碎\n- the image of 19th-century prudery: 19世纪假正经的形象\n\n**3. 句子结构**\n\n这是一个复合句。主句是 ”I’ve become preoccupied with looking for photographs“，修饰这个主句的定语从句是 \"that show our Victorian ancestors smiling\"。括号内的句子是插入语，起到解释和补充说明的作用。\n\n**4. 语法**\n\n这个句子中使用了定语从句 \"that show our Victorian ancestors smiling\"，修饰 \"photographs\"。另外，使用了插入语 \"what better way to shatter the image of 19th-century prudery?\" 来加强语气和表明作者的观点。\n\n**5. 知识点总结**\n\n- 学习了如何使用 \"I’ve become preoccupied with\" 来表达一种专注的状态。\n- 学习了如何通过定语从句来修饰名词，增加句子的信息量。\n- 学习了插入语的用法，用于解释、补充说明或强调。\n\n**6. 练习相似句子**\n\nI've become fascinated with collecting old books that reveal the life of our ancestors in the Middle Ages (what better way to understand the culture of that time?).\n（我已经开始对收集那些揭示我们中世纪祖先生活的旧书感兴趣（还有什么比这更好的方式来理解那个时代的文化呢？）。）"},{"text":"I’ve found quite a few, and—since I started posting them on Twitter—they have been causing quite a stir.","explainMd":"**1. 翻译**\n\n我找到了相当多的这样的照片，而且——自从我开始在Twitter上发表它们——它们已经引起了相当大的反响。\n\n**2. 词汇和短语**\n\n- I’ve found: 我找到了\n- quite a few: 相当多的\n- and—since I started posting them on Twitter: 而且——自从我开始在Twitter上发表它们\n- they have been causing: 它们已经引起了\n- quite a stir: 相当大的反响\n\n**3. 句子结构**\n\n这是一个简单句，但通过使用破折号和现在完成进行时，使得句子的信息量增大，表达更丰富。\n\n**4. 语法**\n\n- \"I've found quite a few\" 这部分使用了现在完成时，表示过去发生的事情对现在的影响。\n- \"they have been causing quite a stir\" 这部分使用了现在完成进行时，表示从过去某一时间开始一直持续到现在的动作，强调动作的延续性。\n\n**5. 知识点总结**\n\n- 学习了如何使用 \"I’ve found quite a few\" 来表示找到了相当多的东西。\n- 学习了如何通过现在完成进行时来强调动作的延续性。\n- 学习了破折号的用法，用来连接主句和从句，或者插入一些补充说明的信息。\n\n**6. 练习相似句子**\n\nI've read quite a few books on this topic, and—since I started sharing my thoughts on my blog—they have been generating a lot of discussion.\n（我已经读了很多关于这个话题的书，而且——自从我开始在我的博客上分享我的想法——它们已经引起了很多讨论。）"},{"text":"People have been surprised to see evidence that Victorians had fun and could, and did, laugh.","explainMd":"**1. 翻译**\n\n人们对看到维多利亚时代的人们有趣和会笑的证据感到惊讶。\n\n**2. 词汇和短语**\n\n- People have been surprised: 人们感到惊讶\n- to see evidence: 看到证据\n- that Victorians: 维多利亚时代的人们\n- had fun: 有趣\n- and could, and did, laugh: 能够，确实会笑\n\n**3. 句子结构**\n\n这是一个复合句，其主句为\"People have been surprised to see evidence\"，而\"that Victorians had fun and could, and did, laugh\"是一个由\"that\"引导的宾语从句。\n\n**4. 语法**\n\n- \"People have been surprised\" 采用了现在完成进行时态，表示从过去某一时间开始一直持续到现在的动作。\n- \"that Victorians had fun and could, and did, laugh\" 是一个宾语从句，'that'在这里引导宾语从句，并在从句中作主语，'had fun'和'could, and did, laugh'都是述语。\n\n**5. 知识点总结**\n\n- 学习了如何使用现在完成进行时表达从过去持续到现在的动作。\n- 学习了如何使用\"that\"引导宾语从句。\n- 学习了如何在同一个句子中使用多个并列的动词。\n\n**6. 练习相似句子**\n\nPeople have been amazed to find out that ancient civilizations had advanced technology and could, and did, build impressive structures.\n\n（人们对发现古代文明拥有先进的技术，并且能够，确实建造了令人印象深刻的建筑，感到惊讶。）"},{"text":"They are noting that the Victorians suddenly seem to become more human as the hundred-or-so years that separate us fade away through our common experience of laughter.","explainMd":"**1. 翻译**\n\n他们注意到，随着我们之间的百年差距通过我们共同的笑声体验而消退，维多利亚时代的人们似乎突然变得更加人性化。\n\n**2. 词汇和短语**\n\n- They are noting: 他们注意到\n- that the Victorians: 维多利亚时代的人们\n- suddenly seem to become: 似乎突然变得\n- more human: 更加人性化\n- as the hundred-or-so years: 随着大约一百年的时间\n- that separate us: 我们之间的差距\n- fade away: 消退\n- through our common experience of laughter: 通过我们共享的笑声体验\n\n**3. 句子结构**\n\n这是一个复合句，主句为\"They are noting that the Victorians suddenly seem to become more human\"，而\"as the hundred-or-so years that separate us fade away through our common experience of laughter\"是一个由\"as\"引导的状语从句。\n\n**4. 语法**\n\n- \"They are noting\" 使用了现在进行时态，表示正在进行的动作。\n- \"that the Victorians suddenly seem to become more human\" 是一个宾语从句，'that'在这里引导宾语从句，并在从句中作主语，'suddenly seem to become more human'是述语。\n- \"as the hundred-or-so years that separate us fade away through our common experience of laughter\" 是一个状语从句，'as'在这里引导状语从句，并在从句中作状语，'the hundred-or-so years that separate us'是主语，'fade away'是谓语，'through our common experience of laughter'是状语。\n\n**5. 知识点总结**\n\n- 学习了如何使用现在进行时表达正在进行的动作。\n- 学习了如何使用\"that\"引导宾语从句。\n- 学习了如何使用\"as\"引导状语从句，并理解了它在句中的作用。\n- 学习了如何在句子中使用状语来修饰动词。\n\n**6. 练习相似句子**\n\nThey are realizing that ancient civilizations seem to be more advanced as the thousands of years that separate us dissolve through our common exploration of history.\n\n（他们正在意识到，随着我们之间的数千年差距通过我们共同的历史探索而消融，古代文明似乎变得更加先进。）"}]},{"sentences":[{"text":"Of course, I need to concede that my collection of “Smiling Victorians” makes up only a tiny percentage of the vast catalogue of photographic portraiture created between 1840 and 1900, the majority of which show sitters posing miserably and stiffly in front of painted backdrops, or staring absently into the middle distance.","explainMd":"**1. 翻译**\n\n当然，我必须承认，我的“微笑的维多利亚人”收藏只占据了 1840 年至 1900 年间创作的大量摄影肖像艺术目录的一小部分，其中大多数展示的是坐着的人在绘有背景的前面痛苦而僵硬地摆姿势，或者茫然地盯着中远处。\n\n**2. 词汇和短语**\n\n- Of course: 当然\n- I need to concede: 我必须承认\n- my collection of “Smiling Victorians”: 我的“微笑的维多利亚人”收藏\n- makes up only a tiny percentage of: 只占据了...的一小部分\n- the vast catalogue of photographic portraiture: 大量的摄影肖像艺术目录\n- created between 1840 and 1900: 在 1840 年至 1900 年间创作的\n- the majority of which: 其中的大部分\n- show sitters posing: 展示了坐着的人摆姿势\n- miserably and stiffly: 痛苦而僵硬地\n- in front of painted backdrops: 在绘有背景的前面\n- or staring absently: 或者茫然地盯着\n- into the middle distance: 中远处\n\n**3. 句子结构**\n\n这是一个复合句，主句为\"I need to concede that my collection of “Smiling Victorians” makes up only a tiny percentage of the vast catalogue of photographic portraiture created between 1840 and 1900\"，而\"the majority of which show sitters posing miserably and stiffly in front of painted backdrops, or staring absently into the middle distance\"是一个由\"which\"引导的非限定性定语从句。\n\n**4. 语法**\n\n- \"I need to concede\" 使用了一般现在时态，表示一个事实或者经常发生的动作。\n- \"that my collection of “Smiling Victorians” makes up only a tiny percentage of the vast catalogue of photographic portraiture created between 1840 and 1900\" 是一个宾语从句，'that'在这里引导宾语从句，并在从句中作主语，'my collection of “Smiling Victorians”'是主语，'makes up only a tiny percentage of the vast catalogue of photographic portraiture created between 1840 and 1900'是述语。\n- \"the majority of which show sitters posing miserably and stiffly in front of painted backdrops, or staring absently into the middle distance\" 是一个非限定性定语从句，'which'在这里引导非限定性定语从句，并在从句中作主语，'show sitters posing miserably and stiffly in front of painted backdrops, or staring absently into the middle distance'是述语。\n\n**5. 知识点总结**\n\n- 学习了如何使用一般现在时表达一个事实或者经常发生的动作。\n- 学习了如何使用\"that\"引导宾语从句。\n- 学习了如何使用\"which\"引导非限定性定语从句，并理解了它在句中的作用。\n\n**6. 练习相似句子**\n\nOf course, I have to admit that my collection of “Ancient Chinese Artifacts” constitutes only a small fraction of the vast inventory of artifacts excavated between 2000 BC and 500 AD, most of which depict people performing daily tasks or gazing blankly into the distance.\n\n（当然，我必须承认，我的“古代中国文物”收藏只占据了公元前2000年至公元500年间发掘的大量文物清单的一小部分，其中大多数展示的是人们在进行日常任务，或者茫然地远眺。）"},{"text":"How do we explain this trend?","explainMd":"**1. 翻译**\n\n我们如何解释这一趋势？\n\n**2. 词汇和短语**\n\n- How: 如何\n- do we: 我们\n- explain: 解释\n- this trend: 这一趋势\n\n**3. 句子结构**\n\n这句话是一种疑问句，其结构是：疑问词 + 助动词 + 主语 + 动词 + 宾语。具体到这句话就是：'How' + 'do' + 'we' + 'explain' + 'this trend'。\n\n**4. 语法**\n\n这句话是一个一般疑问句，以疑问词 \"How\" 开头，接着是助动词 \"do\"，然后是主语 \"we\" 和动词 \"explain\"，最后是宾语 \"this trend\"。这种句型常用于询问某事的原因、原理或方法。\n\n**5. 知识点总结**\n\n- 学习了如何构造以疑问词开头的一般疑问句。\n- 了解了疑问词 \"How\" 的用法，主要用于询问方法、方式或原因。\n- 学习了助动词 \"do\" 在疑问句中的作用，它用于形成疑问句，位于疑问词和主语之间。\n\n**6. 练习相似句子**\n\nHow do we solve this problem?\n\n（我们如何解决这个问题？）\n"}]},{"sentences":[{"text":"During the 1840s and 1850s, in the early days of photography, exposure times were notoriously long: the daguerreotype photographic method (producing an image on a silvered copper plate) could take several minutes to complete, resulting in blurred images as sitters shifted position or adjusted their limbs.","explainMd":"**1. 翻译**\n\n在摄影的早期，即1840年代和1850年代，曝光时间极其漫长：制作银镀铜板上的图像的达盖尔类型摄影法可能需要几分钟才能完成，这导致了由于坐者移动位置或调整肢体而产生的模糊图像。\n\n**2. 词汇和短语**\n\n- During: 在...期间\n- the 1840s and 1850s: 1840年代和1850年代\n- in the early days of photography: 在摄影的早期\n- exposure times: 曝光时间\n- were notoriously long: 极其漫长\n- the daguerreotype photographic method: 达盖尔类型摄影法\n- producing an image on a silvered copper plate: 在银镀铜板上制作图像\n- could take several minutes to complete: 可能需要几分钟才能完成\n- resulting in blurred images: 导致模糊的图像\n- as sitters shifted position or adjusted their limbs: 随着坐者移动位置或调整肢体\n\n**3. 句子结构**\n\n这句话是一个复合句，主要由两个主要子句组成。第一个子句描述了摄影早期的时间和曝光时间的情况，而第二个子句描述了这种长时间曝光导致的结果，即模糊的图像。\n\n**4. 语法**\n\n这句话的主要语法结构是“主语 + 谓语 + 宾语”，其中主语是“the daguerreotype photographic method”，谓语是“could take several minutes to complete”，宾语是“an image on a silvered copper plate”。此外，后半句使用了结果状语从句，表示因果关系，从句中的主语是“blurred images”，谓语是“resulting”，宾语是“as sitters shifted position or adjusted their limbs”。\n\n**5. 知识点总结**\n\n- 学习了如何构造复合句，理解了主要子句和从属子句的结构和功能。\n- 了解了结果状语从句的用法，它用于表示因果关系，并常常与主要子句形成对比。\n- 学习了如何使用过去时表示过去的事情，以及如何使用情态动词表示可能性。\n\n**6. 练习相似句子**\n\nDuring the 1920s and 1930s, in the early days of aviation, flights were notoriously uncomfortable: the small planes could take several hours to reach their destination, resulting in exhausted passengers as they endured the long journey.\n\n（在航空的早期，即1920年代和1930年代，飞行极其不舒适：小飞机可能需要几个小时才能到达目的地，这导致了乘客在长途旅行中疲惫不堪。）\n"},{"text":"The thought of holding a fixed grin as the camera performed its magical duties was too much to contemplate, and so a non-committal blank stare became the  norm.","explainMd":"1. **翻译**：\n\n   \"想到需要在相机执行其神奇功能时保持固定的微笑，这实在是太难以想象了，因此，面无表情的空白凝视成为了常态。\"\n\n2. **词汇和短语**：\n\n   - The thought of：想到\n   - holding a fixed grin：保持固定的微笑\n   - as the camera performed its magical duties：当相机执行其神奇的功能时\n   - was too much to contemplate：太难以想象了\n   - a non-committal blank stare：面无表情的空白凝视\n   - became the norm：成为了常态\n\n3. **句子结构**：\n\n   这是一个复杂句子，主句为\"The thought of holding a fixed grin was too much to contemplate\"，其中包含一个名词性从句 \"holding a fixed grin\" 作为 \"The thought of\" 的宾语。\"as the camera performed its magical duties\" 是一个时间状语从句，描述了主句动作发生的时间。最后的 \"a non-committal blank stare became the norm\" 是一个新的句子，表明了一个结果。\n\n4. **语法**：\n\n   该句子主要使用了名词性从句和时间状语从句。名词性从句在此处作为 \"The thought of\" 的宾语，时间状语从句描述了主句动作发生的时间。此外，使用了过去时态来描述过去的事实和情况。\n\n5. **知识点总结**：\n\n   - 名词性从句：在此句中，\"holding a fixed grin\" 作为名词性从句充当 \"The thought of\" 的宾语，用于表达思考的内容。\n   - 时间状语从句：在此句中，\"as the camera performed its magical duties\" 作为时间状语从句，描述了主句中的动作发生的时间。\n   - 过去时态：描述过去的事实和情况，如 \"was too much to contemplate\" 和 \"became the norm\"。\n\n6. **练习相似句子**：\n\n   \"想到需要在所有人面前发言，这实在是太难以想象了，因此，选择避而不谈成为了常态。\""}]},{"sentences":[{"text":"But exposure times were much quicker by the 1880s, and the introduction of the Box Brownie and other portable cameras meant that, though slow by today’s digital standards, the exposure was almost instantaneous.","explainMd":"1. **翻译**：\n\n   \"但是到了1880年代，曝光时间大大缩短，Box Brownie和其他便携式相机的出现意味着，虽然按照今天的数字标准来看，曝光速度仍然较慢，但几乎已经可以做到瞬间曝光。\"\n\n2. **词汇和短语**：\n\n   - But：但是\n   - exposure times：曝光时间\n   - much quicker：大大缩短\n   - by the 1880s：到了1880年代\n   - the introduction of the Box Brownie and other portable cameras：Box Brownie和其他便携式相机的出现\n   - meant that：意味着\n   - though slow by today’s digital standards：虽然按照今天的数字标准来看，速度仍然较慢\n   - the exposure was almost instantaneous：曝光几乎可以做到瞬间\n\n3. **句子结构**：\n\n   这是一个复合句。主句为\"But exposure times were much quicker by the 1880s\"，第二个句子是 \"the introduction of the Box Brownie and other portable cameras meant that...\"，其中 \"that...\" 是一个宾语从句，描述了相机的出现带来的影响。\n\n4. **语法**：\n\n   这个句子使用了过去时态，描述了1880年代的情况。\"Meant that...\" 是一个宾语从句，用来解释相机的出现带来的影响。\n\n5. **知识点总结**：\n\n   - 过去时态：用来描述过去的事件或状态。\n   - 宾语从句：用来解释或详细说明前面的主句信息。在这个句子中，\"that...\" 是一个宾语从句，解释了相机的出现带来的影响。\n\n6. **练习相似句子**：\n\n   \"But the internet speed was much faster by the 2000s, and the introduction of fiber-optic broadband meant that, though slow by today’s 5G standards, the connection was almost instantaneous.\"\n\n   \"但是到了2000年代，互联网速度大大提高，光纤宽带的出现意味着，虽然按照今天的5G标准来看，连接速度仍然较慢，但几乎已经可以做到瞬间连接。\""},{"text":"Spontaneous smiles were relatively easy to capture by the 1890s, so we must look elsewhere for an explanation of why Victorians still hesitated to smile.","explainMd":"1. **翻译**：\n\n   \"到了1890年代，自然的微笑变得相对容易捕捉，因此我们必须寻找其他解释来阐明为什么维多利亚人仍然犹豫不决地微笑。\"\n\n2. **词汇和短语**：\n\n   - Spontaneous smiles：自然的微笑\n   - were relatively easy to capture：变得相对容易捕捉\n   - by the 1890s：到了1890年代\n   - so we must look elsewhere：因此我们必须寻找其他地方\n   - for an explanation：为了一个解释\n   - of why Victorians still hesitated to smile：为什么维多利亚人仍然犹豫不决地微笑\n\n3. **句子结构**：\n\n   这是一个复合句。主句是\"Spontaneous smiles were relatively easy to capture by the 1890s\"，接着用连接词\"so\"引导了因果关系，\"we must look elsewhere for an explanation of why Victorians still hesitated to smile\"是结果句，其中\"why Victorians still hesitated to smile\"是一个宾语从句，对\"an explanation\"进行了解释。\n\n4. **语法**：\n\n   这个句子主要使用了过去时态，表示1890年代的情况。此外，\"so\"用作连接词，表示因果关系，\"why\"引导的宾语从句用来解释\"an explanation\"。\n\n5. **知识点总结**：\n\n   - 过去时态：用来描述过去的事件或状态。\n   - 连接词 \"so\"：表示原因和结果的关系。\n   - 宾语从句：用来进一步解释或详细说明前面的主句信息。\n\n6. **练习相似句子**：\n\n   \"Wireless communication was relatively easy to achieve by the 1990s, so we must look elsewhere for an explanation of why some areas still lacked connection.\"\n\n   \"到了1990年代，无线通信变得相对容易实现，因此我们必须寻找其他解释来阐明为什么一些地区仍然缺乏连接。\""}]},{"sentences":[{"text":"One explanation might be the loss of dignity displayed through a cheesy grin.","explainMd":"1. **翻译**：\n\n   \"一种解释可能是通过做出假笑而展示出的尊严的缺失。\"\n\n2. **词汇和短语**：\n\n   - One explanation might be：一种解释可能是\n   - the loss of dignity：尊严的缺失\n   - displayed through：通过...展示出\n   - a cheesy grin：假笑\n\n3. **句子结构**：\n\n   这个句子的主体是\"One explanation might be the loss of dignity\"，然后用\"through\"引导出原因——\"a cheesy grin\"。\n\n4. **语法**：\n\n   这个句子使用了可能性表达方式\"might be\"来表述一种可能的解释。\"displayed through\"用来表达原因和结果的关系。\n\n5. **知识点总结**：\n\n   - 可能性表达：用\"might be\"来表达可能的情况。\n   - 通过...来表达：用\"through\"来表达原因和结果的关系。\n\n6. **练习相似句子**：\n\n   \"One reason might be the lack of trust displayed through dishonest behavior.\"\n\n   \"一种原因可能是通过不诚实的行为表现出来的信任缺失。\""},{"text":"“Nature gave us lips to conceal our teeth,” ran one popular Victorian maxim, alluding to the fact that before the birth of proper dentistry, mouths were often in a shocking state of hygiene.","explainMd":"1. **翻译**：\n\n   \"“大自然赋予我们嘴唇是为了遮住我们的牙齿，”这是一条普遍流传的维多利亚时代的格言，暗指在现代牙科医疗技术出现之前，人们的口腔卫生状态通常令人震惊。\"\n\n2. **词汇和短语**：\n\n   - Nature gave us lips to conceal our teeth：大自然赋予我们嘴唇是为了遮住我们的牙齿\n   - ran one popular Victorian maxim：这是一条普遍流传的维多利亚时代的格言\n   - alluding to the fact：暗示着这一事实\n   - before the birth of proper dentistry：在现代牙科医疗技术出现之前\n   - mouths were often in a shocking state of hygiene：人们的口腔卫生状态通常令人震惊\n\n3. **句子结构**：\n\n   这个句子由三部分构成。首先是引述的维多利亚时代的格言；然后是格言的来源；最后是这个格言所暗示的事实。\n\n4. **语法**：\n\n   这个句子使用了引述的句型，即用引号来引述一个直接的语句或者观点。然后用逗号连接引述语和解释性的部分。句子的最后部分用了\"alluding to\"来引入这个格言所暗示的事实。\n\n5. **知识点总结**：\n\n   - 引述语句：用引号来引述一个直接的语句或者观点。\n   - 用逗号连接引述语和解释性的部分。\n   - \"alluding to\"的使用：用来引入一个事实或者观点的暗示。\n\n6. **练习相似句子**：\n\n   \"“A penny saved is a penny earned,” goes an old saying, hinting at the importance of saving money.\"\n\n   \"“省一分就是赚一分，”这是一句古老的谚语，暗示了储蓄的重要性。\""},{"text":"A flashing set of healthy and clean, regular “pearly whites” was a rare sight in Victorian society, the preserve of the super-rich (and even then, dental hygiene was not guaranteed).","explainMd":"1. **翻译**：\n\n    \"在维多利亚社会中，拥有一口健康、洁净、整齐的“珍珠白”牙齿是罕见的，这是超级富豪的专利（即使如此，牙齿卫生也无法保证）。\"\n\n2. **词汇和短语**：\n\n   - A flashing set of healthy and clean, regular “pearly whites”：一口闪烁的健康、洁净、整齐的“珍珠白”牙齿\n   - was a rare sight：是罕见的\n   - in Victorian society：在维多利亚社会中\n   - the preserve of the super-rich：是超级富豪的专利\n   - dental hygiene was not guaranteed：牙齿卫生无法保证\n\n3. **句子结构**：\n\n   这个句子由三部分组成。首先是对特定事物（这里是健康、洁净、整齐的牙齿）的描述；然后是这个特定事物在特定环境（这里是维多利亚社会）中的稀有性；最后是这个特定事物的归属问题，以及一个附带的说明。\n\n4. **语法**：\n\n   这个句子使用了一种比较复杂的句型，即开始时用形容词短语来描述一个特定的事物，然后用动词短语来描述这个事物的特性，接着用介词短语来指出这个特性在特定环境中的稀有性，最后用括号内的从句来做进一步的补充说明。\n\n5. **知识点总结**：\n\n   - 形容词短语的使用：用来描述一个特定的事物或者情况。\n   - 动词短语的使用：用来描述事物的特性或者行为。\n   - 介词短语的使用：用来指出事物在特定环境中的位置或者状态。\n   - 括号内的从句：用来做进一步的补充说明。\n\n6. **练习相似句子**：\n\n   \"A comfortable life was a rare luxury in the Middle Ages, the privilege of the nobility (and even then, a long and healthy life was not assured).\"\n\n   \"在中世纪，过上舒适的生活是稀罕的奢侈，这是贵族的特权（即使如此，长寿和健康的生活也无法保证）。\""}]},{"sentences":[{"text":"A toothy grin (especially when there were gaps or blackened gnashers) lacked class: drunks, tramps, prostitutes and buffoonish music hall performers might gurn and grin with a smile as wide as Lewis Carroll’s gum-exposing Cheshire Cat, but it was not a becoming look for properly bred persons.","explainMd":"1. **翻译**：\n\n    \"露齿的笑容（尤其是当有缺失或者黑色的牙齿时）缺乏风度：酒鬼、流浪者、妓女和滑稽的音乐厅表演者可能会咧嘴大笑，笑容宽到像路易斯·卡罗笔下的露齿的柴郡猫，但这对于有教养的人来说并不是一种得体的样子。\"\n\n2. **词汇和短语**：\n\n   - A toothy grin：露齿的笑容\n   - lacked class：缺乏风度\n   - drunks, tramps, prostitutes and buffoonish music hall performers：酒鬼、流浪者、妓女和滑稽的音乐厅表演者\n   - might gurn and grin：可能会咧嘴大笑\n   - a smile as wide as Lewis Carroll’s gum-exposing Cheshire Cat：笑容宽到像路易斯·卡罗笔下的露齿的柴郡猫\n   - a becoming look for properly bred persons：有教养的人的得体样子\n\n3. **句子结构**：\n\n   这句话是一个复合句，主句是\"A toothy grin lacked class\"，然后通过冒号引出一个解释这个主句的补充句子，这个补充句子中又包含了两个并列的子句。\n\n4. **语法**：\n\n   这个句子的语法结构比较复杂，主要使用了名词短语、动词短语、介词短语和并列句结构。\n\n5. **知识点总结**：\n\n   - 名词短语的使用：用来描述一个特定的事物或者情况。\n   - 动词短语的使用：用来描述事物的特性或者行为。\n   - 介词短语的使用：用来指出事物在特定环境中的位置或者状态。\n   - 并列句的使用：用来连接两个或者多个相关的句子。\n\n6. **练习相似句子**：\n\n   \"Extravagant spending (especially when debts are piling up) lacks wisdom: gamblers, reckless youth, and spendthrifts might squander money as fast as a leaky bucket loses water, but this is not a sensible habit for responsible individuals.\"\n\n   \"挥霍无度（尤其是当债务堆积如山时）是不明智的：赌徒、鲁莽的年轻人和挥霍者可能会像漏水的桶一样快速地浪费金钱，但这对于负责任的个体来说不是一种明智的习惯。\""},{"text":"Even Mark Twain, a man who enjoyed a hearty laugh, said that when it came to photographic portraits there could be “nothing more damning than a silly, foolish smile fixed forever”.","explainMd":"1. **翻译**：\n\n    \"甚至马克·吐温，一个喜欢开怀大笑的人，在谈到摄影肖像时也说过，没有什么比一个傻乎乎的、永远固定的笑容更令人遗憾的了。\"\n\n2. **词汇和短语**：\n\n   - Even Mark Twain：甚至马克·吐温\n   - a man who enjoyed a hearty laugh：一个喜欢开怀大笑的人\n   - when it came to photographic portraits：在谈到摄影肖像时\n   - there could be nothing more damning：没有什么更令人遗憾的了\n   - a silly, foolish smile fixed forever：一种傻乎乎的、永远固定的笑容\n\n3. **句子结构**：\n\n   这是一个复合句，主句是\"Even Mark Twain said\"，它包含两个由连词\"that\"引导的宾语从句，第一个宾语从句是\"a man who enjoyed a hearty laugh\"，描述了\"Mark Twain\"；第二个宾语从句是\"when it came to photographic portraits there could be nothing more damning than a silly, foolish smile fixed forever\"，解释了\"Mark Twain\"说的具体内容。\n\n4. **语法**：\n\n   本句中运用了定语从句和时间状语从句。\"a man who enjoyed a hearty laugh\"是定语从句，用于修饰\"Mark Twain\"; \"when it came to photographic portraits\"是时间状语从句，用于说明主句的发生条件或时间。\n\n5. **知识点总结**：\n\n   - 定语从句的使用：定语从句是一个修饰某一名词或代词的从句。在这个句子中，\"a man who enjoyed a hearty laugh\"就是对\"Mark Twain\"进行修饰的定语从句。\n   - 时间状语从句的使用：时间状语从句是说明主句中的动作或状态发生的时间或条件。在这个句子中，\"when it came to photographic portraits\"就是对主句\"there could be nothing more damning than a silly, foolish smile fixed forever\"的时间状语从句。\n\n6. **练习相似句子**：\n\n   \"Even Albert Einstein, a man who was known for his light-hearted sense of humor, said that in the realm of scientific discoveries, there could be nothing more regrettable than a hastily formed conclusion etched in stone.\"\n\n   \"即使是艾伯特·爱因斯坦，一个以轻松幽默的感觉著称的人，在谈到科学发现时也表示，没有什么比草率形成的、深深刻在石头上的结论更令人遗憾的了。\""}]}],"title":""}