{"translate":"","paragraphs":[{"sentences":[{"text":"From the early days of broadband, advocates for consumers and web-based companies worried that the cable and phone companies selling broadband connections had the power and incentive to favor their own or their partners’ websites and services over those of their rivals.","explainMd":"1. **翻译**：\n\n    \"从宽带网络的早期时代开始，消费者和基于网络的公司的倡导者就担心出售宽带连接的有线电视和电话公司有权力和动机偏爱自己或合作伙伴的网站和服务，而不是他们的竞争对手。\"\n\n2. **词汇和短语**：\n\n   - From the early days of broadband：从宽带网络的早期时代开始\n   - advocates for consumers and web-based companies：消费者和基于网络的公司的倡导者\n   - worried that：担心\n   - the cable and phone companies selling broadband connections：出售宽带连接的有线电视和电话公司\n   - had the power and incentive to favor：有权力和动机偏爱\n   - their own or their partners’ websites and services over those of their rivals：他们自己或他们的合作伙伴的网站和服务优于他们的竞争对手\n\n3. **句子结构**：\n\n   这是一个复杂句，主句是\"advocates worried\"，它包含一个由\"that\"引导的宾语从句，宾语从句是\"the cable and phone companies had the power and incentive to favor their own or their partners’ websites and services over those of their rivals\"，解释了倡导者们所担心的内容。\n\n4. **语法**：\n\n   本句中运用了宾语从句。\"that the cable and phone companies had the power and incentive to favor their own or their partners’ websites and services over those of their rivals\"是宾语从句，用于解释\"advocates worried\"的具体内容。\n\n5. **知识点总结**：\n\n   - 宾语从句的使用：宾语从句通常出现在一个句子的动词或介词后，用来解释或说明该动词或介词的具体内容。在这个句子中，\"that the cable and phone companies had the power and incentive to favor their own or their partners’ websites and services over those of their rivals\"就是对\"advocates worried\"的宾语从句。\n\n6. **练习相似句子**：\n\n   \"From the early days of e-commerce, retailers and online entrepreneurs worried that large corporations had the ability and motivation to dominate the market at the expense of small businesses.\"\n\n   \"从电子商务的早期开始，零售商和在线企业家就担心大公司有能力和动机以牺牲小企业为代价来主导市场。\""},{"text":"That’s why there has been such a strong demand for rules that would prevent broadband providers from picking winners and losers online, preserving the freedom and innovation that have been the lifeblood of the internet.","explainMd":"1. **翻译**：\n\n    \"这就是为什么有如此强烈的需求，要求制定规则防止宽带提供商在网上选择赢家和输家，以保护自由和创新，这些都是互联网的生命线。\"\n\n2. **词汇和短语**：\n\n    - That's why：这就是为什么\n    - there has been such a strong demand：有如此强烈的需求\n    - for rules that would prevent：对防止...的规则\n    - broadband providers from picking winners and losers online：宽带提供商在网上选择赢家和输家\n    - preserving the freedom and innovation：保护自由和创新\n    - that have been the lifeblood of the internet：这些都是互联网的生命线\n\n3. **句子结构**：\n\n    这是一个复杂句子，主句是\"There has been such a strong demand for rules\"，接下来的内容是这些规则的具体内容，以及这些规则的目的。\n\n4. **语法**：\n\n    这个句子中主要用到了名词性从句（that...的部分），以及定语从句（that have been...的部分）。名词性从句在这里充当主语，而定语从句则用来修饰先行词\"the freedom and innovation\"。\n\n5. **知识点总结**：\n\n    - 名词性从句的使用：在这个句子中，\"that there would be rules...\"是一个名词性从句，充当了主语的角色。名词性从句在句子中可以充当主语、宾语或表语。\n\n    - 定语从句的使用：在这个句子中，\"that have been the lifeblood of the internet\"是一个定语从句，修饰了\"the freedom and innovation\"这个先行词。\n\n6. **练习相似句子**：\n\n    \"That's why there is such a strong call for laws that would prevent large corporations from monopolizing the market, thereby protecting the competition and diversity that are the cornerstone of a healthy economy.\"\n\n    \"这就是为什么有如此强烈的呼声，要求制定法律防止大公司垄断市场，从而保护竞争和多样性，这些都是健康经济的基石。\""}]},{"sentences":[{"text":"Yet that demand has been almost impossible to fill — in part because of pushback from broadband providers, anti-regulatory conservatives and the courts.","explainMd":"1. **翻译**：\n\n    \"然而，满足这一需求几乎是不可能的——部分原因在于宽带提供商、反规制的保守派以及法院的反对。\"\n\n2. **词汇和短语**：\n\n    - Yet：然而\n    - that demand：这一需求\n    - has been almost impossible to fill：几乎是不可能满足的\n    - in part because of：部分原因在于\n    - pushback：反对\n    - from broadband providers, anti-regulatory conservatives and the courts：来自宽带提供商、反规制的保守派以及法院\n\n3. **句子结构**：\n\n    这是一个简单句，主句是\"that demand has been almost impossible to fill\"，后面的\"in part because of...\"是一个介词短语，用来解释满足这个需求为何困难。\n\n4. **语法**：\n\n    这个句子的语法相对简单，主要是使用了现在完成时态（has been）表达过去发生的事情对现在的影响，同时，\"in part because of\"是一个常用的短语，用来表示部分原因。\n\n5. **知识点总结**：\n\n    - 现在完成时的使用：在这个句子中，\"has been\"是现在完成时态，表示过去发生的事情对现在的影响。\n    - 介词短语的使用：\"in part because of\"是一个表示部分原因的介词短语。\n\n6. **练习相似句子**：\n\n    \"Yet that target has been almost impossible to achieve — in part because of resistance from fossil fuel industries, climate change skeptics and the government.\"\n\n    \"然而，达到那个目标几乎是不可能的——部分原因在于化石燃料行业、气候变化怀疑论者以及政府的抵制。\""},{"text":"A federal appeals court  weighed in again Tuesday, but instead of providing a badly needed resolution, it only prolonged the fight.","explainMd":"1. **翻译**：\n\n    \"联邦上诉法院在粥二再次介入，但是它并没有提供急需的解决方案，反而只是延长了这场争斗。\"\n\n2. **词汇和短语**：\n\n    - A federal appeals court：联邦上诉法院\n    - weighed in：发表意见，参与讨论\n    - again：再次\n    - Tuesday：星期二\n    - but instead of：但是并没有\n    - providing a badly needed resolution：提供急需的解决方案\n    - it only prolonged the fight：它只是延长了这场争斗\n\n3. **句子结构**：\n\n    这个句子主要由两个部分组成。第一部分是\"A federal appeals court weighed in again Tuesday\"，这是一个简单句，描述了法院的行动。第二部分是\"but instead of providing a badly needed resolution, it only prolonged the fight\"，这是一个包含了对比结构（instead of）和结果（it only prolonged the fight）的复合句。\n\n4. **语法**：\n\n    句子中使用了\"instead of\"来表达对比，强调法院没有做出预期的行动，而是采取了另一种行动。此外，\"only\"用于强调结果。\n\n5. **知识点总结**：\n\n    - 对比结构的使用：\"instead of\"是一个表示对比的短语，用来比较两种不同的行动或状态。\n    - 强调的使用：\"only\"是一个用于强调的单词，强调某种行动或状态是唯一发生的。\n\n6. **练习相似句子**：\n\n    \"The committee met again on Wednesday, but instead of making a decisive conclusion, it only extended the discussion.\"\n\n    \"委员会在星期三再次会议，但是并没有做出决"},{"text":"At issue before the U.S. Court of Appeals for the District of Columbia Circuit was the latest take of the Federal Communications Commission on net neutrality, adopted on a party-line vote in 2017.","explainMd":"1. **翻译**：\n\n    \"在哥伦比亚特区巡回上诉法院面前的问题是，联邦通信委员会对网络中立的最新理解，该理解在2017年的党派投票中被接纳。\"\n\n2. **词汇和短语**：\n\n    - At issue：在讨论中，问题是\n    - before：在……面前\n    - the U.S. Court of Appeals for the District of Columbia Circuit：美国哥伦比亚特区巡回上诉法院\n    - the latest take：最新理解\n    - the Federal Communications Commission：联邦通信委员会\n    - on net neutrality：对网络中立的\n    - adopted：被接纳\n    - on a party-line vote：在党派投票中\n\n3. **句子结构**：\n\n    这个句子主要由两部分组成，\"At issue before the U.S. Court of Appeals for the District of Columbia Circuit\" 和 \"was the latest take of the Federal Communications Commission on net neutrality, adopted on a party-line vote in 2017\"。前半部分是介词短语，作为句子主题，后半部分是被动语态的句子，描述了主题的内容。\n\n4. **语法**：\n\n    句子的主要语法结构是被动语态（\"was\" + 过去分词\"adopted\"）。此外，\"At issue\"是一个固定搭配，用来引出讨论的主题。\n\n5. **知识点总结**：\n\n    - 被动语态的使用：在这个句子中，被动语态被用来强调主题（联邦通信委员会的最新理解）而不是行动者（党派投票）。\n    - 固定搭配的使用：\"At issue\"是一个固定搭配，用来引出讨论的主题。\n\n6. **练习相似句子**：\n\n    \"At issue before the World Health Organization is the latest research on the effects of air pollution, released in a global report in 2023.\"\n\n    \"在世界卫生组织面前的问题是，关于空气污染效应的最新研究，该研究在2023年的全球报告中发布。\""},{"text":"The Republican-penned order not only eliminated the strict net neutrality rules the FCC had adopted when it had a Democratic majority in 2015, but rejected the commission’s authority to require broadband providers to do much of anything.","explainMd":"1. **翻译**：\n\n    \"共和党人起草的这项命令不仅消除了联邦通信委员会在2015年拥有民主党多数时采纳的严格的网络中立规则，而且否决了委员会要求宽带提供商做任何事情的权力。\"\n\n2. **词汇和短语**：\n\n    - The Republican-penned order：共和党人起草的这项命令\n    - not only... but also...：不仅...，而且...\n    - eliminated：消除了\n    - the strict net neutrality rules：严格的网络中立规则\n    - the FCC：联邦通信委员会\n    - adopted：采纳\n    - when it had a Democratic majority in 2015：在2015年拥有民主党多数时\n    - rejected：否决了\n    - the commission’s authority：委员会的权力\n    - to require：要求\n    - broadband providers：宽带提供商\n    - to do much of anything：做任何事情\n\n3. **句子结构**：\n\n    这个句子主要由两个部分组成，形成了\"not only... but also...\"的结构。\"The Republican-penned order\"是句子的主语，\"not only eliminated the strict net neutrality rules the FCC had adopted when it had a Democratic majority in 2015, but rejected the commission’s authority to require broadband providers to do much of anything\"是复杂的谓语部分，其中包含了两个并列的动作。\n\n4. **语法**：\n\n    句子使用了\"not only... but also...\"的结构，强调了两个方面。同时，\"when it had a Democratic majority in 2015\"是一个时间状语从句，修饰\"adopted\"。\n\n5. **知识点总结**：\n\n    - \"not only... but also...\"结构的使用：这个结构用于强调两个或多个方面，且每个方面都同等重要。\n    - 时间状语从句的使用：\"when it had a Democratic majority in 2015\"是一个时间状语从句，用来修饰主句中的动作。\n\n6. **练习相似句子**：\n\n   \"The new policy not only eliminated the old restrictions that had been set when the company was founded, but also rejected the board's authority to impose any new ones.\"\n\n   \"新的政策不仅消除了公司成立时设立的旧的限制，而且否决了董事会实施任何新限制的权力。\""},{"text":"The order also declared that  state and local governments couldn’t regulate broadband providers either.","explainMd":"1. **翻译**：\n\n    \"这个命令还宣布，州和地方政府也不能对宽带提供商进行监管。\"\n\n2. **词汇和短语**：\n\n    - The order：这个命令\n    - also declared：还宣布\n    - that：连词，引导宾语从句\n    - state and local governments：州和地方政府\n    - couldn’t regulate：不能对...进行监管\n    - broadband providers：宽带提供商\n    - either：也，用于否定句中表示“也不”\n\n3. **句子结构**：\n\n    这是一个简单句，句子的主语是\"The order\"，谓语是\"also declared\"，而\"that state and local governments couldn’t regulate broadband providers either\"是一个宾语从句，作为\"declared\"的宾语。\n\n4. **语法**：\n\n    在这个句子中，\"that\"是连接词，引导一个宾语从句。\"either\"在这里用于否定句中，表示\"也不\"。\n\n5. **知识点总结**：\n\n    - \"that\"引导宾语从句的使用：在这个句子中，\"that\"引导了一个宾语从句，这个从句是\"declared\"的宾语。\n    - \"either\"在否定句中的使用：\"either\"在否定句中，常常用于句末，表示\"也不\"。\n\n6. **练习相似句子**：\n\n   \"The resolution also stated that individual departments couldn't make decisions without committee approval either.\"\n\n   \"这个决议还表明，单个部门也不能在没有委员会批准的情况下做出决定。\""}]},{"sentences":[{"text":"The commission argued that other agencies would protect against anti-competitive behavior, such as a broadband-providing conglomerate like AT&T favoring its own video-streaming service at the expense of Netflix and Apple TV.","explainMd":"1. **翻译**：\n\n    \"委员会辩称，其他机构会防止反竞争行为，比如像AT&T这样的宽带供应商偏袒自家的视频流媒体服务，而牺牲Netflix和Apple TV的利益。\"\n\n2. **词汇和短语**：\n\n    - The commission：委员会\n    - argued：辩称\n    - that：连词，引导宾语从句\n    - other agencies：其他机构\n    - would protect against：会防止\n    - anti-competitive behavior：反竞争行为\n    - such as：比如\n    - a broadband-providing conglomerate：一个提供宽带的联合企业\n    - like AT&T：像AT&T这样的\n    - favoring its own video-streaming service：偏袒自家的视频流媒体服务\n    - at the expense of：牺牲\n    - Netflix and Apple TV：Netflix和Apple TV\n\n3. **句子结构**：\n\n    这个句子的主语是\"The commission\"，谓语是\"argued\"，而\"that other agencies would protect against anti-competitive behavior, such as a broadband-providing conglomerate like AT&T favoring its own video-streaming service at the expense of Netflix and Apple TV\"是宾语从句。\n\n4. **语法**：\n\n    在这个句子中，\"that\"是连接词，引导了一个宾语从句。\"such as\"用来举例说明反竞争行为。\n\n5. **知识点总结**：\n\n    - \"that\"引导宾语从句的使用：在这个句子中，\"that\"引导了一个宾语从句，这个从句是\"argued\"的宾语。\n    - \"such as\"引导举例的使用：\"such as\"在这个句子中用来举例说明反竞争行为。\n\n6. **练习相似句子**：\n\n    \"The company insisted that other suppliers would compensate for the shortage, such as a lithium-producing company like ABC favoring its own battery manufacturing over that of XYZ and DEF.\"\n\n    \"这家公司坚称，其他供应商会补偿这个短缺，比如像ABC这样的锂生产公司偏袒自家的电池制造，而牺牲XYZ和DEF的利益。\""},{"text":"Yet the FCC also ended the investigations of broadband providers that imposed data caps on their rivals’ streaming services but not their own.","explainMd":"1. **翻译**：\n\n    \"然而，联邦通信委员会也结束了对那些对竞争对手的流媒体服务施加数据限制，但不对自家服务施加此类限制的宽带提供商的调查。\"\n\n2. **词汇和短语**：\n\n    - Yet：然而\n    - the FCC：联邦通信委员会（Federal Communications Commission）\n    - also：也\n    - ended：结束\n    - the investigations：调查\n    - of broadband providers：对宽带提供商\n    - that：连接词，引导定语从句\n    - imposed data caps：施加数据限制\n    - on their rivals’ streaming services：对他们竞争对手的流媒体服务\n    - but not their own：但不对自己的服务\n\n3. **句子结构**：\n\n    这个句子的主语是\"the FCC\"，谓语是\"also ended\"，宾语是\"the investigations of broadband providers\"，而\"that imposed data caps on their rivals’ streaming services but not their own\"是一个定语从句。\n\n4. **语法**：\n\n    这个句子使用了定语从句来修饰\"broadband providers\"。\"that\"作为引导词，引导了一个定语从句，修饰\"broadband providers\"。\n\n5. **知识点总结**：\n\n    - \"that\"引导定语从句的使用：在这个句子中，\"that\"引导了一个定语从句，这个从句用来修饰\"broadband providers\"。\n    - \"but not\"的使用：\"but not\"在这个句子中用来表示对比，强调宽带提供商对自己的服务没有施加数据限制。\n\n6. **练习相似句子**：\n\n    \"Yet the company also stopped the inspections of suppliers that imposed high prices on their competitors' products but not their own.\"\n\n    \"然而，这家公司也停止了对那些对竞争对手的产品施加高价，但不对自家产品施加此类价格的供应商的检查。\""}]},{"sentences":[{"text":"On Tuesday, the appeals court unanimously upheld the 2017 order deregulating broadband providers, citing a Supreme Court ruling from 2005 that upheld a similarly deregulatory move.","explainMd":"1. **翻译**：\n\n   \"周二，上诉法院一致维持了2017年取消对宽带提供商的监管的命令，并引用了2005年最高法院对类似取消监管行动的裁决。\"\n\n2. **词汇和短语**：\n\n   - On Tuesday：周二\n   - the appeals court：上诉法院\n   - unanimously：一致地\n   - upheld：维持\n   - the 2017 order：2017年的命令\n   - deregulating：取消监管\n   - broadband providers：宽带提供商\n   - citing：引用\n   - a Supreme Court ruling：最高法院的裁决\n   - from 2005：来自2005年\n   - that upheld a similarly deregulatory move：也维持了类似的取消监管行动\n\n3. **句子结构**：\n\n   这是一个复合句。主句是\"On Tuesday, the appeals court unanimously upheld the 2017 order deregulating broadband providers\"，其中的宾语是\"the 2017 order deregulating broadband providers\"，\"deregulating broadband providers\"是修饰\"the 2017 order\"的现在分词短语。另外，\"citing a Supreme Court ruling from 2005 that upheld a similarly deregulatory move\" 是一个非限制性定语从句，用来修饰整个主句。\n\n4. **语法**：\n\n   句子中使用了非限制性定语从句 \"citing a Supreme Court ruling from 2005 that upheld a similarly deregulatory move\" 来对上文的信息进行补充说明。\"that\" 引导的是限制性定语从句，修饰\" a Supreme Court ruling from 2005\"。\n\n5. **知识点总结**：\n\n   - 非限制性定语从句的使用：在这个句子中，\"citing a Supreme Court ruling from 2005 that upheld a similarly deregulatory move\" 是一个非限制性定语从句，用来修饰整个主句，给出了额外的信息。\n   - \"that\"引导限制性定语从句的使用：\"that\"在这个句子中引导了一个限制性定语从句，用来修饰\" a Supreme Court ruling from 2005\"。\n\n6. **练习相似句子**：\n\n   \"On Monday, the committee unanimously passed the new policy on digital privacy, referencing a Supreme Court decision from 2010 that supported a similar privacy protection measure.\"\n\n   \"周一，委员会一致通过了关于数字隐私的新政策，并引用了2010年最高法院支持类似隐私保护措施的决定。\""},{"text":"But Judge Patricia Millett rightly argued in a concurring opinion that \"the result is unhinged from the realities of modern broadband service,\" and said Congress or the Supreme Court could intervene to \"avoid trapping Internet regulation in technological anachronism.\"","explainMd":"1. **翻译**：\n\n   \"但是，帕特里夏·米莱特法官在其支持的意见中正确地争辩说，'结果与现代宽带服务的现实脱节'，并表示国会或最高法院可以介入，以'避免将互联网监管困在技术过时中'。\"\n\n2. **词汇和短语**：\n\n   - But：但是\n   - Judge Patricia Millett：帕特里夏·米莱特法官\n   - rightly argued：正确地争辩\n   - in a concurring opinion：在其支持的意见中\n   - \"the result is unhinged from the realities of modern broadband service\"：结果与现代宽带服务的现实脱节\n   - and said：并表示\n   - Congress or the Supreme Court：国会或最高法院\n   - could intervene：可以介入\n   - \"avoid trapping Internet regulation in technological anachronism.\"：避免将互联网监管困在技术过时中\n\n3. **句子结构**：\n\n   这是一个复合句。主句是\"But Judge Patricia Millett rightly argued in a concurring opinion\"，宾语是两个引号中的部分。这两部分分别是\"the result is unhinged from the realities of modern broadband service\" 和 \"Congress or the Supreme Court could intervene to avoid trapping Internet regulation in technological anachronism.\"。句中的\"and said\"连接了两个引号中的部分。\n\n4. **语法**：\n\n   句子中使用了引导直接引语的句子结构。\"the result is unhinged from the realities of modern broadband service\" 和 \"Congress or the Supreme Court could intervene to avoid trapping Internet regulation in technological anachronism.\"都是直接引语，分别表示米莱特法官的两个观点。\n\n5. **知识点总结**：\n\n   - 直接引语的使用：在本句中，直接引语用来表示米莱特法官的观点，这两个观点分别通过\"and said\"连接。\n   - 复合句的构造：本句是一个复合句，主句和宾语之间通过引导直接引语的句子结构连接。\n\n6. **练习相似句子**：\n\n    \"But Doctor Smith firmly stated in his report that 'the patient's condition is deteriorating rapidly', and suggested that immediate medical intervention is required to 'avoid further health complications'.\"\n  \n    \"但是，史密斯医生在他的报告中坚决地声明'病人的状况正在迅速恶化'，并建议需要立即进行医疗干预，以'避免进一步的健康并发症'。\""}]},{"sentences":[{"text":"In the meantime, the court threw out the FCC’s attempt to block all state rules on net neutrality, while preserving the commission’s power to pre-empt individual state laws that undermine its order.","explainMd":"1. **翻译**：\n\n   \"与此同时，法院驳回了联邦通信委员会试图阻止所有州对网络中立性的规定的尝试，同时保留了该委员会预先阻止破坏其命令的单个州法的权力。\"\n\n2. **词汇和短语**：\n\n   - In the meantime：与此同时\n   - the court：法院\n   - threw out：驳回\n   - the FCC’s attempt：联邦通信委员会的尝试\n   - to block all state rules：阻止所有州的规定\n   - on net neutrality：关于网络中立性\n   - while preserving：同时保留\n   - the commission’s power：该委员会的权力\n   - to pre-empt individual state laws：预先阻止单个州的法律\n   - that undermine its order：破坏其命令的\n\n3. **句子结构**：\n\n   这是一个复合句，主句是\"In the meantime, the court threw out the FCC’s attempt to block all state rules on net neutrality\"，而从句是\"while preserving the commission’s power to pre-empt individual state laws that undermine its order\"。\"while\"引导的是时间状语从句，表示在主句动作发生的同时，从句中的动作也在发生。\"that\"引导的是定语从句，修饰\"individual state laws\"。\n\n4. **语法**：\n\n   句子中使用了时间状语从句和定语从句的结构。\"while\"引导的时间状语从句描述了主句动作发生的同时，从句中的动作也在发生。\"that\"引导的定语从句用来修饰\"individual state laws\"，具体说明了这些法律的性质。\n\n5. **知识点总结**：\n\n   - 时间状语从句的使用：在本句中，\"while\"引导的时间状语从句用来表达两个动作同时进行的情况。\n   - 定语从句的使用：\"that\"引导的定语从句用来修饰先行词\"individual state laws\"，补充说明其特性。\n   - \"throw out\"的用法：在法律语境中，\"throw out\"意味着驳回或拒绝。\n\n6. **练习相似句子**：\n\n   \"In the meantime, the teacher corrected the student's paper, while maintaining his patience to explain the errors that undermined the student's performance.\"\n\n   \"与此同时，老师批改了学生的试卷，同时保持耐心解释那些破坏学生表现的错误。\""},{"text":"That means more battles like the one now going on between the Justice Department and California, which enacted a tough net neutrality law in the wake of the FCC’s abdication.","explainMd":"1. **翻译**：\n\n    \"这意味着将有更多像现在正在发生的美国司法部和加利福尼亚州之间的战斗，后者在联邦通信委员会放弃其职责后制定了严格的网络中立法。\"\n\n2. **词汇和短语**：\n\n    - That means：这意味着\n    - more battles：更多的战斗\n    - like the one now going on：像现在正在进行的那个\n    - between the Justice Department and California：在美国司法部和加利福尼亚州之间\n    - which enacted a tough net neutrality law：后者制定了严格的网络中立法\n    - in the wake of：在……之后\n    - the FCC’s abdication：联邦通信委员会的放弃\n\n3. **句子结构**：\n\n    这是一个复合句。主句是\"That means more battles like the one now going on between the Justice Department and California\"，而\"which enacted a tough net neutrality law in the wake of the FCC’s abdication\"是定语从句，用来修饰并详细说明\"California\"。\n\n4. **语法**：\n\n    句子中使用了定语从句的结构，\"which\"引导的定语从句用来修饰先行词\"California\"，详细说明了加利福尼亚州的行为。\n\n5. **知识点总结**：\n\n    - 定语从句的使用：在这个句子中，\"which\"引导的定语从句用来修饰先行词并详细说明其特征或行为。\n    - \"in the wake of\"的用法：这个短语用来描述一件事情发生在另一件事情之后，有因果关系的含义。\n\n6. **练习相似句子**：\n\n    \"That means more discussions like the one now going on between the teacher and students, who proposed a new study plan in the wake of the final exam.\"\n\n    \"这意味着会有更多像现在正在进行的老师和学生之间的讨论，后者在期末考试后提出了新的学习计划。\""}]},{"sentences":[{"text":"The endless legal battles and back-and-forth at the FCC cry out for Congress to act.","explainMd":"1. **翻译**：\n\n    \"联邦通信委员会的无休止的法律斗争和反复无常呼吁国会采取行动。\"\n\n2. **词汇和短语**：\n\n    - The endless legal battles：无休止的法律斗争\n    - and back-and-forth：和反复无常\n    - at the FCC：在联邦通信委员会\n    - cry out for：呼吁\n    - Congress to act：国会采取行动\n\n3. **句子结构**：\n\n    这是一个简单句，主语是\"The endless legal battles and back-and-forth at the FCC\"，谓语是\"cry out for\"，宾语是\"Congress to act\"。\n\n4. **语法**：\n\n    句子中的\"cry out for\"是一个固定短语，表示\"强烈地需要\"或\"呼吁\"。此外，\"Congress to act\"是一个不定式短语，作为\"cry out for\"的宾语。\n\n5. **知识点总结**：\n\n    - \"cry out for\"的用法：这个短语常用来表示强烈的需求或呼吁。\n    - 不定式短语作宾语：在这个句子中，不定式短语\"to act\"被用作\"cry out for\"的宾语，表示被呼吁的动作。\n\n6. **练习相似句子**：\n\n    \"The ongoing environmental issues and pollution in the city cry out for the government to act.\"\n\n    \"城市中持续的环境问题和污染呼吁政府采取行动。\""},{"text":"It needs to give the commission explicit authority once and for all to bar broadband providers from meddling in the traffic on their network and to create clear rules protecting openness and innovation online.","explainMd":"1. **翻译**：\n\n    \"它需要一劳永逸地赋予委员会明确的权力，禁止宽带供应商干涉他们网络上的流量，并创建明确的规则保护在线的开放性和创新。\n\n2. **词汇和短语**：\n\n    - It needs to：它需要\n    - give the commission explicit authority：赋予委员会明确的权力\n    - once and for all：一劳永逸地\n    - to bar broadband providers：禁止宽带供应商\n    - from meddling in the traffic on their network：干涉他们网络上的流量\n    - and to create clear rules：并创建明确的规则\n    - protecting openness and innovation online：保护在线的开放性和创新\n\n3. **句子结构**：\n\n    这是一个复合句，主句是\"It needs to give the commission explicit authority once and for all\"，接着是两个并列的不定式短语作为宾语，分别是\"to bar broadband providers from meddling in the traffic on their network\"，和\"to create clear rules protecting openness and innovation online\"。\n\n4. **语法**：\n\n    在这个句子中，主句的主语是\"It\"，谓语是\"needs to\"，宾语是\"give the commission explicit authority once and for all\"。然后有两个不定式短语作为宾语补足语，分别是\"to bar broadband providers from meddling in the traffic on their network\"，和\"to create clear rules protecting openness and innovation online\"。\n\n5. **知识点总结**：\n\n    - \"once and for all\"的用法：这个短语表示\"一劳永逸地\"，用来强调某事只需要做一次就能解决问题。\n    - 不定式短语作宾语补足语：在这个句子中，不定式短语\"to bar...network\"和\"to create...online\"都被用作宾语补足语，表示被赋予的权力。\n\n6. **练习相似句子**：\n\n    \"The government needs to take decisive action once and for all to ban companies from dumping waste in the river and to establish strict regulations for environmental protection.\"\n\n    \"政府需要一劳永逸地采取决定性行动，禁止公司在河中倾倒废物，并建立严格的环保规定。\""}]}],"title":""}