{"translate":"","paragraphs":[{"sentences":[{"text":"“Reskilling” is something that sounds like a buzzword but is actually a requirement if we  plan to have a future where a lot of would-be workers do not get left behind.","explainMd":"**1. 翻译**\n\n\"再培训\"听起来像一个流行词，但实际上如果我们计划拥有一个未来，在那里很多可能成为工人的人不会被抛在后头，它实际上是一个必要条件。\n\n**2. 重难点词汇和短语**\n\n- \"Reskilling\": 再培训\n- \"Buzzword\": 流行词\n- \"Requirement\": 必要条件\n- \"Plan to\": 计划\n- \"Would-be\": 可能成为...的\n- \"Get left behind\": 被抛在后头\n\n**3. 句子结构**\n\n这是一个复合句，由两个主句组成，连接词 \"but\" 将它们连接在一起。第一个主句是 \"'Reskilling' is something that sounds like a buzzword\"，第二个主句是 \"it is actually a requirement if we plan to have a future where a lot of would-be workers do not get left behind\"。\n\n**4. 语法**\n\n- \"Reskilling\" 是这个句子的主语，动词是 \"is\"，\"something that sounds like a buzzword\" 是主语补足语。\n- \"That sounds like a buzzword\" 是一个定语从句，用于修饰 \"something\"。\n- \"But\" 是一个连接词，用于连接两个并列的主句。\n- \"It is actually a requirement if we plan to have a future where a lot of would-be workers do not get left behind\" 是一个复合主句，其中 \"if we plan to have a future where a lot of would-be workers do not get left behind\" 是一个条件状语从句。\n\n**5. 知识点总结**\n\n- \"Something that...\" 的结构用于描述主语的特性。\n- \"But\" 可以用来连接两个并列的主句。\n- \"If\" 可以引导条件状语从句。\n\n**6. 相似句子练习**\n\n\"Dedication\" is something that seems like a cliché, but is actually essential if we hope to achieve a goal where most potential athletes do not lose their passion.\n\n\"“奉献”看起来像是一个陈词滥调，但实际上，如果我们希望实现一个目标，在那里大多数有潜力的运动员不会失去他们的热情，它实际上是必要的。\""},{"text":"We know we are moving into a period where the jobs in demand will change rapidly, as will the requirements of the jobs that remain.","explainMd":"**1. 翻译**\n\n我们知道我们正在进入一个时期，其中需求的工作会迅速改变，同样，那些留下来的工作的要求也会改变。\n\n**2. 重难点词汇和短语**\n\n- \"Moving into\": 进入\n- \"Period\": 时期\n- \"In demand\": 需求的\n- \"Change rapidly\": 迅速改变\n- \"Requirements\": 要求\n- \"Remain\": 留下来\n\n**3. 句子结构**\n\n这是一个复合句，由两个并列的主句组成，连接词 \"as\" 将它们连接在一起。第一个主句是 \"We know we are moving into a period where the jobs in demand will change rapidly\"，第二个主句是 \"the requirements of the jobs that remain will also change\".\n\n**4. 语法**\n\n- \"We know\" 是这个句子的主语，动词是 \"know\"，宾语是后面的两个主句。\n- \"Where\" 引导了一个地点状语从句，修饰时期 \"period\"。\n- \"As\" 是一个并列连词，用于连接两个并列的主句。\n\n**5. 知识点总结**\n\n- \"We know\" 结构用于表示已知的事实。\n- \"Where\" 可以引导地点状语从句。\n- \"As\" 可以用来连接两个并列的主句，表示同时发生的动作或状态。\n\n**6. 相似句子练习**\n\nWe realize we are entering an era where the technologies in demand will evolve quickly, as will the skills necessary to use them.\n\n我们意识到我们正在进入一个时代，其中需求的技术会快速发展，同样，使用它们所需要的技能也会改变。"},{"text":"Research by WEF detailed in the Harvard Business Review, finds that on  average 42 per cent of the “core skills” within job roles will change by 2022.","explainMd":"**1. 翻译**\n\n由世界经济论坛（WEF）进行的研究并在《哈佛商业评论》中详细描述的结果发现，到2022年，工作角色中平均42%的“核心技能”将会改变。\n\n**2. 重难点词汇和短语**\n\n- \"Research\": 研究\n- \"Detailed in\": 在...中详细描述\n- \"Harvard Business Review\": 哈佛商业评论\n- \"On average\": 平均\n- \"Core skills\": 核心技能\n- \"Job roles\": 工作角色\n- \"Will change\": 将会改变\n\n**3. 句子结构**\n\n这是一个主从复合句。主句是\"Research by WEF ... finds that...\"，宾语从句是\"on average 42 per cent of the “core skills” within job roles will change by 2022\"。\n\n**4. 语法**\n\n- \"Research by WEF\"是主语，\"finds\"是谓语，\"that...\"是宾语从句。\n- \"On average\"是状语，用于修饰后面的比率。\n- \"Job roles\"短语中的\"within\"是介词，用于表示在...之内。\n\n**5. 知识点总结**\n\n- \"by\"常用于时间状语中，表示“到...为止”。\n- \"Research by...\"是一个常见的结构，用于表示由某人或某组织进行的研究。\n- \"Core skills\"是一个常见的词组，用于表示某个职业或任务最重要的技能。\n\n**6. 相似句子练习**\n\nA study by the University published in the Science Journal shows that approximately 30% of the primary subjects in the curriculum will be updated by 2025.\n\n《科学杂志》上发布的由大学进行的一项研究显示，到2025年，课程中大约30%的主要科目将会更新。"},{"text":"That is a very short timeline, so we can only imagine what the changes will be further in the future.","explainMd":"**1. 翻译**\n\n这是一个非常短的时间线，因此我们只能想象未来的变化会是什么样的。\n\n**2. 重难点词汇和短语**\n\n- \"Timeline\": 时间线\n- \"Imagine\": 想象\n- \"Changes\": 变化\n- \"Further in the future\": 在未来的某个时候\n\n**3. 句子结构**\n\n这是一个简单的主谓宾句型，其中包含一个带有\"so\"的结果状语从句。主句是\"That is a very short timeline\"，从句是\"we can only imagine what the changes will be further in the future\"。\n\n**4. 语法**\n\n- \"That\"作为主语，引导主句。\n- \"So\"是并列连词，用来引导表示结果的状语从句。\n- \"Can only\"表示只能做某事，\"imagine\"是动词，表示想象。\n\n**5. 知识点总结**\n\n- \"So\"可以用来引导表示结果的状语从句。\n- \"Can only\"是一个表示限定的结构，通常用来表示只有一种可能的行动或情况。\n- \"Further in the future\"是一个时间状语，用来表示在未来的某个时候。\n\n**6. 相似句子练习**\n\nThis is a very complex problem, so we can only speculate what the solutions might be further down the line.\n\n这是一个非常复杂的问题，所以我们只能推测未来可能的解决方案是什么。"}]},{"sentences":[{"text":"The question of who should pay for reskilling is a thorny one.","explainMd":"**1. 翻译**\n\n谁应该支付再培训的费用，这是个棘手的问题。\n\n**2. 重难点词汇和短语**\n\n- \"Reskilling\": 再培训，重新学习技能的过程\n- \"Thorny\": 棘手的，复杂的，难以处理的\n\n**3. 句子结构**\n\n这是一个简单的主谓宾句型。主语是\"The question of who should pay for reskilling\"，谓语是\"is\"，宾语是\"a thorny one\"。\n\n**4. 语法**\n\n- \"The question of\" 是一个常见的短语，用来引出某个问题或议题。\n- \"Thorny\" 是形容词，用来形容问题或议题复杂且难以解决。\n\n**5. 知识点总结**\n\n- \"The question of\" 短语可以引出某个问题或议题。\n- \"Thorny\" 形容词用来形容问题或议题复杂且难以解决。\n\n**6. 相似句子练习**\n\nThe question of who should take responsibility for the accident is a thorny one.\n\n谁应该对这次事故负责，这是个棘手的问题。"},{"text":"For individual companies, the temptation is always to let go of workers whose skills are no longer in demand and replace them with those whose skills are.","explainMd":"**1. 翻译**\n\n对于个别公司来说，诱惑总是让那些技能不再受欢迎的员工离职，用那些技能尚受欢迎的员工取而代之。\n\n**2. 重难点词汇和短语**\n\n- \"Temptation\": 诱惑，强烈的欲望\n- \"Let go of\": 让...离职，放弃\n- \"In demand\": 受需求的，受欢迎的\n- \"Replace\": 取代，替换\n\n**3. 句子结构**\n\n这是一个较复杂的句子，主要由两个子句组成，中间由并列连词 \"and\" 连接。第一部分 \"the temptation is always to let go of workers whose skills are no longer in demand\" 的主语是 \"the temptation\"，谓语是 \"is\"，宾语是 \"to let go of workers whose skills are no longer in demand\"。第二部分 \"replace them with those whose skills are\" 的主语是省略的，谓语是 \"replace\"，宾语是 \"them\"，状语是 \"with those whose skills are\"。\n\n**4. 语法**\n\n- \"Temptation to do something\" 是一个常见的结构，表示有做某事的诱惑。\n- \"Let go of someone\" 是个短语，表示让某人离职或者放弃某人。\n- \"Replace A with B\" 是一个常用的结构，表示用 B 替换 A。\n\n**5. 知识点总结**\n\n- \"Temptation to do something\" 结构表示有做某事的诱惑。\n- \"Let go of someone\" 短语表示让某人离职或者放弃某人。\n- \"Replace A with B\" 结构表示用 B 替换 A。\n\n**6. 相似句子练习**\n\nFor most people, the temptation is always to spend money on things they don't need and replace their old belongings with new ones.\n\n对于大多数人来说，总是存在着把钱花在他们不需要的东西上，并用新的东西替换他们旧的东西的诱惑。"},{"text":"That does not always happen.","explainMd":"**1. 翻译**\n\n这并不总是会发生。\n\n**2. 重难点词汇和短语**\n\n- \"That\": 那个，指代前文的情况或事件\n- \"does not always happen\": 不总是发生\n\n**3. 句子结构**\n\n这是一个简单句，主语是 \"That\"，谓语是 \"does not always happen\"。\n\n**4. 语法**\n\n这个句子使用的是现在时态的否定形式，这里的 \"does not\" 是助动词，用于构成现在时态的否定形式，\"always\" 是频率副词，表示总是，经常。\n\n**5. 知识点总结**\n\n- \"That\" 可以用作指示代词，指代前文的情况或事件。\n- 在英语中，使用 \"do/does/did\" 加上 \"not\" 可以构成现在时或过去时的否定形式。\n- \"always\" 是频率副词，用于表示动作或状态的频繁程度。\n\n**6. 相似句子练习**\n\nThat does not always work out as planned.\n\n那并不总是如计划的那样进行。"},{"text":"AT&T is often given as the gold standard of a company who decided to do a massive reskilling program rather than go with a fire-and-hire strategy, ultimately retraining 18,000 employers.","explainMd":"**1. 翻译**\n\nAT&T经常被视为一个典范，该公司选择执行大规模的再培训计划，而不是采取解雇再聘用的策略，最终对18,000名员工进行了再培训。\n\n**2. 重难点词汇和短语**\n\n- \"is often given as the gold standard\": 经常被视为典范\n- \"massive reskilling program\": 大规模的再培训计划\n- \"fire-and-hire strategy\": 解雇再聘用的策略\n- \"ultimately\": 最终\n\n**3. 句子结构**\n\n这是一个复合句，主要包含两个子句。第一个子句的主语是 \"AT&T\"，谓语是 \"is often given as the gold standard\"；第二个子句的主语是 \"who/that\"（引导的定语从句，修饰 \"a company\"），谓语是 \"decided to do a massive reskilling program rather than go with a fire-and-hire strategy, ultimately retraining 18,000 employers\"。\n\n**4. 语法**\n\n这里使用了现在时态，\"is often given as\" 是被动语态。定语从句 \"who decided to do a massive reskilling program rather than go with a fire-and-hire strategy, ultimately retraining 18,000 employers\" 用来描述 \"a company\"。\n\n**5. 知识点总结**\n\n- \"be given as\" 是被动语态，表示被视为或被认为。\n- \"rather than\" 用于连接两个对立的概念，表示\"而不是\"。\n- 定语从句可以用来修饰先行词，提供更多详细信息。\n\n**6. 相似句子练习**\n\nMicrosoft is frequently cited as a leading company that has committed to a large-scale training program, rather than following a layoff-and-hire approach, eventually training 10,000 employees.\n\n微软经常被引用为一个领先的公司，该公司承诺进行大规模的培训计划，而不是遵循解雇和聘用的方法，最终培训了10,000名员工。"}]},{"sentences":[{"text":"Prepandemic, other companies including Amazon and Disney had also pledged to create their own plans.","explainMd":"**1. 翻译**\n\n疫情之前，包括亚马逊和迪士尼在内的其他公司也承诺制定自己的计划。\n\n**2. 重难点词汇和短语**\n\n- \"Prepandemic\": 疫情之前\n- \"pledged\": 承诺\n- \"create their own plans\": 制定自己的计划\n\n**3. 句子结构**\n\n这是一个简单句，主语是 \"other companies including Amazon and Disney\"，谓语是 \"had also pledged to create their own plans\"。\n\n**4. 语法**\n\n这句话使用了过去完成时 (\"had pledged\")，表明在过去某个时间点之前已经发生的动作或状态。\"including\" 是介词，用于列举包括的元素。\n\n**5. 知识点总结**\n\n- \"Prepandemic\" 是一个前缀词，表示 \"before the pandemic\"。\n- 过去完成时是用来表示在过去某一时间或动作之前已完成的动作或状态。\n- \"including\" 用于在句中列举包括的元素。\n\n**6. 相似句子练习**\n\nBefore the economic crisis, other firms including Google and Apple had also committed to develop their own strategies.\n\n在经济危机之前，包括谷歌和苹果在内的其他公司也承诺制定自己的策略。"},{"text":"When the skills mismatch is in the broader economy though, the focus usually turns to government to handle.","explainMd":"**1. 翻译**\n\n然而，当技能不匹配的问题在更广泛的经济体中出现时，焦点通常会转向政府来处理。\n\n**2. 重难点词汇和短语**\n\n- \"skills mismatch\": 技能不匹配\n- \"the broader economy\": 更广泛的经济体\n- \"the focus turns to\": 焦点转向\n- \"to handle\": 来处理\n\n**3. 句子结构**\n\n这是一个状语从句和主句的结构。状语从句为 \"When the skills mismatch is in the broader economy\"，主句为 \"the focus usually turns to government to handle\"。\n\n**4. 语法**\n\n这句话的主体是一个简单句，但前面的 \"when\" 导入了一个时间状语从句。\"turns to\" 是一个短语动词，表示 \"转向\" 或 \"依赖\"。\n\n**5. 知识点总结**\n\n- \"skills mismatch\" 是一个常见的经济学词汇，指的是工人的技能和劳动市场的需求之间的不匹配。\n- \"the broader economy\" 指的是整个经济体，而不仅仅是一个特定的部门或行业。\n- \"turns to\" 是一个短语动词，它表示转向或依赖某人或某事来处理问题或困难。\n\n**6. 相似句子练习**\n\nWhen the problem of pollution is on a global scale, the attention usually shifts to international organizations to tackle.\n\n当污染问题达到全球范围时，人们通常会将注意力转向国际组织来解决。"},{"text":"Efforts in Canada and elsewhere have been arguably languid at best, and have given us a situation where we frequently hear of employers begging for workers, even at times and in regions where unemployment is high.","explainMd":"**1. 翻译**\n\n在加拿大和其他地方的努力最多可以说是微弱的，这让我们经常听到雇主在乞求劳动力，即使在失业率高的时期和地区。\n\n**2. 重难点词汇和短语**\n\n- \"Efforts\": 努力\n- \"arguably\": 可以说是\n- \"languid\": 微弱的\n- \"at best\": 最多\n- \"begging for\": 乞求\n- \"unemployment\": 失业率\n\n**3. 句子结构**\n\n这是一个主从复合句。主句是 \"Efforts in Canada and elsewhere have been arguably languid at best\"，从句是 \"we frequently hear of employers begging for workers, even at times and in regions where unemployment is high\"。\n\n**4. 语法**\n\n这句话中使用了现在完成时态 \"have been\" 来描述一种已经存在的状况。\"arguably\" 是一个副词，用来修饰形容词 \"languid\"，增加说话者的主观态度。\"even\" 引导的是让步状语从句，表示尽管有反面的情况，主句的事实仍然成立。\n\n**5. 知识点总结**\n\n- \"Efforts\" 是一个常用词，表示努力或尝试，通常用于描述为达到某个目标所做的努力。\n- \"arguably\" 是一个副词，用于增加说话者的主观态度，表示可以说是、或许是等含义。\n- 使用现在完成时态 \"have been\" 来描述一种已经存在的状况。\n- \"even\" 引导的让步状语从句，表示尽管有反面的情况，主句的事实仍然成立。\n\n**6. 相似句子练习**\n\nEducation reforms in this country have been arguably inadequate at best, and have led to a situation where we often see students struggling to master basic skills, even in areas where resources are plentiful.\n\n这个国家的教育改革最多可以说是不够的，这导致我们经常看到学生们在掌握基本技能上挣扎，即使在资源丰富的地方也是如此。"}]},{"sentences":[{"text":"With the pandemic, unemployment is very high indeed.","explainMd":"**1. 翻译**\n\n由于疫情，失业率的确非常高。\n\n**2. 重难点词汇和短语**\n\n- \"pandemic\": 疫情\n- \"unemployment\": 失业率\n- \"very high indeed\": 的确非常高\n\n**3. 句子结构**\n\n这是一个简单句，主语是 \"unemployment\"，谓语是 \"is\"，宾语是 \"very high indeed\"，前面的 \"With the pandemic\" 是状语，表示这种情况是在疫情下发生的。\n\n**4. 语法**\n\n这句话中使用了现在时态 \"is\" 来描述当前的状况，\"indeed\" 是一个副词，用来强调 \"very high\"，增加了说话者的确定性。\n\n**5. 知识点总结**\n\n- \"pandemic\" 是一个常用词，表示全球性的疾病爆发，如新冠病毒疫情。\n- \"unemployment\" 是一个经济学术语，表示失业率，用来衡量劳动力市场的状况。\n- \"indeed\" 是一个副词，用来强调事实的真实性，表示的确、实在是等含义。\n- 使用现在时态 \"is\" 来描述当前的状况。\n\n**6. 相似句子练习**\n\nWith the economic crisis, poverty is very high indeed.\n\n由于经济危机，贫困率的确非常高。"},{"text":"In February, at 3.5 per cent and 5.5 per cent respectively, unemployment rates in Canada and the United States were at generational lows and worker shortages were everywhere.","explainMd":"**1. 翻译**\n\n在二月份，加拿大和美国的失业率分别为3.5%和5.5%，处于历史低位，而劳动力短缺的情况却随处可见。\n\n**2. 重难点词汇和短语**\n\n- \"February\": 二月份\n- \"3.5 per cent and 5.5 per cent respectively\": 分别为3.5%和5.5%\n- \"unemployment rates\": 失业率\n- \"generational lows\": 历史低位\n- \"worker shortages were everywhere\": 劳动力短缺的情况随处可见\n\n**3. 句子结构**\n\n这是一个复合句。主句是 \"unemployment rates in Canada and the United States were at generational lows and worker shortages were everywhere\"，其中的 \"and\" 连接了两个并列的谓语部分 \"were at generational lows\" 和 \"were everywhere\"。\"In February\" 和 \"at 3.5 per cent and 5.5 per cent respectively\" 是状语，前者表示时间，后者表示程度。\n\n**4. 语法**\n\n这句话中使用了一般过去时 \"were\" 来描述过去的情况。\"respectively\" 是一个副词，用于列举的两个或两个以上的事物分别对应。\n\n**5. 知识点总结**\n\n- \"unemployment rates\" 是一个经济学术语，表示失业率，用来衡量劳动力市场的状况。\n- \"generational lows\" 是一个形容词短语，表示历史的最低点。\n- \"respectively\" 是一个副词，用于列举的两个或两个以上的事物分别对应。\n- 使用一般过去时 \"were\" 来描述过去的情况。\n\n**6. 相似句子练习**\n\nIn July, at 10 per cent and 8 per cent respectively, inflation rates in Europe and Asia were at historical highs and price increases were everywhere.\n\n在七月份，欧洲和亚洲的通货膨胀率分别为10%和8%，处在历史高位，而物价上涨的情况随处可见。"},{"text":"As of May, those rates had spiked up to 13.3 per  cent and 13.7 per cent, and although many worker shortages had disappeared, not all had done so.","explainMd":"**1. 翻译**\n\n到五月份，这些比率已经飙升至13.3%和13.7%，尽管许多劳动力短缺的情况已经消失，但并非全部都消失了。\n\n**2. 重难点词汇和短语**\n\n- \"As of May\": 到五月份\n- \"spiked up to\": 飙升至\n- \"although\": 尽管\n- \"worker shortages had disappeared, not all had done so\": 劳动力短缺的情况已经消失，但并非全部都消失了\n\n**3. 句子结构**\n\n主句为 \"those rates had spiked up to 13.3 per cent and 13.7 per cent\"，\"As of May\" 作为时间状语修饰主句。\"and although many worker shortages had disappeared, not all had done so\" 是一个并列句，其中 \"although\" 引导的让步状语从句为 \"many worker shortages had disappeared\"，主句为 \"not all had done so\"。\n\n**4. 语法**\n\n使用了过去完成时 \"had spiked up\" 和 \"had disappeared\"，表示在过去某个时间点之前已完成的动作。\"although\" 是一个连词，引导让步状语从句。\n\n**5. 知识点总结**\n\n- \"spike up\" 表示急剧上升。\n- 过去完成时表示在过去某个时间点之前已完成的动作。\n- \"although\" 是连接词，引导让步状语从句，表示尽管……但是……的意思。\n\n**6. 相似句子练习**\n\nAs of December, the inflation rates had risen to 9 per cent and 12 per cent, and although many price increases had stabilized, not all had done so.\n\n到十二月份，通货膨胀率已经升至9%和12%，尽管许多价格上涨已经稳定，但并非全部都稳定了。"},{"text":"In the medical filed, to take an obvious example, the pandemic meant that there were still clear shortages of doctors, nurses and other medical personnel.","explainMd":"**1. 翻译**\n\n在医疗领域，以一个显而易见的例子来说，疫情意味着医生、护士和其他医务人员仍然存在明显的短缺。\n\n**2. 重难点词汇和短语**\n\n- \"in the medical field\": 在医疗领域\n- \"to take an obvious example\": 以一个显而易见的例子来说\n- \"the pandemic meant\": 疫情意味着\n- \"clear shortages\": 明显的短缺\n\n**3. 句子结构**\n\n这是一个复合句，主句是 \"the pandemic meant that there were still clear shortages of doctors, nurses and other medical personnel\"，其中 \"that there were still clear shortages of doctors, nurses and other medical personnel\" 是宾语从句，作为 \"meant\" 的宾语。\"in the medical field\" 和 \"to take an obvious example\" 是两个状语，分别表示地点和方式。\n\n**4. 语法**\n\n这句话中使用了过去时 \"meant\" 来表示过去的事情。\"that\" 是一个连词，引导宾语从句。\n\n**5. 知识点总结**\n\n- \"in the field of\" 表示在……领域。\n- \"to take an example\" 是一个固定短语，表示举例。\n- \"the pandemic meant\" 表示疫情意味着……。\n- \"shortages\" 表示短缺，常与 of 搭配使用。\n\n**6. 相似句子练习**\n\nIn the education sector, to take an obvious example, the pandemic meant that there were still clear shortages of teachers, tutors and other educational personnel.\n\n在教育领域，以一个显而易见的例子来说，疫情意味着教师、辅导员和其他教育人员仍然存在明显的短缺。"}]},{"sentences":[{"text":"Of course, it is not like you can take an unemployed waiter and train him to be a doctor in a few weeks, no matter who pays for it.","explainMd":"**1. 翻译**\n\n当然，你不能期望在几周内就把一个失业的服务员培训成医生，无论是谁来支付这个费用。\n\n**2. 重难点词汇和短语**\n\n- \"Of course\": 当然\n- \"it is not like\": 并不是说\n- \"you can take an unemployed waiter and train him to be a doctor\": 你可以把一个失业的服务员培训成医生\n- \"in a few weeks\": 在几周内\n- \"no matter who pays for it\": 无论是谁来支付这个费用\n\n**3. 句子结构**\n\n这是一个复杂句，主句是 \"it is not like you can take an unemployed waiter and train him to be a doctor in a few weeks\"，\"no matter who pays for it\" 是一个无论从句，作为主句的状语。\n\n**4. 语法**\n\n这句话主要使用了 \"it is not like\" 结构，表示 \"并不是说……\"。同时，\"no matter who\" 是一个无论从句，表示无论谁……。\n\n**5. 知识点总结**\n\n- \"Of course\" 用来表示肯定或者同意的情况，意为 \"当然\"。\n- \"it is not like\" 结构用来表示 \"并不是说……\"。\n- \"no matter who\" 是一个无论从句，表示无论谁……。\n\n**6. 相似句子练习**\n\nOf course, it is not like you can take a high school student and turn them into a physicist in a few months, no matter who pays for it.\n\n当然，你不能期望在几个月内就把一个高中生培训成物理学家，无论是谁来支付这个费用。"},{"text":"But even if you cannot close that gap, maybe you can close others, and doing so would be to the benefit of all concerned.","explainMd":"**1. 翻译**\n\n但是，即使你无法弥补那个差距，你也许可以弥补其他差距，这样做将对所有相关方都有益。\n\n**2. 重难点词汇和短语**\n\n- \"even if\"：即使，用来表达一种条件。\n- \"close that gap\"：弥补那个差距，此处的\"gap\"指的是技能差距。\n- \"close others\"：弥补其他差距。\n- \"doing so\"：这样做，此处\"so\"指的是前面的行为\"close others\"。\n- \"to the benefit of all concerned\"：对所有相关方都有益，此处的\"concerned\"指的是涉及到的或关心这个问题的所有人。\n\n**3. 句子结构**\n\n这是一个复合句，主要包含两个部分。主句是 \"maybe you can close others, and doing so would be to the benefit of all concerned\"，它是一个条件句的结果部分。\"even if you cannot close that gap\" 是条件句的条件部分。\n\n**4. 语法**\n\n这个句子的主要语法结构是条件句。\"even if\" 引导的是一个让步条件句，即使条件不成立，也不影响主句的真实。\n\n**5. 知识点总结**\n\n- \"even if\" 的用法。它引导让步条件句，表示 \"即使……也\"。\n- \"doing so\" 的用法。\"so\" 是一个代词，用来指代前面提到的行为或情况。\n- \"to the benefit of all concerned\" 的结构和含义。它的意思是 \"对所有相关方都有益\"。\n\n**6. 相似句子练习**\n\nBut even if you cannot solve all the problems, maybe you can solve some, and doing so would be to the benefit of all involved.\n\n但是，即使你不能解决所有的问题，你也许可以解决一部分，这样做将对所有涉及的人都有益。"},{"text":"That seems to be the case in Sweden: when forced to furlough 90 per cent of their cabin staff, Scandinavian Airlines decided to start up   a short retraining program that reskilled the laid-off workers to support hospital staff.","explainMd":"**1. 翻译**\n\n这似乎就是瑞典的情况：当被迫休假90%的机组人员时，北欧航空决定开启一个短期的再培训计划，将被裁员工重新培训，以支持医院工作人员。\n\n**2. 重难点词汇和短语**\n\n- \"be the case\"：事实就是如此，表示实际情况或事实情况。\n- \"forced to furlough\"：被迫休假，此处的\"furlough\"指的是暂时解雇或休假。\n- \"start up a short retraining program\"：启动一个短期的再培训计划。\n- \"reskilled\"：重新培训，此处的\"reskill\"是指提供新的技能培训。\n\n**3. 句子结构**\n\n这是一个复杂句，主句是 \"That seems to be the case in Sweden\"，后面跟着两个由\"when\"和\"that\"引导的定语从句，分别修饰\"the case\"和\"program\"。\n\n**4. 语法**\n\n这个句子的主要语法结构是定语从句。\"when\" 和 \"that\" 都是引导定语从句的连接词，\"when\" 引导的定语从句表示时间，\"that\" 引导的定语从句用来限定名词。\n\n**5. 知识点总结**\n\n- \"be the case\" 的用法。它用来表示某一情况或事实的存在。\n- 定语从句的构成和用法。\"when\" 和 \"that\" 都可以引导定语从句，分别表示时间和限定。\n\n**6. 相似句子练习**\n\nThat seems to be the situation in Canada: when forced to lay off a large number of their factory workers, a local company decided to initiate a vocational training program that reskilled the unemployed workers to support community services.\n\n这似乎就是加拿大的情况：当被迫裁掉大量的工厂工人时，一个本地公司决定启动一个职业培训项目，将失业工人重新培训，以支持社区服务。"},{"text":"The effort was a collective one and involved other companies as well as a Swedish university.","explainMd":"**1. 翻译**\n\n这是一个集体行动，包括其他公司和一所瑞典大学。\n\n**2. 重难点词汇和短语**\n\n- \"The effort was a collective one\"：这个努力是一个集体的，其中\"collective\"表示由一组人或事物共同进行的。\n- \"involved\"：涉及到，指包含或包括。\n\n**3. 句子结构**\n\n这是一个简单句，主语是\"The effort\"，谓语是\"was\"和\"involved\"，宾语是\"a collective one\"和\"other companies as well as a Swedish university\"。\n\n**4. 语法**\n\n这个句子使用了\"as well as\"的结构，用来连接两个或更多的并列的成分。在这个句子中，\"as well as\"连接了\"other companies\"和\"a Swedish university\"。\n\n**5. 知识点总结**\n\n- \"as well as\"的用法。它用来连接两个或更多的并列的成分。\n- \"involved\"的用法。当它用在被动语态中时，表示“涉及到”。\n\n**6. 相似句子练习**\n\nThe project was a joint one and involved several organizations as well as a local university.\n\n这个项目是一个联合的，并且涉及到了几个组织以及一所本地大学。"}]}],"title":""}