{"translate":"","paragraphs":[{"sentences":[{"text":"With the global population predicted to hit close to 10 billion by 2050, and forecasts that agricultural production in some regions will need to nearly double to keep pace, food security is increasingly making headlines.","explainMd":"**1. 翻译**\n\n预计到2050年全球人口将接近100亿，而有预测指出，某些地区的农业产量需要近乎翻倍才能跟上步伐，因此食品安全问题越来越引起人们的关注。\n\n**2. 重难点词汇和短语**\n\n- \"predicted to hit close to\"：预计将接近，\"hit\"在这里用来表示\"达到\"。\n- \"forecasts\": 预测，表示对未来情况的预测。\n- \"agricultural production\": 农业产量，指农业产出的数量。\n- \"keep pace\": 跟上步伐，表示保持和他人或事物相同的速度或进度。\n- \"food security\": 食品安全，指食物供应的充足和质量的安全。\n\n**3. 句子结构**\n\n这是一个复合句，主要由三个部分构成：\n\n- \"With the global population predicted to hit close to 10 billion by 2050\"：状语从句，描述全球人口预计将在2050年接近100亿的情况。\n- \"and forecasts that agricultural production in some regions will need to nearly double to keep pace\"：并列的状语从句，描述农业产量需要近乎翻倍以跟上步伐的预测。\n- \"food security is increasingly making headlines\"：主句，主语是“food security”，谓语是“is increasingly making headlines”。\n\n**4. 语法**\n\n这个句子使用了带有\"with\"的复杂结构，在句子中作状语，描述背景。\n\n**5. 知识点总结**\n\n- \"predicted to\"的用法。当我们预测某事将会发生时，我们可以使用\"predicted to\"。\n- \"forecasts\"的用法。当我们需要表述对未来情况的预测时，我们可以使用\"forecasts\"。\n- \"with\"的用法。当我们需要描述句子的背景或条件时，我们可以使用带有\"with\"的复杂结构。\n\n**6. 相似句子练习**\n\nWith the technology advancing at an unprecedented pace and predictions that jobs in some industries will be completely replaced by AI, the issue of job security is increasingly gaining attention.\n\n随着技术以前所未有的速度发展，以及预测某些行业的工作将完全被AI取代，就业安全问题越来越引人关注。"},{"text":"In the UK, it has become a big talking point recently too, for a rather particular reason: Brexit.","explainMd":"**1. 翻译**\n\n在英国，食品安全问题最近也成为了一个热点讨论的话题，原因有点特别：英国脱欧。\n\n**2. 重难点词汇和短语**\n\n- \"talking point\"：讨论的话题，指在讨论或辩论中被广泛讨论的主题。\n- \"for a rather particular reason\"：出于一个相当特别的原因，\"particular\"在此处用于强调原因的特殊性。\n- \"Brexit\"：脱欧，指英国从欧洲联盟的退出。\n\n**3. 句子结构**\n\n这个句子主要由三部分组成：\n\n- \"In the UK, it has become a big talking point recently too\"：主句，主语是\"it\"即食品安全问题，谓语是\"has become\"，表述了在英国，食品安全问题也成为了热门讨论话题。\n- \"for a rather particular reason\"：介词短语，修饰主句，说明讨论热度上升的原因。\n- \"Brexit\"：原因的具体说明，即脱欧。\n\n**4. 语法**\n\n此句主要使用了简单句的结构，其中\"for a reason\"是一个介词短语，用来修饰整个句子，给出主句发生的原因。\n\n**5. 知识点总结**\n\n- \"talking point\"的用法：当我们需要表述某个主题成为了广泛讨论的焦点时，我们可以使用\"talking point\"。\n- \"for a reason\"的用法：当我们需要给出某个情况发生的原因时，我们可以使用\"for a reason\"。\n\n**6. 相似句子练习**\n\nIn the US, it has become a major concern recently too, for a rather specific reason: climate change.\n\n在美国，气候变化也成为了最近的一个主要关注点，原因相当特殊。"}]},{"sentences":[{"text":"Brexit is seen by some as an opportunity to reverse a recent trend towards the UK importing food.","explainMd":"**1. 翻译**\n\n有些人认为，脱欧是一个机会，可以扭转英国近期的食品进口趋势。\n\n**2. 重难点词汇和短语**\n\n- \"Brexit\"：脱欧，指英国从欧洲联盟的退出。\n- \"seen by some as\"：被一些人看作，用来引出一些人的观点或看法。\n- \"an opportunity to reverse\"：一个扭转的机会，\"reverse\"在这里指的是改变一个趋势或情况的方向。\n- \"a recent trend towards\"：近期的一个趋势，\"trend towards\"指的是朝着某个方向的发展趋势。\n\n**3. 句子结构**\n\n这个句子主要由三部分组成：\n\n- \"Brexit is seen by some as an opportunity\"：主句，主语是\"Brexit\"，谓语是\"is seen\"，表述了脱欧被一些人看作是一个机会。\n- \"to reverse a recent trend\"：不定式短语，作为宾语补足语，进一步说明这个机会的具体内容。\n- \"towards the UK importing food\"：介词短语，修饰\"trend\"，说明这个趋势的具体方向。\n\n**4. 语法**\n\n此句主要使用了简单句的结构，其中\"to reverse a recent trend\"是一个不定式短语作为宾语补足语，说明主句的具体内容；\"towards the UK importing food\"是一个介词短语作为定语，修饰\"trend\"。\n\n**5. 知识点总结**\n\n- \"seen by some as\"的用法：当我们需要表述一些人的观点或看法时，我们可以使用\"seen by some as\"。\n- \"an opportunity to\"的用法：当我们需要表述某件事提供了一个做某事的机会时，我们可以使用\"an opportunity to\"。\n\n**6. 相似句子练习**\n\nClimate change is seen by some as a chance to push the development of renewable energy.\n\n气候变化被一些人视为推动可再生能源发展的机会。"},{"text":"The country produces only about 60 per cent of the food it eats, down from almost three-quarters in the late 1980s.","explainMd":"**1. 翻译**\n\n该国只生产约60%的食物供自己食用，比1980年代末的近四分之三有所下降。\n\n**2. 重难点词汇和短语**\n\n- \"produces\"：生产，指在这里指的是英国制造或生成食物的过程。\n- \"only about\"：仅仅大约，用来表达数量或程度的约束。\n- \"per cent\"：百分比，常用来表示比例。\n- \"down from\"：下降，用来表示某个数量或程度比过去的数量或程度低。\n\n**3. 句子结构**\n\n这个句子主要由三部分组成：\n\n- \"The country produces only about 60 per cent of the food it eats\"：主句，主语是\"The country\"，谓语是\"produces\"，表述了英国只生产约60%的食物供自己食用。\n- \"down from almost three-quarters\"：介词短语，表示与过去的比较，三分之四的量有所下降。\n- \"in the late 1980s\"：时间状语，表示这个比较的时间点。\n\n**4. 语法**\n\n此句主要使用了简单句的结构，其中\"down from almost three-quarters\"是一个介词短语作为状语，表示与过去的比较，\"in the late 1980s\"是一个时间状语，表示这个比较的时间点。\n\n**5. 知识点总结**\n\n- \"produces only about\"的用法：当我们需要表述某个数量或程度的约束时，我们可以使用\"only about\"。\n- \"down from\"的用法：当我们需要表示某个数量或程度比过去的数量或程度低时，我们可以使用\"down from\"。\n\n**6. 相似句子练习**\n\nThe company now employs only about 50 percent of the staff it had, down from nearly 200 in the early 2000s.\n\n公司现在雇佣的员工只有以前的50%，比2000年初的近200人有所减少。"},{"text":"A move back to self-sufficiency, the argument goes, would boost the farming industry, political sovereignty and even the nation’s health.","explainMd":"**1. 翻译**\n\n据说，回归自给自足将提升农业产业，增强政治主权，乃至改善国家健康。\n\n**2. 重难点词汇和短语**\n\n- \"A move back to\"：回归到，表示改变现状，回到某种状态或行为。\n- \"self-sufficiency\"：自给自足，指的是自我满足，不依赖别人或外部资源。\n- \"the argument goes\"：据说，这是一种在英语中常用的说法，表示某种观点或论断的存在。\n- \"boost\"：提升，增强，用来表示增加或改进某种状态或行为。\n\n**3. 句子结构**\n\n这个句子由以下部分组成：\n\n- \"A move back to self-sufficiency\"：主语，表示回归自给自足的行动或举措。\n- \"the argument goes\"：表示说法或观点的存在。\n- \"would boost the farming industry, political sovereignty and even the nation’s health\"：这是条件句的主句，表示如果回归自给自足，将会对农业产业、政治主权和国家健康产生提升的效果。\n\n**4. 语法**\n\n此句是一个条件句的主句，其中的\"would\"表示对未来的推测。\"the argument goes\"常用于引出一种说法或观点。\n\n**5. 知识点总结**\n\n- \"A move back to\"的用法：当我们需要表示改变现状，回到某种状态或行为时，我们可以使用\"A move back to\"。\n- \"the argument goes\"的用法：当我们需要引出一种说法或观点时，我们可以使用\"the argument goes\"。\n\n**6. 相似句子练习**\n\nA return to traditional teaching methods, the argument goes, would improve educational outcomes and student engagement.\n\n据说，回归传统的教学方法将提升教育成果和学生的参与度。"},{"text":"Sounds great – but how feasible is this vision?","explainMd":"**1. 翻译**\n\n听起来很好 - 但是这个设想有多可行呢？\n\n**2. 重难点词汇和短语**\n\n- \"Sounds great\"：听起来很好，这是一个常用的表达方式，用于对某个想法或建议表示正面的评价。\n- \"feasible\"：可行的，用于描述一个计划、设想或目标是否可以实现或执行。\n- \"vision\"：设想，指的是对未来的预想或计划。\n\n**3. 句子结构**\n\n这是一个问句结构，由以下部分组成：\n\n- \"Sounds great\"：独立主句，表示对前面讨论的设想的评价。\n- \"but how feasible is this vision?\"：连词\"but\"连接的问句，询问前面提到的设想的可行性。\n\n**4. 语法**\n\n这个句子使用了\"but\"来连接两个独立的句子，并用问句形式来提出疑问。\"Sounds great\"是一种用于评价或评论的表达方式。\n\n**5. 知识点总结**\n\n- \"Sounds great\"的用法：当我们需要对某个想法或建议表示正面的评价时，我们可以使用\"Sounds great\"。\n- \"feasible\"的用法：当我们需要描述一个计划、设想或目标是否可以实现或执行时，我们可以使用\"feasible\"。\n\n**6. 相似句子练习**\n\nIt looks promising - but how achievable is this goal?\n\n这看起来很有希望 - 但是这个目标有多可达成呢？"}]},{"sentences":[{"text":"According to a report on UK food production from the University of Leeds, UK, 85 per cent of the country’s total land area is associated with meat and dairy production.","explainMd":"**1. 翻译**\n\n根据英国利兹大学关于英国食品生产的一份报告，英国85%的总土地面积与肉类和乳制品的生产有关。\n\n**2. 重难点词汇和短语**\n\n- \"According to\"：根据，这是一个常用的引述来源或依据的短语。\n- \"report\"：报告，指的是对某个主题或问题的详细研究和分析。\n- \"associated with\"：与...有关，这个短语用于表示一种关联或连接。\n\n**3. 句子结构**\n\n这是一个简单句。主语是\"a report on UK food production from the University of Leeds, UK\"，谓语是\"is associated with\"，宾语是\"meat and dairy production\"，\"85 per cent of the country’s total land area\"是主语的定语。\n\n**4. 语法**\n\n这个句子使用了\"according to\"来引述来源或依据，\"is associated with\"来表示主题（报告）和内容（肉类和乳制品的生产）之间的关联。\n\n**5. 知识点总结**\n\n- \"According to\"的用法：当我们需要引述来源或依据时，我们可以使用\"according to\"。\n- \"is associated with\"的用法：当我们需要表示一种关联或连接时，我们可以使用\"is associated with\"。\n\n**6. 相似句子练习**\n\nAccording to a study from Harvard University, USA, 70 per cent of the country's total energy consumption is related to fossil fuels.\n\n根据美国哈佛大学的一项研究，美国70%的总能源消耗与化石燃料有关。"},{"text":"That supplies 80 per cent of what is consumed, so even covering the whole country in livestock farms wouldn’t allow us to cover all our meat and dairy needs.","explainMd":"**1. 翻译**\n\n这供应了我们消费的80%的肉品和乳制品，所以即使我们把整个国家都覆盖成畜牧场也无法满足我们所有的肉类和乳制品需求。\n\n**2. 重难点词汇和短语**\n\n- \"supplies\"：供应，此处用于描述肉类和乳制品的生产和消费关系。\n- \"consumed\"：被消费的，此处指的是在英国被消费的肉类和乳制品。\n- \"covering the whole country in livestock farms\"：把整个国家都覆盖成畜牧场，这是一个假设的情况，用于说明即使在这个极端的情况下也无法满足所有的肉类和乳制品需求。\n\n**3. 句子结构**\n\n这是一个复合句，由主句\"That supplies 80 per cent of what is consumed\"和由连接词\"so\"引导的结果状语从句\"even covering the whole country in livestock farms wouldn’t allow us to cover all our meat and dairy needs\"构成。\n\n**4. 语法**\n\n这个句子使用了\"so\"来引导结果状语从句，表示因果关系。主句中使用了\"supplies\"来表示供应和消费的关系，从句中使用了\"wouldn’t allow\"来表示假设的情况下也无法实现的结果。\n\n**5. 知识点总结**\n\n- \"supplies\"的用法：当我们需要描述供应和消费的关系时，我们可以使用\"supplies\"。\n- 使用\"so\"引导结果状语从句：当我们需要表示因果关系时，我们可以使用\"so\"来引导结果状语从句。\n\n**6. 相似句子练习**\n\nThis provides 70% of the electricity we use, so even if we utilize all the renewable energy resources, we couldn't meet all our power needs.\n\n这提供了我们使用的70%的电力，所以即使我们利用所有的可再生能源，我们也无法满足所有的电力需求。"}]},{"sentences":[{"text":"There are many caveats to those figures, but they are still grave.","explainMd":"**1. 翻译**\n\n这些数据有许多值得注意的地方，但它们仍然严重。\n\n**2. 重难点词汇和短语**\n\n- \"caveats\"：警告，限制条件，此处指的是对于前文提出的数据和结论的一些限制或者需要注意的地方。\n- \"figures\"：数值，数据，此处指的是前文关于英国食品生产和消费的数据。\n- \"grave\"：严重的，此处用来形容前文提出的数据和结论的严重性。\n\n**3. 句子结构**\n\n这是一个复合句，由主句\"There are many caveats to those figures\"和并列句\"but they are still grave\"构成。\n\n**4. 语法**\n\n这个句子中使用了\"but\"来连接两个并列的句子，表示对比或者转折的关系。另外，\"to\"在这里用来表示对于前文提出的数据的一些警告或者限制条件。\n\n**5. 知识点总结**\n\n- \"caveats\"的用法：当我们需要描述一些警告或者限制条件时，我们可以使用\"caveats\"。\n- 使用\"but\"来连接两个并列的句子：当我们需要表示对比或者转折的关系时，我们可以使用\"but\"。\n\n**6. 相似句子练习**\n\nThere are many exceptions to this rule, but it is still important.\n\n这个规则有许多例外，但它仍然很重要。"},{"text":"To become much more self-sufficient, the UK would need to drastically reduce its consumption of animal foods, and probably also farm more intensively – meaning fewer green fields, and more factory-style production.","explainMd":"**1. 翻译**\n\n为了更加自给自足，英国需要大幅度减少动物食品的消费，并可能需要更加密集地进行农业生产——这意味着更少的绿色田野和更多的工厂式生产。\n\n**2. 重难点词汇和短语**\n\n- \"self-sufficient\": 自给自足的，这个词描述的是一个体系，特别是一个国家，能够满足自身的需求，而不需要依赖外部资源。\n- \"drastically\": 大幅度地，用来强调变化的幅度或程度。\n- \"intensively\": 密集地，强烈地，用来描述活动的强度或频率。\n- \"factory-style production\": 工厂式生产，描述的是大规模、高效率、标准化的生产方式。\n\n**3. 句子结构**\n\n这是一个复杂句。主句为\"To become much more self-sufficient, the UK would need to drastically reduce its consumption of animal foods, and probably also farm more intensively\"。然后通过破折号连接了一个解释性的部分，解释了\"farming more intensively\"的含义。\n\n**4. 语法**\n\n这个句子中使用了条件句的结构，\"To become much more self-sufficient\"是条件部分，\"the UK would need to drastically reduce its consumption of animal foods, and probably also farm more intensively\"是结果部分。另外，使用了破折号来连接主句和解释性的部分。\n\n**5. 知识点总结**\n\n- 使用条件句来表达一个结果依赖于某个条件的情况。\n- 使用破折号来连接主要句子和解释性的部分。\n\n**6. 相似句子练习**\n\nTo achieve a better grade, you need to study harder -- meaning more hours in the library and fewer distractions.\n\n为了取得更好的成绩，你需要更努力地学习——这意味着在图书馆里花费更多的时间，减少分心的事物。"}]},{"sentences":[{"text":"But switching to a mainly plant-based diet wouldn’t help.","explainMd":"**1. 翻译**\n\n但是转向以植物为主的饮食并不能帮助解决问题。\n\n**2. 重难点词汇和短语**\n\n- \"switching to\": 转向，表示从一种状态或方式改变到另一种状态或方式。\n- \"mainly\": 主要地，大部分地，用来强调某一方面或特征占据主导地位。\n- \"plant-based diet\": 以植物为主的饮食，一种饮食方式，以植物食品为主，少吃或不吃动物源性食品。\n\n**3. 句子结构**\n\n这是一个简单句，由主语\"But switching to a mainly plant-based diet\" 和谓语\"wouldn’t help\"组成。\n\n**4. 语法**\n\n这个句子的语法构造比较简单，主要使用了一个简单的未来时态，表示对未来的预测或假设。\n\n**5. 知识点总结**\n\n- 使用\"switching to\"来表示状态或方式的转变。\n- 使用\"mainly\"来强调某一方面或特征的主导地位。\n- 理解和使用特定领域的词汇，如\"plant-based diet\"。\n\n**6. 相似句子练习**\n\nBut switching to a totally digital workflow wouldn't solve the problem.\n\n但是转向完全的数字化工作流程并不能解决问题。"},{"text":"There is a good reason why the UK is dominated by animal husbandry: most of its terrain doesn’t have the right soil or climate to  grow crops on a commercial basis.","explainMd":"**1. 翻译**\n\n英国以畜牧业为主有一个很好的理由：大部分的土地并不具备种植作物的适宜土壤或气候条件。\n\n**2. 重难点词汇和短语**\n\n- \"dominated by\": 被...主导，表示一种事物在某个领域的主导地位。\n- \"animal husbandry\": 畜牧业，指的是饲养并繁殖家畜的行业。\n- \"terrain\": 地形，地势，通常指的是地球的物理特征。\n- \"commercial basis\": 商业基础，是指基于商业利润和效益的考虑。\n\n**3. 句子结构**\n\n这是一个复合句，主要由两个部分组成：“There is a good reason why the UK is dominated by animal husbandry”和“most of its terrain doesn’t have the right soil or climate to grow crops on a commercial basis”。\n\n**4. 语法**\n\n这个句子主要使用了现在时态，表达的是一种事实或常态。\n\n**5. 知识点总结**\n\n- 使用\"dominated by\"来表示主导地位。\n- 理解和使用特定领域的词汇，如\"animal husbandry\"、\"terrain\"和\"commercial basis\"。\n- 理解复合句的构造和使用。\n\n**6. 相似句子练习**\n\nThere is a good reason why the city is dominated by technology firms: most of its population has a background in engineering.\n\n这个城市以科技公司为主有一个很好的理由：大多数人口都有工程背景。"},{"text":"Just 25 per cent of the country’s land is suitable for crop-growing, most of which is already occupied by arable fields.","explainMd":"**1. 翻译**\n\n只有25%的英国土地适合种植作物，而其中大部分已经被耕地占据。\n\n**2. 重难点词汇和短语**\n\n- \"suitable for\": 适合于，表示某物或某人适宜进行某项活动或适应某种环境。\n- \"crop-growing\": 种植作物，涉及农业或园艺的行为。\n- \"occupied by\": 被...占据，表示某物或某人已经使用或控制了某个地方或物体。\n- \"arable fields\": 可耕地，指的是适合耕种和种植作物的土地。\n\n**3. 句子结构**\n\n这是一个简单句，由主语\"25 per cent of the country’s land\"、谓语\"is suitable for crop-growing\"和定语从句\"most of which is already occupied by arable fields\"组成。\n\n**4. 语法**\n\n这个句子使用了现在时态，表达的是一种事实或常态。同时，使用了定语从句来描述主语。\n\n**5. 知识点总结**\n\n- 理解和使用\"suitable for\"、\"occupied by\"等词组。\n- 理解和使用特定领域的词汇，如\"crop-growing\"和\"arable fields\"。\n- 理解并运用定语从句来描述或限定主语。\n\n**6. 相似句子练习**\n\nOnly 30 per cent of the city's buildings are suitable for office space, most of which are already occupied by tech companies.\n\n只有30%的城市建筑适合作为办公空间使用，而其中大部分已经被科技公司占据。"},{"text":"Even if we converted all the suitable land to fields of fruit and veg – which would involve taking out all the nature reserves and removing thousands of people from their homes – we would achieve only a 30 per cent boost in crop production.","explainMd":"**1. 翻译**\n\n即使我们将所有适合的土地转化为水果和蔬菜的田地 - 这将涉及到清除所有的自然保护区并迁移成千上万的人 - 我们也只能将作物生产提高30%。\n\n**2. 重难点词汇和短语**\n\n- \"converted\": 转化，改变某物的形状、结构或功能。\n- \"suitable land\": 适合的土地，指的是适宜进行某种活动（如种植作物）的土地。\n- \"taking out\": 清除，移除，表示将某物从其原来的位置或状态中移开。\n- \"nature reserves\": 自然保护区，指的是为了保护和保存自然环境或特定种类的野生动植物而设立的区域。\n- \"boost in crop production\": 作物生产的增加，表示作物生产量的提升。\n\n**3. 句子结构**\n\n这是一个复合句，由条件状语从句\"Even if we converted all the suitable land to fields of fruit and veg\"，插入语\"which would involve taking out all the nature reserves and removing thousands of people from their homes\"，以及主句\"we would achieve only a 30 per cent boost in crop production\"组成。\n\n**4. 语法**\n\n这个句子使用了虚拟语气（the subjunctive mood），表达的是一种假设或未必会发生的情况。\n\n**5. 知识点总结**\n\n- 理解并使用\"converted\"、\"taking out\"、\"nature reserves\"等词组和词汇。\n- 理解并运用条件状语从句和插入语来构造复杂的句子。\n- 理解并使用虚拟语气来表达假设或可能性。\n\n**6. 相似句子练习**\n\nEven if we allocated all the budget to the education sector - which would involve cutting funds from other important sectors - we would only achieve a 20 per cent increase in the literacy rate.\n\n即使我们将所有的预算分配给教育部门 - 这将涉及削减其他重要部门的资金 - 我们也只能使识字率提高20%。"}]},{"sentences":[{"text":"Just 23 per cent of the fruit and vegetables consumed in the UK are currently home-grown, so even with the most extreme measures we could meet only 30 per cent of our fresh produce needs.","explainMd":"**1. 翻译**\n\n目前在英国消费的水果和蔬菜中，只有23%是本地种植的，所以即使我们采取最极端的措施，我们也只能满足30%的新鲜农产品需求。\n\n**2. 重难点词汇和短语**\n\n- \"consumed\": 消费，这里指的是食用。\n- \"home-grown\": 本地种植的，表示在本国或本地区种植和生产的。\n- \"extreme measures\": 极端的措施，表示做法或行动的强烈程度。\n- \"fresh produce needs\": 新鲜农产品需求，表示对新鲜农产品的需求或需求量。\n\n**3. 句子结构**\n\n这是一个复合句，由主句\"Just 23 per cent of the fruit and vegetables consumed in the UK are currently home-grown\"和结果状语从句\"so even with the most extreme measures we could meet only 30 per cent of our fresh produce needs\"组成。\n\n**4. 语法**\n\n这个句子使用了结果状语从句，来表示主句中的情况导致的结果。\n\n**5. 知识点总结**\n\n- 理解并使用\"consumed\"、\"home-grown\"、\"extreme measures\"和\"fresh produce needs\"等词组和词汇。\n- 理解并运用结果状语从句来构造句子。\n- 理解并使用百分比来表达比例。\n\n**6. 相似句子练习**\n\nOnly 15 per cent of the books read in the library are currently available in digital format, so even with the most aggressive digitization efforts, we could make only 40 per cent of our collection digitally accessible.\n\n在图书馆阅读的书籍中，目前只有15%是以数字格式提供的，所以即使我们采取最积极的数字化努力，我们也只能使我们的40%的藏书能以数字形式访问。"},{"text":"That is before we look for the space to grow the grains, sugars, seeds and oils that provide us with the vast bulk of our current calorie intake.","explainMd":"**1. 翻译**\n\n这还不包括我们寻找种植谷物、糖、种子和油类的空间，这些都为我们提供了当前大部分的卡路里摄入。\n\n**2. 重难点词汇和短语**\n\n- \"look for\": 寻找，表示要找到某样东西或某种情况。\n- \"grow\": 种植，表示在土地上种植植物或农作物。\n- \"the vast bulk of\": 大部分，表示某一数量的很大一部分。\n- \"current calorie intake\": 当前的卡路里摄入，表示人们在现在的生活中从食物中获取的能量。\n\n**3. 句子结构**\n\n这是一个简单句，主语是省略的\"We\"，谓语是\"is\"，宾语是\"before we look for the space to grow the grains, sugars, seeds and oils that provide us with the vast bulk of our current calorie intake\"。\n\n**4. 语法**\n\n这个句子使用了省略句的形式，即主语\"We\"被省略。同时，\"before\"引导的时间状语从句表达了主句发生的前提条件。\n\n**5. 知识点总结**\n\n- 理解并使用\"look for\"、\"grow\"、\"the vast bulk of\"和\"current calorie intake\"等词组和词汇。\n- 理解并运用省略句的形式来构造句子。\n- 理解并使用\"before\"引导的时间状语从句来表示前提条件。\n\n**6. 相似句子练习**\n\nThat is before we search for the resources to build the infrastructure that supports a large portion of our current urban development.\n\n这还不包括我们寻找建立基础设施的资源，这些基础设施支持了我们当前大部分的城市发展。"}]}],"title":""}