{"translate":"","paragraphs":[{"sentences":[{"text":"Although ethics classes are common around the world, scientists are unsure if their lessons can actually change behavior; evidence either way is weak, relying on contrived laboratory tests or sometimes unreliable self-reports.","explainMd":"**1. 翻译**\n\n\"尽管全世界都普遍开设了伦理学课程，但科学家们并不确定这些课程的教导能否真正改变行为；无论持哪种观点，证据都很弱，因为这些证据依赖于人为操控的实验室试验或者有时并不可靠的自我报告。\"\n\n**2. 重难点词汇和短语**\n\n- Ethics classes: 伦理学课程\n- Change behavior: 改变行为\n- Evidence either way is weak: 无论持哪种观点，证据都很弱\n- Relying on: 依赖于\n- Contrived laboratory tests: 人为操控的实验室试验\n- Unreliable self-reports: 不可靠的自我报告\n\n**3. 句子结构**\n\n这是一个复杂的句子，由两个主从句构成。主句是 \"Although ethics classes are common around the world, scientists are unsure if their lessons can actually change behavior\"，从句是 \"evidence either way is weak, relying on contrived laboratory tests or sometimes unreliable self-reports\"。\n\n**4. 语法**\n\n- \"Although ethics classes are common around the world\" 是一个让步状语从句，用以说明尽管伦理课程已经普遍，但科学家们对其效果仍然持怀疑态度。\n- \"scientists are unsure if their lessons can actually change behavior\" 是主句，其中 \"if their lessons can actually change behavior\" 是一个宾语从句，用以说明科学家们的不确定感来源。\n- \"evidence either way is weak\" 是一个独立的主句，表示无论如何，证据都相当微弱。\n- \"relying on contrived laboratory tests or sometimes unreliable self-reports\" 是一个现在分词短语作为状语，说明证据的不足是由于依赖于人为的实验或者不稳定的自我报告。\n\n**5. 知识点总结**\n\n- 让步状语从句用于表示尽管存在一种情况，但主句的内容仍然成立。\n- 宾语从句用于解释或具体说明主句中的某个动词或者形容词。\n- 现在分词短语可以用作状语，说明主句的动作是在什么情况下发生的。\n\n**6. 相似句子练习**\n\n\"Although fitness programs are popular everywhere, doctors are unsure if their effects can actually improve health; evidence either way is weak, relying on artificial experiments or sometimes inconsistent self-observations.\"\n\n\"尽管健身计划在各地都很受欢迎，但医生们并不确定这些计划的效果是否真的能改善健康状况；无论持哪种观点，证据都很弱，因为这些证据依赖于人为的实验或者有时不一致的自我观察。\""},{"text":"But a new study published in Cognition found that, in at least one real-world situation, a single ethics lesson may have had lasting effects.","explainMd":"**1. 翻译**\n\n\"然而，《认知》杂志上发表的一项新研究发现，在至少一个真实世界的情境中，一次伦理教育课程可能产生了持久的影响。\"\n\n**2. 重难点词汇和短语**\n\n- A new study: 一项新研究\n- Published in: 发表在\n- Cognition: 《认知》（杂志名）\n- In at least one real-world situation: 在至少一个真实世界的情境中\n- A single ethics lesson: 一次伦理教育课程\n- May have had lasting effects: 可能产生了持久的影响\n\n**3. 句子结构**\n\n这是一个较为简单的主句，主语是 \"a new study\"，谓语是 \"found\"，宾语是 \"that, in at least one real-world situation, a single ethics lesson may have had lasting effects\"，宾语中嵌套了一个状语从句 \"in at least one real-world situation\"。\n\n**4. 语法**\n\n- \"But\" 是一个转折连词，用于表示前后文之间的转折关系。\n- \"found that\" 是一个常用的动宾搭配，\"that\" 后面接的是一个宾语从句，用来说明 \"find\" 的具体内容。\n- \"in at least one real-world situation\" 是一个介词短语作为状语，用于限定 \"a single ethics lesson may have had lasting effects\" 这个动作的场景。\n\n**5. 知识点总结**\n\n- 转折连词可以用于表示两个句子或者句子内部的转折关系。\n- \"find that\" 是一个常用的动宾搭配，用于表示发现某个事实或者情况。\n- 介词短语可以用作状语，用于限定动词的时间、地点、方式等。\n\n**6. 相似句子练习**\n\n\"But a recent research published in Science proves that, in at least one practical context, a single math lesson could have a significant impact.\"\n\n\"然而，《科学》杂志上发表的一项最新研究证明，在至少一个实际的情境中，一次数学课程可能产生显著的影响。\""}]},{"sentences":[{"text":"The researchers investigated one class session's impact on eating meat.","explainMd":"**1. 翻译**\n\n\"研究人员调查了一次课程对吃肉行为的影响。\"\n\n**2. 重难点词汇和短语**\n\n- The researchers: 研究人员\n- Investigated: 调查了\n- One class session's impact: 一次课程的影响\n- On eating meat: 对吃肉行为\n\n**3. 句子结构**\n\n这是一个简单的主谓宾句子，主语是 \"The researchers\"，谓语是 \"investigated\"，宾语是 \"one class session's impact on eating meat\"。\n\n**4. 语法**\n\n- \"The researchers\" 是一个定冠词和名词的搭配，表示特定的研究人员。\n- \"Investigated\" 是一个动词，表示进行调查或者研究的动作。\n- \"One class session's impact on eating meat\" 是一个名词短语，其中 \"one class session's impact\" 是一个名词的所有格，表示 \"一次课程的影响\"，\"on eating meat\" 是一个介词短语，用于限定影响的对象是 \"吃肉行为\"。\n\n**5. 知识点总结**\n\n- 定冠词和名词的搭配可以表示特定的人或者事物。\n- \"Investigate\" 是一个常用的动词，表示进行调查或者研究的动作。\n- 名词的所有格可以表示所有关系，介词短语可以用于限定名词的具体情况。\n\n**6. 相似句子练习**\n\n\"The scientists explored the influence of one experiment on climate change.\"\n\n\"科学家们研究了一次实验对气候变化的影响。\""},{"text":"They chose this particular behavior for three reasons, according to study co-author Eric Schwitzgebel, a philosopher at the University of California, Riverside: students' attitudes on the topic are variable and unstable, behavior is easily measurable, and ethics literature largely agrees that eating less meat is good because it reduces environmental harm and animal suffering.","explainMd":"**1. 翻译**\n\n\"根据加利福尼亚大学河滨分校的哲学家、本研究的共同作者Eric Schwitzgebel的说法，他们选择了这个特定的行为进行研究，原因有三：学生们对这个话题的态度变化不定、不稳定，行为容易测量，而且伦理学文献普遍认为减少肉食是好的，因为它可以减少环境破坏和动物的痛苦。\"\n\n**2. 重难点词汇和短语**\n\n- Chose: 选择了\n- This particular behavior: 这个特定的行为\n- For three reasons: 有三个原因\n- According to: 根据\n- Study co-author: 研究的共同作者\n- Variable and unstable: 变化不定、不稳定\n- Easily measurable: 容易测量\n- Ethics literature: 伦理学文献\n- Largely agrees: 普遍认为\n- Reduces environmental harm and animal suffering: 减少环境破坏和动物的痛苦\n\n**3. 句子结构**\n\n这是一个复杂句子，主句是 \"They chose this particular behavior for three reasons\"，然后跟着一个以 \"according to\" 开头的短语来引出一段话，这段话中以冒号分隔了三个并列的原因。\n\n**4. 语法**\n\n- \"Chose\" 是一个过去时的动词，表示在过去选择了某个行为。\n- \"This particular behavior\" 是一个限定性名词词组，表示特定的行为。\n- \"For three reasons\" 是一个表示原因的介词短语。\n- \"According to\" 是一个表示依据或来源的介词。\n- \"Variable and unstable\" 是两个并列的形容词，用来描述 \"students' attitudes\"。\n- \"Easily measurable\" 是一个复合形容词，用来修饰 \"behavior\"。\n- \"Ethics literature largely agrees\" 是一个主语+谓语的结构，表示伦理学文献普遍认同的观点。\n\n**5. 知识点总结**\n\n- 过去时的动词用来表示过去的动作或状态。\n- 限定性名词词组用来表示特定的人或事物。\n- \"According to\" 可以引出某人的观点或解释。\n- 并列的形容词可以用来描述同一个名词。\n- 复合形容词可以用来修饰名词，增加描述的详细性。\n\n**6. 相似句子练习**\n\n\"They selected this specific experiment for two reasons, according to research co-author John Smith, a physicist at Harvard University: the results are consistent and reliable, and physics theories generally agree that using less energy is beneficial because it lowers carbon emissions.\"\n\n\"根据哈佛大学的物理学家、本研究的共同作者John Smith的说法，他们选择了这个特定的实验进行研究，原因有二：结果是一致的和可靠的，而且物理理论普遍认为减少能源使用是有益的，因为它可以降低碳排放。\""},{"text":"Half of the students in four large philosophy classes read an article on the ethics of factory-farmed meat, optionally watched an 11-minute video on the topic and joined a 50-minute discussion.","explainMd":"**1. 翻译**\n\n\"四个大哲学班级中的一半学生阅读了一篇关于工厂化养殖肉类的伦理问题的文章，可以选择观看一个关于这个话题的11分钟视频，并参加了一个50分钟的讨论。\"\n\n**2. 重难点词汇和短语**\n\n- Half of the students: 一半的学生\n- Four large philosophy classes: 四个大哲学班级\n- Read an article: 阅读了一篇文章\n- The ethics of factory-farmed meat: 工厂化养殖肉类的伦理问题\n- Optionally watched: 可以选择观看\n- An 11-minute video: 一个11分钟的视频\n- Joined a 50-minute discussion: 参加了一个50分钟的讨论\n\n**3. 句子结构**\n\n这是一个复杂句子，主句是 \"Half of the students in four large philosophy classes read an article\"，接着是两个并列的短语 \"optionally watched an 11-minute video\" 和 \"joined a 50-minute discussion\"，这两个短语都是描述学生们的行为。\n\n**4. 语法**\n\n- \"Half of the students\" 是一个表示一部分的名词词组，主语是 \"students\"，\"half of\" 是一个前置定语，表示 \"一半的\"。\n- \"Read\", \"watched\", \"joined\" 都是过去时的动词，表示在过去发生的行为。\n- \"Optionally watched\" 中的 \"optionally\" 是一个副词，用来修饰 \"watched\"，表示可以选择观看的动作。\n- \"Joined a 50-minute discussion\" 中的 \"a 50-minute discussion\" 是一个定语后置的名词词组，表示一个50分钟的讨论。\n\n**5. 知识点总结**\n\n- \"Half of\" 可以用来表示一部分的名词词组。\n- 过去时的动词用来表示在过去发生的动作或状态。\n- 副词可以用来修饰动词，表示动作的方式、程度、频率等。\n- 名词词组可以通过定语后置来增加描述的详细性。\n\n**6. 相似句子练习**\n\n\"Half of the employees in four large departments attended a seminar on workplace safety, optionally watched a 30-minute introductory video, and participated in a two-hour workshop.\"\n\n\"四个大部门中的一半员工参加了一个关于工作场所安全的研讨会，可以选择观看一个30分钟的入门视频，并参加了一个两小时的工作坊。\""},{"text":"The other half focused on charitable giving instead.","explainMd":"**1. 翻译**\n\n\"另一半学生则把重心放在了慈善捐赠上。\"\n\n**2. 重难点词汇和短语**\n\n- The other half: 另一半\n- Focused on: 把重心放在\n- Charitable giving: 慈善捐赠\n- Instead: 而不是\n\n**3. 句子结构**\n\n这是一个简单句，主句是 \"The other half focused on charitable giving\"，\"instead\" 是一个副词，表示对前文的转折。\n\n**4. 语法**\n\n- \"The other half\" 是一个表示一部分的名词词组，主语是 \"half\"，\"the other\" 是一个前置定语，表示 \"另一半的\"。\n- \"Focused on\" 是一个动词短语，表示 \"把重心放在\"。\n- \"Charitable giving\" 是一个名词，表示 \"慈善捐赠\"。\n- \"Instead\" 是一个副词，表示转折，用来与前文的内容形成对比。\n\n**5. 知识点总结**\n\n- \"The other\" 可以用来表示 \"另一部分的\"，通常与 \"half\" 等词搭配使用。\n- \"Focused on\" 是一个表示专注于某事的动词短语。\n- \"Charitable giving\" 是一个名词，表示 \"慈善捐赠\"。\n- \"Instead\" 是一个表示转折的副词，通常用来与前文的内容形成对比。\n\n**6. 相似句子练习**\n\n\"The other half concentrated on environmental protection instead.\"\n\n\"另一半人则把重心放在了环保上。\""},{"text":"Then, unknown to the students, the researchers studied their anonymized meal-card purchases for that semester— nearly 14,000 receipts for almost 500 students.","explainMd":"**1. 翻译**\n\n\"然后，学生们不知情的情况下，研究者们研究了他们那个学期的匿名餐卡消费——几乎有14000张收据，涵盖近500名学生。\"\n\n**2. 重难点词汇和短语**\n\n- Unknown to the students: 学生们不知情的情况下\n- The researchers studied: 研究者们研究了\n- Their anonymized meal-card purchases: 他们的匿名餐卡消费\n- For that semester: 那个学期的\n- Nearly 14,000 receipts: 几乎14000张收据\n- For almost 500 students: 涵盖近500名学生\n\n**3. 句子结构**\n\n这是一个复合句，主句是 \"The researchers studied their anonymized meal-card purchases for that semester\"，前面的 \"Then, unknown to the students,\" 是状语从句， \"nearly 14,000 receipts for almost 500 students.\" 是对主句的进一步说明。\n\n**4. 语法**\n\n- \"Unknown to the students\" 是一个形容词短语，起到状语的作用，表示 \"学生们不知情的情况下\"。\n- \"The researchers studied\" 是主句的主语和动词。\n- \"Their anonymized meal-card purchases for that semester\" 是动词的宾语，其中 \"their anonymized meal-card purchases\" 是主宾语，\"for that semester\" 是时间状语。\n- \"nearly 14,000 receipts for almost 500 students.\" 是对主句的进一步说明。\n\n**5. 知识点总结**\n\n- \"Unknown to somebody\" 是一个常用的形容词短语，表示 \"某人不知道的是\"。\n- \"Studied\" 是一个常用的动词，表示 \"研究\"。\n- \"Their anonymized meal-card purchases\" 是一个复合名词短语，表示 \"他们的匿名餐卡消费\"。\n- \"For that semester\" 是一个时间状语，表示 \"那个学期的\"。\n\n**6. 相似句子练习**\n\n\"Then, unknown to the employees, the management monitored their internet usage for that month—almost 10,000 logs for nearly 200 employees.\"\n\n\"然后，在员工们不知情的情况下，管理层监控了他们那个月的互联网使用情况——几乎有10000条记录，涵盖近200名员工。\""}]},{"sentences":[{"text":"Schwitzgebel predicted the intervention would have no effect; he had previously found that ethics professors do not differ from other professors on a range of behaviors, including voting rates, blood donation and returning library books.","explainMd":"**1. 翻译**\n\n\"施维茨格贝尔预测这种干预不会产生任何效果；他之前发现，就一系列行为来说，道德学教授并无其他教授有所不同，包括投票率、献血和归还图书等行为。\"\n\n**2. 重难点词汇和短语**\n\n- Schwitzgebel predicted: 施维茨格贝尔预测\n- The intervention: 这种干预\n- Would have no effect: 不会产生任何效果\n- He had previously found: 他之前发现\n- Ethics professors: 道德学教授\n- Do not differ from: 并无……有所不同\n- Other professors: 其他教授\n- On a range of behaviors: 就一系列行为来说\n- Including: 包括\n\n**3. 句子结构**\n\n这是一个复合句，主句是 \"Schwitzgebel predicted the intervention would have no effect\"，其后的部分是以分号连接的两个并列从句 \"he had previously found that ethics professors do not differ from other professors on a range of behaviors\" 和 \"including voting rates, blood donation and returning library books\"。\n\n**4. 语法**\n\n- \"Schwitzgebel predicted\" 是主句的主语和谓语。\n- \"The intervention would have no effect\" 是动词的宾语从句，其中 \"the intervention\" 是主语，\"would have no effect\" 是谓语。\n- \"He had previously found\" 是从句的主语和谓语。\n- \"That ethics professors do not differ from other professors on a range of behaviors\" 是动词的宾语从句，其中 \"ethics professors\" 是主语，\"do not differ from other professors on a range of behaviors\" 是谓语。\n- \"Including voting rates, blood donation and returning library books\" 是进一步说明 \"a range of behaviors\" 的短语。\n\n**5. 知识点总结**\n\n- \"Predicted\" 是一个常用动词，表示 \"预测\"。\n- \"Would have no effect\" 是一个模态动词和动词短语，表示 \"不会产生任何效果\"。\n- \"Had previously found\" 是一个过去完成时态的动词短语，表示 \"之前发现\"。\n- \"Do not differ from\" 是一个常用动词短语，表示 \"并无……有所不同\"。\n- \"Including\" 是一个常用的介词，表示 \"包括\"。\n\n**6. 相似句子练习**\n\n\"Smith anticipated the policy would make no difference; he had previously observed that the habits of students do not deviate from those of adults in a variety of aspects, including time management, reading habits and balance between work and leisure.\"\n\n\"史密斯预计这项政策不会产生任何差异；他之前观察到，在许多方面，学生的习惯并无成年人的习惯有所不同，包括时间管理、阅读习惯和工作与休闲的平衡。\""},{"text":"But among student subjects who discussed meat ethics, meal purchases containing meat decreased from 52 to 45 percent—and this effect held steady for the study's duration of several weeks.","explainMd":"**1. 翻译**\n\n\"但在讨论了肉类道德的学生中，购买含肉餐点的比例从52%降低到了45%——并且这种效果在研究的几周期间保持稳定。\"\n\n**2. 重难点词汇和短语**\n\n- But among student subjects who discussed meat ethics: 但在讨论了肉类道德的学生中\n- Meal purchases containing meat: 购买含肉餐点\n- Decreased from 52 to 45 percent: 从52%降低到了45%\n- This effect held steady: 这种效果保持稳定\n- For the study's duration of several weeks: 在研究的几周期间\n\n**3. 句子结构**\n\n这句话有两个主要部分。第一部分 \"But among student subjects who discussed meat ethics, meal purchases containing meat decreased from 52 to 45 percent\" 是一个完整的句子。第二部分 \"—and this effect held steady for the study's duration of several weeks\" 是一个插入语句，用破折号与前一部分隔开。\n\n**4. 语法**\n\n- \"But among student subjects who discussed meat ethics\" 是一个介词短语，作为句子的引导语。\n- \"Meal purchases containing meat decreased from 52 to 45 percent\" 是句子的主体，其中 \"meal purchases containing meat\" 是主语，\"decreased from 52 to 45 percent\" 是谓语。\n- \"And this effect held steady for the study's duration of several weeks\" 是并列的句子，其中 \"this effect\" 是主语，\"held steady for the study's duration of several weeks\" 是谓语。\n\n**5. 知识点总结**\n\n- \"But among student subjects who discussed meat ethics\" 是一个介词短语，用于引导整个句子，说明句子的背景。\n- \"Meal purchases containing meat\" 是一个名词短语，其中 \"containing meat\" 是一个现在分词短语，修饰 \"meal purchases\"。\n- \"Decreased from 52 to 45 percent\" 是一个动词短语，其中 \"from 52 to 45 percent\" 是一个介词短语，修饰 \"decreased\"。\n- \"This effect held steady for the study's duration of several weeks\" 是一个完整的句子，其中 \"held steady\" 是一个动词短语，表示 \"保持稳定\"。\n\n**6. 相似句子练习**\n\n\"But among participants who received the training, their performance improved from 60 to 70 percent—and this improvement remained consistent for the duration of a month.\"\n\n\"但在接受了训练的参与者中，他们的表现从60%提高到了70%——并且这种提升在一个月的期间内保持稳定。\""},{"text":"Purchases from the other group remained at 52 percent.","explainMd":"**1. 翻译**\n\n\"另一组的购买比例保持在52%。\"\n\n**2. 重难点词汇和短语**\n\n- Purchases: 购买\n- From the other group: 另一组的\n- Remained at: 保持在\n\n**3. 句子结构**\n\n这是一个简洁明了的句子，包括一个主语（Purchases from the other group）和一个谓语（remained at 52 percent）。\n\n**4. 语法**\n\n- \"Purchases from the other group\" 是主语，其中 \"from the other group\" 是一个介词短语，修饰 \"Purchases\"。\n- \"Remained at 52 percent\" 是谓语，其中 \"remained\" 是动词，\"at 52 percent\" 是介词短语，修饰 \"remained\"。\n\n**5. 知识点总结**\n\n- \"Purchases from the other group\" 中的 \"from the other group\" 是一个介词短语，作为主语的修饰语，说明了购买的来源。\n- \"Remained at 52 percent\" 是一个动词短语，其中 \"remained\" 表示状态的持续，\"at 52 percent\" 指定了这个状态的具体数值。\n\n**6. 相似句子练习**\n\n\"Scores from the other team stayed at 60 percent.\"\n\n\"另一队的得分保持在60%。\""}]},{"sentences":[{"text":"\"That's actually a pretty large effect for a pretty small intervention,\" Schwitzgebel says.","explainMd":"**1. 翻译**\n\n\"这实际上是一个相当小的干预产生的相当大的效果。\"施维茨格贝尔说。\n\n**2. 重难点词汇和短语**\n\n- That's: 那是\n- Actually: 实际上\n- A pretty large effect: 相当大的效果\n- For a pretty small intervention: 对于一个相当小的干预\n\n**3. 句子结构**\n\n这句话的结构相对简单，主要由一个主语（That's actually a pretty large effect）和一个介词短语（for a pretty small intervention）组成，介词短语在这里起到了表示原因或原因的作用。\n\n**4. 语法**\n\n- \"That's actually a pretty large effect\" 中，\"That's\" 是一个缩写，展开是 \"That is\"，\"actually\" 是副词，用于加强语气，\"a pretty large effect\" 是一个名词短语，作为 \"is\" 的宾语。\n- \"For a pretty small intervention\" 是一个介词短语，\"for\" 是介词，后面接名词短语 \"a pretty small intervention\"，整个介词短语作为状语，表示原因。\n\n**5. 知识点总结**\n\n- \"That's\" 是一个常用的缩写，表示 \"That is\"。\n- \"Actually\" 是一个副词，常用于加强语气。\n- \"For a pretty small intervention\" 是一个介词短语，介词 \"for\" 后面接名词短语作为介词宾语，整个介词短语在句中作为状语使用。\n\n**6. 相似句子练习**\n\n\"That's actually a huge improvement for such a small change.\" \n\n\"这实际上是对于如此小的变化产生的巨大改进。\""},{"text":"Psychologist Nina Strohminger at the University of Pennsylvania, who was not involved in the study, says she wants the effect to be real but cannot rule out some unknown confounding variable.","explainMd":"**1. 翻译**\n\n宾夕法尼亚大学的心理学家Nina Strohminger，虽然没有参与这项研究，但她表示她希望这种效果是真实的，但不能排除一些未知的混杂变量。\n\n**2. 重难点词汇和短语**\n\n- Psychologist: 心理学家\n- Involved: 参与\n- Effect: 效果\n- Real: 真实的\n- Rule out: 排除\n- Unknown: 未知的\n- Confounding variable: 混杂变量\n\n**3. 句子结构**\n\n这句话的结构比较复杂，主要包括一个主句（Psychologist Nina Strohminger at the University of Pennsylvania... says she wants the effect to be real but cannot rule out some unknown confounding variable.）和一个非限制性定语从句（who was not involved in the study）。\n\n**4. 语法**\n\n- 主句中，\"Psychologist Nina Strohminger at the University of Pennsylvania\" 是主语，\"says\" 是谓语，后面接宾语从句 \"she wants the effect to be real but cannot rule out some unknown confounding variable\"，宾语从句中含有两个并列的句子，分别是 \"she wants the effect to be real\" 和 \"cannot rule out some unknown confounding variable\"。\n- 非限制性定语从句 \"who was not involved in the study\" 用来对主语进行补充说明，\"who\" 在从句中作主语，\"was not involved in the study\" 是谓语。\n\n**5. 知识点总结**\n\n- \"Psychologist Nina Strohminger at the University of Pennsylvania\" 是一个名词短语，其中 \"at the University of Pennsylvania\" 是一个介词短语作为后置定语，用来修饰 \"Psychologist Nina Strohminger\"。\n- \"says\" 后面接宾语从句，宾语从句中含有并列结构，用 \"but\" 连接。\n- \"who was not involved in the study\" 是一个非限制性定语从句，用来对主语进行补充说明。\n\n**6. 相似句子练习**\n\nProfessor Li at Beijing University, who was not involved in the project, says he believes the results but cannot rule out the potential bias.\n\n\"北京大学的李教授，虽然没有参与这个项目，但他表示他相信这个结果，但不能排除潜在的偏见。\""},{"text":"And if real, she notes, it might be reversible by another nudge:\"Easy come, easy go.\"","explainMd":"**1. 翻译**\n\n如果这个效果是真实的，她指出，那么可能会被另一个小推动所逆转：\"来得快，去得也快。\"\n\n**2. 重难点词汇和短语**\n\n- Real: 真实的\n- Notes: 指出\n- Reversible: 可逆的\n- Nudge: 小推动，暗示\n- Easy come, easy go: 来得快，去得也快\n\n**3. 句子结构**\n\n\"And if real, she notes, it might be reversible by another nudge:'Easy come, easy go.'\"主句的主语是\"it\"，谓语是\"might be reversible by another nudge\"，\"And if real\"是条件状语从句，\"she notes\"是插入语。\n\n**4. 语法**\n\n- \"And if real\"是条件状语从句，\"if\"后面可以接形容词作为省略句，这里\"real\"省略了\"is\"。\n- \"She notes\"是插入语，用来说明主语的观点或态度，插入语可以放在句首、句中或句尾。\n- \"Might be reversible by another nudge\"是被动语态，\"by\"后面接动作的执行者。\n\n**5. 知识点总结**\n\n- \"And if real\"是条件状语从句的省略，\"if\"后面可以接形容词，省略了\"is\"。\n- 插入语可以放在句首、句中或句尾，用来说明主语的观点或态度。\n- \"Might be reversible by another nudge\"是被动语态，\"by\"后面接动作的执行者。\n\n**6. 相似句子练习**\n\nAnd if true, he observes, it might be challenged by another theory: \"Nothing is set in stone.\"\n\n\"如果这个理论是真实的，他观察到，可能会被另一种理论所挑战：'没有什么是一成不变的。'\""}]},{"sentences":[{"text":"Schwitzgebel suspects the greatest impact came from social influence— classmates or teaching assistants leading the discussions may have shared their own vegetarianism, showing it as achievable or more common.","explainMd":"**1. 翻译**\n\n施维茨格尔怀疑最大的影响来自社会影响——带领讨论的同学或助教可能分享了他们自己的素食主义，展示出这是可以实现的，或者更常见的。\n\n**2. 重难点词汇和短语**\n\n- Suspects: 怀疑\n- Impact: 影响\n- Social influence: 社会影响\n- Classmates or teaching assistants: 同学或助教\n- Shared: 分享\n- Vegetarianism: 素食主义\n- Achievable: 可以实现的\n- Common: 常见的\n\n**3. 句子结构**\n\n\"Schwitzgebel suspects the greatest impact came from social influence\"是主句，\"classmates or teaching assistants leading the discussions may have shared their own vegetarianism\"是定语从句，用来修饰\"social influence\"，\"showing it as achievable or more common\"是非谓语动词短语，作为结果状语。\n\n**4. 语法**\n\n- \"Schwitzgebel suspects the greatest impact came from social influence\"是主句，其中\"came from\"表示\"来源于\"，\"the greatest impact\"做主语。\n- \"Classmates or teaching assistants leading the discussions may have shared their own vegetarianism\"是定语从句，\"leading the discussions\"是现在分词短语作定语，修饰\"classmates or teaching assistants\"。\n- \"showing it as achievable or more common\"是非谓语动词短语，\"showing\"是现在分词，表示结果。\n\n**5. 知识点总结**\n\n- \"came from\"表示\"来源于\"。\n- 现在分词短语可以作定语，修饰名词。\n- 现在分词短语还可以表示结果。\n\n**6. 相似句子练习**\n\nThe teacher believes the best learning comes from active participation—students actively involved in the discussions may have improved their understanding, demonstrating it as possible and even preferable.\n\n\"老师认为最好的学习来自于主动参与——积极参与讨论的学生可能提高了他们的理解，展示出这是可能的，甚至是更好的。\""},{"text":"Second,the video may have had an emotional impact.","explainMd":"**1. 翻译**\n\n其次，视频可能产生了情感影响。\n\n**2. 重难点词汇和短语**\n\n- Second: 其次\n- The video: 视频\n- May have had: 可能有\n- An emotional impact: 情感影响\n\n**3. 句子结构**\n\n这是一个简单句。主语是\"the video\"，谓语是\"may have had\"，宾语是\"an emotional impact\"。\n\n**4. 语法**\n\n- \"may have had\" 是一个表示对过去事情的推测或可能性的语法结构，\"may\"表示可能性，\"have had\"是现在完成时，表示过去发生的事情对现在可能有的影响。\n- \"an emotional impact\"是一个名词短语，\"an\"是不定冠词，\"emotional\"是形容词，修饰\"impact\"。\n\n**5. 知识点总结**\n\n- \"may have had\"是一个表示对过去事情的推测或可能性的语法结构。\n- 形容词可以修饰名词。\n\n**6. 相似句子练习**\n\nMoreover, the lecture might have had a profound influence.\n\n\"此外，这次讲座可能产生了深远的影响。\""},{"text":"Least rousing, he thinks, was rational argument, although his co-authors say reason might play a bigger role.","explainMd":"**1. 翻译**\n\n他认为最不激动人心的是理性论证，尽管他的合作者们认为理性可能会发挥更大的作用。\n\n**2. 重难点词汇和短语**\n\n- Least rousing: 最不激动人心的\n- Rational argument: 理性论证\n- Although: 尽管\n- Co-authors: 合作者们\n- Might play a bigger role: 可能会发挥更大的作用\n\n**3. 句子结构**\n\n这是一个复合句。主句是\"Least rousing, he thinks, was rational argument\"，从句是\"although his co-authors say reason might play a bigger role\"。\n\n**4. 语法**\n\n- \"Least rousing\"是最高级形式，表示在比较中最不激动人心的。\n- \"Although\"引导让步状语从句，表示尽管有某种情况，但主句的情况依然存在。\n- \"Might play\"是对未来可能性的推测，\"might\"表示可能性。\n\n**5. 知识点总结**\n\n- 使用最高级形式来表示在比较中的最极端情况。\n- \"Although\"可引导让步状语从句，表示尽管有某种情况，但主句的情况依然存在。\n- \"Might\"可用于对未来可能性的推测。\n\n**6. 相似句子练习**\n\nLeast effective, she believes, was direct advertising, although her colleagues argue it might have a greater influence.\n\n\"她认为最不有效的是直接广告，尽管她的同事们认为它可能会产生更大的影响。\""},{"text":"Now the researchers are probing the specific effects of teaching style, teaching assistants' eating habits and students' video exposure.","explainMd":"**1. 翻译**\n\n现在，研究者们正在探究教学风格、助教的饮食习惯以及学生接触视频的具体影响。\n\n**2. 重难点词汇和短语**\n\n- Probing: 探究\n- The specific effects: 具体影响\n- Teaching style: 教学风格\n- Teaching assistants' eating habits: 助教的饮食习惯\n- Students' video exposure: 学生接触视频\n\n**3. 句子结构**\n\n这是一个简单句。主语是\"the researchers\"，谓语是\"are probing\"，宾语是\"the specific effects of teaching style, teaching assistants' eating habits and students' video exposure\"。\n\n**4. 语法**\n\n- \"Probing\"是现在进行时的动词形式，表示正在进行的动作。\n- \"The specific effects of\"是一个复合名词短语，\"of\"后面是三个并列的名词短语，分别是\"teaching style\", \"teaching assistants' eating habits\"和\"students' video exposure\"。\n\n**5. 知识点总结**\n\n- 现在进行时可以表示正在进行的动作。\n- \"of\"可以用来连接名词，形成复合名词短语。\n\n**6. 相似句子练习**\n\nNow the scientists are investigating the specific impacts of climate change, human activities and natural disasters.\n\n\"现在，科学家们正在研究气候变化、人类活动以及自然灾害的具体影响。\""},{"text":"Meanwhile Schwitzgebel—who had predicted no effect—will be eating his words.","explainMd":"**1. 翻译**\n\n与此同时，施维茨格贝尔——他原本预测这个干预将没有效果——将不得不承认他的预测是错的。\n\n**2. 重难点词汇和短语**\n\n- Meanwhile: 与此同时\n- Had predicted: 原本预测\n- No effect: 没有效果\n- Will be eating his words: 将不得不承认他的预测是错的（这是一种比喻表达，字面意思是“吞下自己的话”，实际上指的是承认自己说错了）\n\n**3. 句子结构**\n\n这是一个复杂句。主句是\"Meanwhile Schwitzgebel will be eating his words\"，其中有一个非限制性定语从句\"who had predicted no effect\"用于修饰施维茨格贝尔。\n\n**4. 语法**\n\n- \"Meanwhile\"是一个副词，表示同时发生的动作。\n- \"Had predicted\"是过去完成时，表示在过去某个时间点之前已经完成的动作。\n- \"Will be eating his words\"是将来进行时，表示将来正在进行的动作。\n- \"Who had predicted no effect\"是一个非限制性定语从句，用来描绘主语施维茨格贝尔。\n\n**5. 知识点总结**\n\n- \"Meanwhile\"可以用来连接同时发生的两个事件。\n- 过去完成时表示在过去某个时间点之前已经完成的动作。\n- 将来进行时表示将来正在进行的动作。\n- 非限制性定语从句可以用来描绘主语，提供额外信息。\n\n**6. 相似句子练习**\n\nMeanwhile, John—who had claimed he wouldn't be moved by the movie—will be wiping his tears.\n\n\"与此同时，约翰——他原本声称他不会被电影感动——将不得不擦拭他的眼泪。\""}]}],"title":""}