{"translate":"","paragraphs":[{"sentences":[{"text":"Enlightening, challenging, stimulating, fun.These were some of the words that Nature readers used to describe their experience of art-science collaborations in a series of articles on partnerships between artists and researchers.","explainMd":"**1. 翻译 **\n\n\"启发性的，富有挑战性的，刺激性的，有趣的。这些是 Nature 杂志读者用来描述他们在一系列关于艺术家和研究者合作的文章中体验的一些词语。\"\n\n**2. 词汇和短语**\n\n- **Enlightening**: 启发性的\n- **challenging**: 富有挑战性的\n- **stimulating**: 刺激性的\n- **fun**: 有趣的\n- **These were some of the words**: 这些是一些词语\n- **Nature readers**: Nature 杂志的读者\n- **used to describe**: 用来描述\n- **their experience of art-science collaborations**: 他们在艺术与科学合作中的体验\n- **in a series of articles**: 在一系列文章中\n- **on partnerships between artists and researchers**: 关于艺术家和研究者之间的合作\n\n**3. 句子结构**\n\n这句话的结构相对简单，由两个主要部分组成：\"Enlightening, challenging, stimulating, fun\" 是列举部分，描述了读者对艺术和科学合作的体验；\"These were some of the words that Nature readers used to describe their experience of art-science collaborations in a series of articles on partnerships between artists and researchers\" 是主句，概述了这些词语的来源和使用环境。\n\n**4. 语法**\n\n这个句子的主要语法特点是使用过去时态来描述 Nature 杂志读者对艺术和科学合作的体验，并使用了一系列形容词来形象地描绘这种体验。\n\n**5. 知识点总结**\n\n- 使用形容词来形象地描述体验。\n- 使用过去时态来描述过去的事件。\n- 如何在句子中正确使用一系列的词语。\n\n**6. 相似句子练习**\n\n\"Innovative, exciting, rewarding, satisfying. These were some of the words that customers used to describe their experience of using our new product in a series of reviews.\"\n\n\"创新的，激动人心的，有回报的，令人满意的。这些是客户在一系列评论中用来描述他们使用我们新产品体验的一些词语。\""},{"text":"Nearly 40% of the roughly 350 people who responded to an accompanying poll said, they had collaborated with artists; and almost all said they would consider doing so in future.","explainMd":"**1. 翻译**\n\n\"在回答相关投票的大约350人中，近40%的人表示他们曾与艺术家合作过，几乎所有人都表示他们会考虑在未来继续这样做。\"\n\n**2. 词汇和短语**\n\n- **Nearly 40%**: 近40%\n- **of the roughly 350 people**: 在大约350人中\n- **who responded to an accompanying poll**: 参与了相关投票的\n- **said, they had collaborated with artists**: 表示他们曾与艺术家合作过\n- **and almost all said they would consider doing so in future**: 并且几乎所有人都表示他们会考虑在未来继续这样做\n\n**3. 句子结构**\n\n这个句子是一个复合句，由两个主要的子句组成：第一个子句是 \"Nearly 40% of the roughly 350 people who responded to an accompanying poll said, they had collaborated with artists\"，描述了参与投票的人中有多少人曾经与艺术家合作过；第二个子句是 \"and almost all said they would consider doing so in future\"，描述了这些人中有多少人会考虑在未来与艺术家合作。\n\n**4. 语法**\n\n这个句子的主要语法特点是使用了过去时态来描述过去的事件（人们与艺术家的合作），并使用了将来时态来描述未来可能发生的事件（人们会考虑在未来与艺术家合作）。\n\n**5. 知识点总结**\n\n- 如何在句子中使用合适的时态来描述过去和未来的事件。\n- 如何在一个复合句中同时使用两种不同的时态。\n- 如何使用百分比来描述统计数据。\n\n**6. 相似句子练习**\n\n\"Nearly 60% of the roughly 500 employees in our company said, they had taken part in team-building activities; and almost all said they would consider doing so in future.\"\n\n\"在我们公司大约500名员工中，近60%的人表示他们参与过团队建设活动，几乎所有人都表示他们会考虑在未来继续这样做。\""}]},{"sentences":[{"text":"Such an encouraging results is not surprising.","explainMd":"**1. 翻译**\n\n\"这样的令人鼓舞的结果并不令人意外。\"\n\n**2. 词汇和短语**\n\n- **Such**: 这样的\n- **an encouraging results**: 一个积极的结果\n- **is not surprising**: 并不令人意外\n\n**3. 句子结构**\n\n这个句子是一个简单的陈述句，主要由一个主语（\"Such an encouraging results\"）和一个谓语（\"is not surprising\"）组成。\n\n**4. 语法**\n\n这个句子的主要语法特点是使用了现在时态来描述一个持续存在的状态（这个积极的结果并不令人意外）。\n\n**5. 知识点总结**\n\n- 如何在句子中使用合适的时态来描述现在的状态。\n- 如何使用形容词 (\"encouraging\", \"surprising\") 来形容名词 (\"results\")。\n\n**6. 相似句子练习**\n\n\"Such a high score is not surprising.\"\n\n\"这样的高分并不令人意外。\""},{"text":"Scientists are increasingly seeking out visual artists to help them communicate their work to new audiences.","explainMd":"**1. 翻译**\n\n\"科学家们越来越多地寻求视觉艺术家的帮助，以便将他们的工作传达给新的观众群体。\"\n\n**2. 词汇和短语**\n\n- **Scientists**: 科学家们\n- **are increasingly seeking out**: 越来越多地寻求\n- **visual artists**: 视觉艺术家\n- **to help them communicate**: 帮助他们传达\n- **their work**: 他们的工作\n- **to new audiences**: 给新的观众群体\n\n**3. 句子结构**\n\n这个句子是一个简单的陈述句，主要由一个主语（\"Scientists\"）和一个谓语（\"are increasingly seeking out visual artists\"）以及一个目的状语（\"to help them communicate their work to new audiences\"）组成。\n\n**4. 语法**\n\n这个句子的主要语法特点是使用了现在进行时态来描述一个正在进行的动作（科学家们正在寻求视觉艺术家的帮助）。\n\n**5. 知识点总结**\n\n- 如何在句子中使用合适的时态来描述正在进行的动作。\n- 如何使用短语 (\"seeking out\", \"to help\") 来描述动作。\n- 如何使用目的状语来描述动作的目的。\n\n**6. 相似句子练习**\n\n\"Teachers are increasingly seeking out digital tools to help them educate their students.\"\n\n\"教师们越来越多地寻求数字工具来帮助他们教育学生。\""},{"text":"“Artists help scientists reach a broader audience and make emotional connections that enhance learning ” One respondent said.","explainMd":"**1. 翻译 (结合全文整体意思)**\n\n\"艺术家帮助科学家接触到更广泛的受众，并建立增强学习的情感联系，\"一位受访者说。\n\n**2. 词汇和短语**\n\n- **Artists**: 艺术家\n- **help**: 帮助\n- **scientists**: 科学家\n- **reach a broader audience**: 接触到更广泛的受众\n- **and make emotional connections**: 并建立情感联系\n- **that enhance learning**: 增强学习\n- **One respondent said**: 一位回应者说\n\n**3. 句子结构**\n\n这个句子是一个简单的陈述句，主要由一个主语（\"Artists\"）和一个谓语（\"help scientists\"）以及一个宾语（\"reach a broader audience and make emotional connections that enhance learning\"）组成。句子的后半部分是一个直接引述（\"One respondent said\"）。\n\n**4. 语法**\n\n这个句子的主要语法特点是使用了现在时态来描述一个持续存在的状态（艺术家帮助科学家）。句子的后半部分是一个直接引述，用来表示某人的观点或言论。\n\n**5. 知识点总结**\n\n- 如何在句子中使用合适的时态来描述现在的状态。\n- 如何使用直接引述来表示某人的观点或言论。\n- 如何使用短语 (\"reach a broader audience\", \"make emotional connections\", \"enhance learning\") 来描述动作。\n\n**6. 相似句子练习**\n\n\"Books help students expand their knowledge and stimulate their imaginations,\" one teacher said.\n\n\"书籍帮助学生扩大知识面，激发他们的想象力，\"一位老师这样说。"}]},{"sentences":[{"text":"One example of how artists and scientists have together rocked the scenes came last month when the Sydney Symphony Orchestra performed a reworked version of Antonio Vivaldi’s The Four Seasons.","explainMd":"**1. 翻译**\n\n上个月，悉尼交响乐团演出了重制版的安东尼奥·维瓦尔第的《四季》，这就是艺术家和科学家一起震撼世界的一个例子。\n\n**2. 词汇和短语**\n\n- **One example**: 一个例子\n- **of how artists and scientists have together rocked the scenes**: 艺术家和科学家如何联手引发了一场震撼的表演\n- **came last month when**: 就在上个月，当…\n- **the Sydney Symphony Orchestra**: 悉尼交响乐团\n- **performed a reworked version of**: 演奏了重新改编的版本\n- **Antonio Vivaldi’s The Four Seasons**: 安东尼奥·维瓦尔第的《四季》\n\n**3. 句子结构**\n\n这是一个复合句。主句是\"One example of how artists and scientists have together rocked the scenes came last month\"，接着是一个时间状语从句\"when the Sydney Symphony Orchestra performed a reworked version of Antonio Vivaldi’s The Four Seasons\"。\n\n**4. 语法**\n\n这个句子的主要语法结构是时间状语从句，用来描述主句中的事件发生的时间。\"when\"用来引导这个时间状语从句，描述了主句中的\"example\"的具体情况。\n\n**5. 知识点总结**\n\n- 时间状语从句的使用，用来描述事件发生的时间。\n- \"of\"的使用，用来表达所有格，描述一件事的具体情况。\n- 合适的时态的使用（这里是过去时）来描述过去的事件。\n\n**6. 相似句子练习**\n\n\"An illustration of how teachers and students can jointly create a learning atmosphere was last semester when the class presented a play adapted from Shakespeare's Romeo and Juliet.\"\n\n\"教师和学生如何共同创造学习氛围的一个例子在上个学期，当班级呈现了一个改编自莎士比亚的《罗密欧与朱丽叶》的戏剧。\""},{"text":"They reimagined the 300-year-old score by injecting the latest climate prediction data for each season-provided by Monash University’ s Climate Change Communication Research Hub.The performance was a creative call to action ahead of November’s United Nations Climate Change Conference in Glasgow, UK.","explainMd":"**1. 翻译**\n\n\"他们重新想象了这个有300年历史的乐谱，通过注入莫纳什大学气候变化传播研究中心提供的最新季节性气候预测数据。这场表演是在11月的英国格拉斯哥联合国气候变化会议前的一个富有创造力的呼吁采取行动。\"\n\n**2. 词汇和短语**\n\n- **They reimagined the 300-year-old score**: 他们重新想象了这个有300年历史的乐谱\n- **by injecting the latest climate prediction data for each season**: 通过注入最新季节性气候预测数据\n- **provided by Monash University’s Climate Change Communication Research Hub**: 莫纳什大学气候变化传播研究中心提供的\n- **The performance was a creative call to action**: 这场表演是一个富有创造力的行动呼吁\n- **ahead of November’s United Nations Climate Change Conference in Glasgow, UK**: 在11月的英国格拉斯哥联合国气候变化会议前\n\n**3. 句子结构**\n\n这是一个复合句。主句是\"They reimagined the 300-year-old score by injecting the latest climate prediction data for each season\"，接着是一个由\"provided by\"引导的定语从句用来修饰\"data\"，然后是一个独立句子\"The performance was a creative call to action ahead of November’s United Nations Climate Change Conference in Glasgow, UK\"。\n\n**4. 语法**\n\n这个句子的主要语法结构是定语从句的使用，用来对\"data\"进行修饰。\"provided by\"引导这个定语从句，描述\"data\"的来源。此外，\"by injecting the latest climate prediction data for each season\"是一个由\"by\"引导的方式状语从句，描述\"reimagined\"的方式。\n\n**5. 知识点总结**\n\n- 定语从句的使用，修饰名词，提供更详细的信息。\n- 方式状语从句的使用，描述动作的方式或手段。\n- 合适的时态的使用（这里是过去时）来描述过去的事件。\n\n**6. 相似句子练习**\n\n\"They reinterpreted the classic novel by incorporating the latest social trends provided by the University's Social Studies Research Center. The publication was a timely commentary ahead of the National Social Sciences Conference.\"\n\n\"他们通过融入大学社会研究中心提供的最新社会趋势，重新解读了这部经典小说。这部出版物是在全国社会科学会议之前的及时评论。\""}]},{"sentences":[{"text":"But a genuine partnership must be a two-way street.","explainMd":"**1. 翻译**\n\n\"但是，真正的合作必须是双方都投入的。\"\n\n**2. 词汇和短语**\n\n- **But**: 但是，用来引导转折。\n- **a genuine partnership**: 真正的合作，\"genuine\"表示真实、真正，\"partnership\"表示合作、伙伴关系。\n- **must be**: 必须是，表示必要条件。\n- **a two-way street**: 双向街道，这里用来比喻双方都需要投入、付出的关系。\n\n**3. 句子结构**\n\n这是一个简单句，主语是\"a genuine partnership\"，谓语是\"must be\"，宾语是\"a two-way street\"。\n\n**4. 语法**\n\n这个句子的语法结构非常简单，是一个基本的主谓宾结构。\"must be\"表示必要条件。\n\n**5. 知识点总结**\n\n- 使用合适的连接词（如\"But\"）来表达转折的关系。\n- 使用形象的短语（如\"a two-way street\"）来表示抽象的概念（如双方的合作）。\n- 使用\"must be\"来表达必要条件。\n\n**6. 相似句子练习**\n\n\"A successful team must be a balanced scale.\"\n\n\"一个成功的团队必须是一个平衡的天平。\""},{"text":"Fewer artist than scientists responded to the Nature pol1, however, several respondents noted that artists do not simply assist scientists with their communication requirements.","explainMd":"**1. 翻译 (结合全文整体意思)**\n\n对于《自然》杂志的调查，响应的艺术家比科学家少，然而，有好几位回复者指出，艺术家并不仅仅是帮助科学家满足他们的交流需求。\n\n**2. 词汇和短语**\n\n- **Fewer artist than scientists**: 艺术家比科学家少。这里的\"fewer\"用于比较数量。\n- **responded to the Nature poll**: 回应了《自然》杂志的调查。\"Responded to\"表示回应，\"Nature poll\"指的是《自然》杂志的调查。\n- **however**: 然而，表示转折。\n- **several respondents noted**: 几位回应者指出。\"Respondents\"指的是回应调查的人，\"noted\"是指出的意思。\n- **artists do not simply assist scientists with their communication requirements**: 艺术家并不仅仅是帮助科学家满足他们的交流需求。\"Simply\"表示仅仅，\"assist\"意为帮助，\"communication requirements\"是交流需求。\n\n**3. 句子结构**\n\n这是一个由两个主从句构成的复合句。主句是\"Fewer artist than scientists responded to the Nature poll\"，从句是\"several respondents noted that artists do not simply assist scientists with their communication requirements\"，两者由转折连接词\"however\"连接。\n\n**4. 语法**\n\n这句话主要使用了比较级结构\"Fewer artist than scientists\"和宾语从句\"that artists do not simply assist scientists with their communication requirements\"。\n\n**5. 知识点总结**\n\n- 使用\"fewer...than...\"进行数量比较。\n- 使用\"however\"进行转折表达。\n- 使用\"noted that...\"引导宾语从句，表达他人的观点。\n\n**6. 相似句子练习**\n\n\"Fewer students than teachers attended the meeting, however, several participants pointed out that students do not just assist teachers in managing the class.\"\n\n\"参加会议的学生比老师少，然而，有几位参与者指出，学生并不仅仅是帮助老师管理班级。\""},{"text":"Nor should their work be considered only as an object of study.","explainMd":"**1. 翻译**\n\n他们的作品也不应被仅仅视为研究的对象。\n\n**2. 词汇和短语**\n\n- **Nor**: 也不，用于否定句中，表示进一步的否定。\n- **should**: 应当，表示建议或者命令。\n- **their work**: 他们的作品，指代艺术家的艺术创作。\n- **be considered only as**: 被仅仅视为，\"consider as\"表示把...看作是...。\n- **an object of study**: 研究的对象，\"object of study\"表示研究的目标或对象。\n\n**3. 句子结构**\n\n这是一个否定的简单句，主语是\"their work\"，谓语是\"should not be considered only as\"，宾语是\"an object of study\"。\n\n**4. 语法**\n\n这句话主要使用了\"should not\"表示否定建议，\"be considered as\"表示被视为。\n\n**5. 知识点总结**\n\n- 使用\"nor\"在否定句中进行进一步的否定。\n- \"should not\"表示否定的建议或命令。\n- \"be considered as\"表示被看作是...。\n\n**6. 相似句子练习**\n\n\"Nor should their effort be seen only as a means to an end.\"\n\n\"他们的努力也不应该仅被看作是达成目标的手段。\""},{"text":"The alliances are most valuable when scientists and artists have a shared stake in a project, are able to jointly design it and can critique each other’s work.","explainMd":"**1. 翻译**\n\n当科学家和艺术家在一个项目中有共同的利益，能够共同设计它并能够相互批评各自的工作时，这种联盟最有价值。\n\n**2. 词汇和短语**\n\n- **alliances**: 联盟，这里指的是科学家与艺术家的合作关系。\n- **most valuable**: 最有价值的。\n- **shared stake**: 共享的利益或者投入。\n- **project**: 项目，这里指的是科学家和艺术家共同进行的项目。\n- **jointly design**: 共同设计。\n- **critique each other's work**: 互相批评各自的工作。\n\n**3. 句子结构**\n\n这是一个复合句，主干是\"The alliances are most valuable\"，后面接的是三个并列的when引导的时间状语从句，分别是\"scientists and artists have a shared stake in a project\"，\"are able to jointly design it\"，和\"can critique each other’s work\"。\n\n**4. 语法**\n\n- 使用了when引导的时间状语从句，描述联盟最有价值的条件或时间。\n- 使用了并列结构，把三个条件并列起来。\n\n**5. 知识点总结**\n\n- 使用when引导的时间状语从句来描述某个动作发生的条件或时间。\n- 使用并列结构来列举多个并列的条件或情况。\n\n**6. 相似句子练习**\n\n\"The team is most effective when members share a common goal, can collaborate efficiently, and provide constructive feedback to each other.\"\n\n\"当团队成员有共同的目标，能够有效合作，并能向彼此提供建设性反馈时，团队最有效。\""},{"text":"Such an approach can both prompt new research as well as result in powerful art.","explainMd":"**1. 翻译 **\n\n这种方式既可以激发新的研究，也可以产生强大的艺术作品。\n\n**2. 词汇和短语**\n\n- **Such an approach**: 这种方式，这里指的是艺术家和科学家的合作方式。\n- **can both**: 既可以...也可以...，用于并列两个或多个可能的结果。\n- **prompt new research**: 激发新的研究。\n- **result in**: 导致，产生，通常后接结果或影响。\n- **powerful art**: 强大的艺术作品。\n\n**3. 句子结构**\n\n这是一个简单句，主语是\"Such an approach\"，谓语是\"can both prompt new research and result in powerful art\"。\n\n**4. 语法**\n\n- 使用了\"can both...and...\"结构来并列两个可能的结果。\n- \"result in\"后接结果或影响。\n\n**5. 知识点总结**\n\n- \"can both...and...\"结构用于并列两个或多个可能的结果。\n- \"result in\"用于表示因果关系，后接结果或影响。\n\n**6. 相似句子练习**\n\n\"Such a strategy can both improve customer satisfaction and boost sales.\"\n\n\"这种策略既可以提高客户满意度，也可以提升销售额。\""}]},{"sentences":[{"text":"More than half a century ago, the Massachusetts Institute of Technology opened its Center for Advanced Visual Studies (CAVS) to explore the role of technology in culture.","explainMd":"**1. 翻译**\n\n半个世纪前，麻省理工学院开设了先进视觉研究中心（CAVS），以探索技术在文化中的作用。\n\n**2. 词汇和短语**\n\n- **More than half a century ago**: 半个世纪前，用来表达很长时间以前。\n- **the Massachusetts Institute of Technology**: 麻省理工学院，全球著名的科技研究型大学。\n- **opened its Center for Advanced Visual Studies (CAVS)**: 开设了先进视觉研究中心(CAVS)，表示某个机构设立了一个新的部门或中心。\n- **to explore**: 以探索，表示为了达到某个目的而做某事。\n- **the role of technology in culture**: 技术在文化中的角色，说明技术对文化的影响和作用。\n\n**3. 句子结构**\n\n这是一个简单句，主语是\"the Massachusetts Institute of Technology\"，谓语是\"opened its Center for Advanced Visual Studies (CAVS)\"，目的状语是\"to explore the role of technology in culture\"。\n\n**4. 语法**\n\n- 使用了\"more than\"来表达\"超过\"或\"大于\"的概念。\n- \"to\"后面接动词原形，表示目的或意图。\n\n**5. 知识点总结**\n\n- \"more than\"可以用来表达\"超过\"或\"大于\"的概念。\n- \"to\"后面接动词原形，常用来表示目的或意图。\n\n**6. 相似句子练习**\n\n\"Two decades ago, Google launched its search engine to revolutionize the way people access information.\"\n\n\"二十年前，谷歌推出其搜索引擎，以彻底改变人们获取信息的方式。\""},{"text":"The founders deliberately focused their projects around light-hance the “visual studies” in the name.","explainMd":"**1. 翻译 (结合全文整体意思)**\n\n创始人们有意将他们的项目集中在光上，因此得名\"视觉研究\"。\n\n**2. 词汇和短语**\n\n- **The founders**: 创始人们，指创建或设立某个组织或公司的人。\n- **deliberately**: 故意地，有意地，表示人为地、有计划地进行某种行为。\n- **focused their projects around**: 将他们的项目集中于...，表示以某一主题或目标为核心。\n- **light**: 光，这里是指研究的主题。\n- **hence the \"visual studies\" in the name**: 因此名字中有\"视觉研究\"，用来解释名字的来源或含义。\n\n**3. 句子结构**\n\n这是一个简单句，主语是\"The founders\"，谓语是\"focused their projects around light\"，然后\"and\"连接另一部分\"hence the 'visual studies' in the name\"。\n\n**4. 语法**\n\n- 使用了\"focus...around\"结构，表示将注意力或资源集中在某一主题或目标上。\n- \"hence\"用来表达因果关系，表示\"因此\"或\"所以\"。\n\n**5. 知识点总结**\n\n- \"focus...around\"结构用来表示将注意力或资源集中在某一主题或目标上。\n- \"hence\"用于表示因果关系，表达\"因此\"或\"所以\"的含义。\n\n**6. 相似句子练习**\n\n\"The team intentionally designed the program around user feedback, hence the 'customer-centric' in its mission.\"\n\n\"团队有意地将用户反馈作为程序设计的核心，因此其使命中有'以客户为中心'的表述。\""},{"text":"Light was a something that both artists and scientists had an interest in, and therefore could form the basis of collaboration.","explainMd":"**1. 翻译 **\n\n光是艺术家和科学家都感兴趣的东西，因此它可以成为他们合作的基础。\n\n**2. 词汇和短语**\n\n- **Light**: 光，这里用作名词，指的是物理现象。\n- **was a something that**: 是一种...，这里用来引出主题或焦点。\n- **both artists and scientists**: 艺术家和科学家两者都，\"both...and...\"结构用来表示两者都满足某种条件。\n- **had an interest in**: 对...感兴趣，表示某人对某物有兴趣或想了解更多。\n- **could form the basis of collaboration**: 可以成为合作的基础，表示可能的结果或可能性。\n\n**3. 句子结构**\n\n这是一个复合句，主句是\"Light was a something that both artists and scientists had an interest in\"，从句是\"and therefore could form the basis of collaboration\"。\n\n**4. 语法**\n\n- 使用了\"both...and...\"结构，表示两种元素或群体都满足某种条件。\n- \"could\"用来表示可能性或允许。\n\n**5. 知识点总结**\n\n- \"both...and...\"结构用来表示两种元素或群体都满足某种条件。\n- \"could\"用来表示可能性或允许。\n\n**6. 相似句子练习**\n\n\"Music was a something that both young and old had an interest in, and therefore could form the basis of community activities.\"\n\n\"音乐是年轻人和老年人都感兴趣的东西，因此它可以成为社区活动的基础。\""},{"text":"As science and technology progressed, and divided into more sub-disciplines, the centre was simultaneously looking to a time when leading researchers could also be artists, writers and poets, and vice versa.","explainMd":"**1. 翻译 **\n\n随着科学和技术的进步，以及分化为更多的子学科，这个中心也同时期待着一个时代，那时顶尖的研究者们也可以成为艺术家、作家和诗人，反之亦然。\n\n**2. 词汇和短语**\n\n- **As science and technology progressed**: 随着科学和技术的进步。\"As\"在这里是并列连词，表示同时发生的动作或状态。\n- **divided into more sub-disciplines**: 分化为更多的子学科。\"divided into\"是一个短语，表示被分割或分化为不同的部分或类别。\n- **the centre was simultaneously looking**: 这个中心同时在期待。\"simultaneously\"是副词，表示同时发生的行为或状态。\n- **leading researchers could also be artists, writers and poets, and vice versa**: 顶尖的研究者们也可以成为艺术家、作家和诗人，反之亦然。\"vice versa\"是拉丁语短语，表示\"反过来也一样\"的意思。\n\n**3. 句子结构**\n\n这是一个复合句子，主句是\"As science and technology progressed, and divided into more sub-disciplines\"，从句是\"the centre was simultaneously looking to a time when leading researchers could also be artists, writers and poets, and vice versa\"。\n\n**4. 语法**\n\n使用了\"as\"作为并列连词，表示同时发生的动作或状态。\"could\"用来表示可能性或允许。\n\n**5. 知识点总结**\n\n- 使用\"as\"作为并列连词，表示同时发生的动作或状态。\n- \"could\"用来表示可能性或允许。\n- \"vice versa\"是拉丁语短语，表示\"反过来也一样\"的意思。\n\n**6. 相似句子练习**\n\n\"As computers became more advanced, and divided into various specialties, the industry was simultaneously looking to a time when leading engineers could also be programmers, designers and administrators, and vice versa.\"\n\n\"随着计算机技术的进步，以及分化为各种专业，这个行业也同时期待着一个时代，那时顶尖的工程师也可以成为程序员、设计师和管理员，反之亦然。\""}]},{"sentences":[{"text":"Nature’s poll findings suggest that this trend is as strong as ever, but, to make a collaboration work, both sides need to invest time, and embrace surprise and challenge.","explainMd":"**1. 翻译 **\n\n《自然》的投票结果表明，这种趋势依然强劲，但要使协作成功，双方都需要花费时间，并愿意接受惊喜和挑战。\n\n**2. 词汇和短语**\n\n- **Nature’s poll findings**: 《自然》的投票结果。\"findings\"在这里指的是通过研究或调查得出的结果或发现。\n- **suggest**: 提示，表明。在此语境中，\"suggest\"表示的是某种迹象或证据暗示或表明了某个事实。\n- **as strong as ever**: 依然强劲。这是一个常用的英语短语，用来描述某种情况或趋势仍然强烈或持久。\n- **embrace surprise and challenge**: 接受惊喜和挑战。\"embrace\"在这里的意思是愿意接受或开放于新的、可能的困难或挑战的情况。\n\n**3. 句子结构**\n\n这是一个复合句，主句是\"Nature’s poll findings suggest that this trend is as strong as ever\"，并列句是\"to make a collaboration work, both sides need to invest time, and embrace surprise and challenge\"。\n\n**4. 语法**\n\n这个句子使用了\"but\"作为连接词，连接两个并列的句子。\"to make a collaboration work\"是一个不定式短语作为目的状语。\n\n**5. 知识点总结**\n\n- \"findings\"用来指研究或调查得出的结果或发现。\n- \"suggest\"可以表示某种迹象或证据暗示或表明了某个事实。\n- \"embrace\"在某些语境中表示愿意接受或开放于新的、可能的困难或挑战的情况。\n- 不定式短语可以作为目的状语。\n\n**6. 相似句子练习**\n\n\"Survey results suggest that this tendency is as prevalent as ever, but, to make the partnership fruitful, both parties need to put in effort and embrace unpredictability and adversity.\"\n\n\"调查结果表明，这种倾向依然普遍，但要使合作果实累累，双方都需要付出努力，并愿意接受不可预知性和逆境。\""},{"text":"The reach of art-science tie-ups needs to go beyond the necessary purpose of research communication, and participants.","explainMd":"**1. 翻译**\n\n艺术与科学的结合应该超越仅仅作为研究传播的必要工具和参与者的范畴。\n\n**2. 词汇和短语**\n\n- **The reach of**: 指的是“影响范围”或“扩展到的程度”。\n- **art-science tie-ups**: 代表“艺术与科学的结合”或“艺术与科学的联合”。\n- **go beyond**: 意为“超越”，表示超出某种限制或范围。\n- **necessary purpose of research communication**: 指“研究传播的必要目的”，这里是指艺术与科学结合的一种基本功能，即帮助科学研究结果得到更广泛的传播。\n\n**3. 句子结构**\n\n这个句子的结构相对简单，主体是\"The reach of art-science tie-ups\"，谓语是\"needs to go beyond\"，宾语是\"the necessary purpose of research communication, and participants\"。\n\n**4. 语法**\n\n这个句子主要使用了简单的主谓宾 (SVO) 结构。此外，它使用了\"beyond\"这个介词来表示某种事物需要超越或扩展的程度或范围。\n\n**5. 知识点总结**\n\n- “reach of”可以用来表示某种事物的影响范围或扩展到的程度。\n- “go beyond”表示超越某种限制或范围。\n- 在描述某种事物需要扩展或改变的程度或范围时，可以使用\"beyond\"这个介词。\n\n**6. 相似句子练习**\n\n\"the impact of educational reform needs to go beyond the mere goals of test scores and rankings.\"\n\n\"教育改革的影响需要超越单纯考试分数和排名的目标。\""},{"text":"Artists and scientists alike are immersed in discovery and invention, and challenge and critique are core to both, too.","explainMd":"**1. 翻译**\n\n无论是艺术家还是科学家，他们都深陷于发现和创新之中，挑战和批评对他们来说都是核心要素。\n\n**2. 词汇和短语**\n\n- **Artists and scientists alike**: 这是一种表达方式，意为\"艺术家和科学家同样\"，强调两者在某种情况或特质上的相似性。\n- **are immersed in**: 表示“沉浸在...”，用于描述人们对某个事物的深度参与或专注。\n- **discovery and invention**: 意为“发现和创新”，常用于描述科学或艺术的过程。\n- **challenge and critique**: 指的是“挑战和批评”，通常用于描述审理问题或进行工作的重要环节。\n\n**3. 句子结构**\n\n这个句子的结构是“主语 + 谓语 + 宾语”，其中，主语是\"Artists and scientists alike\"，谓语是\"are immersed in\"和\"are core to\"，宾语是\"discovery and invention\"和\"challenge and critique\"。其中，\"and\"连接了两个并列的谓语和宾语。\n\n**4. 语法**\n\n这是一个复合句。\"Artists and scientists alike\"是主语，\"are immersed in\"和\"are core to\"是并列的两个谓语，\"discovery and invention\"和\"challenge and critique\"是对应的宾语。这里的\"and\"用于连接两个并列的谓语和宾语。\n\n**5. 知识点总结**\n\n- “Alike”可以用来强调两个或更多的人或事物在某种情况或特性上的相似性。\n- “be immersed in”表示某人深度参与或专注于某个事物。\n- 在一个句子中可以通过\"and\"连接两个或更多的谓语和宾语，形成复合句。\n\n**6. 相似句子练习**\n\n\"Teachers and students alike are engaged in learning and understanding, and collaboration and communication are key to both, too.\"\n\n\"无论是教师还是学生，他们都参与其中学习和理解，合作和交流对他们来说都是关键要素。\""}]}],"title":""}