{"translate":"","paragraphs":[{"sentences":[{"text":"The personal grievance provisions of New Zealand’s Employment Relations Act 2000 (ERA) prevent an employer from firing an employee without good cause.","explainMd":"**翻译**\n\n\"New Zealand的Employment Relations Act 2000 (ERA)的个人不满条款阻止了雇主在没有充分理由的情况下解雇员工。\"\n\n**词汇和短语**\n\n1. personal grievance provisions - 个人不满条款\n2. Employment Relations Act 2000 (ERA) - 2000年就业关系法案 (ERA)\n3. prevent - 阻止\n4. employer - 雇主\n5. firing - 解雇\n6. employee - 员工\n7. without good cause - 没有充分理由\n\n**句子结构**\n\n这个句子是一个复杂句，主语为 \"The personal grievance provisions of New Zealand’s Employment Relations Act 2000 (ERA)\"，宾语为 \"an employer from firing an employee without good cause\"，谓语为 \"prevent\"。\n\n**语法**\n\n这个句子的语法结构基本清晰。主语和谓语的一致性是正确的。\"Prevent\" 是一个及物动词，后面接 \"from\" 结构。\n\n**知识点总结**\n\n这个句子的主要知识点是对 \"prevent...from...\" 结构的使用。\"Prevent...from...\" 结构在英语中用于表示 \"阻止...做...\" 的意思。除此之外，句子还介绍了一些关于新西兰就业法规的基本信息，这是阅读理解的重要部分。\n\n**相似句子练习**\n\n\"The laws of the country prevent individuals from harming endangered species without valid reasons.\" - \"该国的法律阻止个人在没有有效理由的情况下伤害濒危物种。\""},{"text":"Instead, dismissals must be justified.","explainMd":"**翻译**\n\n\"相反，解雇必须有正当理由。\"\n\n**词汇和短语**\n\n1. Instead - 相反\n2. dismissals - 解雇\n3. must be - 必须是\n4. justified - 有正当理由的\n\n**句子结构**\n\n这个句子是一个简单句，主语是 \"dismissals\"，谓语是 \"must be justified\"，前面的 \"Instead\" 是一个副词，用于表示与前文的对比情况。\n\n**语法**\n\n1. \"Instead\" 是一个转折副词，用来表示与前面内容的对比。\n2. \"must be justified\" 是一个被动语态，表示解雇必须有正当的理由。\n\n**知识点总结**\n\n这个句子的主要知识点是对被动语态和转折副词 \"instead\" 的使用。被动语态表示的是主语接受动作，\"must be justified\" 表示解雇行为必须有正当理由。\"Instead\" 用来表明这个观点与前面的内容形成对比。\n\n**相似句子练习**\n\n\"Instead, actions must be explained.\" - \"相反，行为必须有合理的解释。\""},{"text":"Employers must both show cause and act in a procedurally fair way.","explainMd":"**翻译**\n\n\"雇主必须既展示出解雇的理由，又以程序公正的方式行动。\"\n\n**词汇和短语**\n\n1. Employers - 雇主\n2. must - 必须\n3. both - 既……又……\n4. show cause - 展示解雇的理由\n5. act - 行动\n6. in a procedurally fair way - 以程序公正的方式\n\n**句子结构**\n\n这个句子是一个简单句，主语是 \"Employers\"，谓语是 \"must both show cause and act in a procedurally fair way\"。句中使用了 \"both...and...\" 这一并列连词结构，表示雇主有两个必须要做的事情。\n\n**语法**\n\n语句使用了 \"both...and...\" 这一并列连词结构，用于连接两个并列的动词或短语。同时， \"in a procedurally fair way\" 是一个副词短语，用于修饰动词 \"act\"。\n\n**知识点总结**\n\n这个句子的主要知识点是并列连词 \"both...and...\" 结构的使用，用于连接两个并列的动词或短语。此外，句中还有副词短语 \"in a procedurally fair way\" 用于修饰动词，说明行动的方式或状态。\n\n**相似句子练习**\n\n\"Students must both study hard and behave well.\" - \"学生们必须既努力学习，又要表现良好。\""}]},{"sentences":[{"text":"Personal grievance procedures were designed to guard the jobs of ordinary workers from “unjustified dismissals”.","explainMd":"**翻译**\n\n\"个人不满处理程序被设计用来保护普通工人的工作免受“无理解雇”的影响。\"\n\n**词汇和短语**\n\n1. Personal grievance procedures - 个人不满处理程序\n2. were designed - 被设计\n3. to guard - 保护\n4. the jobs - 工作\n5. of ordinary workers - 普通工人的\n6. from - 免受\n7. unjustified dismissals - 无理解雇\n\n**句子结构**\n\n这个句子是一个被动语态的复合句，主语是 \"Personal grievance procedures\"，谓语是 \"were designed\"，目的状语是 \"to guard the jobs of ordinary workers from “unjustified dismissals”\"。\n\n**语法**\n\n这个句子使用了被动语态(\"were designed\")，还使用了目的状语(\"to guard...\")来表示设计这个程序的目的。\"from\" 是一个介词，后面跟的是宾语 \"unjustified dismissals\"，表示免受的对象。\n\n**知识点总结**\n\n这个句子的主要知识点是被动语态和目的状语的使用。被动语态用来强调动作的承受者，而目的状语用来说明动作的目的。\n\n**相似句子练习**\n\n\"Security systems were designed to protect homes from burglaries.\" - \"安全系统被设计用来保护住宅免受盗窃的影响。\""},{"text":"The premise was that the common law of contract lacked sufficient safeguards for workers against arbitrary conduct by management.","explainMd":"### 1. 翻译\n\n这种设定的前提是，合同的普通法没有为工人提供足够的保护，以防止管理层的武断行为。\n\n### 2. 词汇和短语\n\n- premise: 前提\n- common law of contract: 合同的普通法（指的是英美法系中，由判例法构成的合同法）\n- lack: 缺乏\n- sufficient: 足够的\n- safeguards: 保障\n- workers: 工人\n- against: 针对，反对\n- arbitrary: 武断的，任意的\n- conduct: 行为\n- management: 管理层\n\n### 3. 句子结构\n\n这句话的主体是 \"The premise\"，然后 \"was that\" 引导了一个宾语从句 \"the common law of contract lacked sufficient safeguards for workers against arbitrary conduct by management\"。这个从句中，主语是 \"the common law of contract\"，谓语是 \"lacked\"，宾语是 \"sufficient safeguards for workers\"，这个宾语后面还带有一个介词短语 \"against arbitrary conduct by management\" 来修饰。\n\n### 4. 语法\n\n这句话的语法非常标准，没有出现任何的语法错误。它使用了过去式的动词 \"was\" 和 \"lacked\" 来描述过去的情况。\n\n### 5. 知识点总结\n\n这句话主要涉及到了以下几个知识点：\n\n1. 如何使用 \"was that\" 结构引导宾语从句。\n2. 如何使用 \"for\" 和 \"against\" 这两个介词来表示保护的对象和保护的目的。\n3. 如何在句子中使用形容词 \"sufficient\" 和名词 \"safeguards\" 来描述保护的程度。\n\n### 6. 相似句子练习\n\n\"The assumption was that the traditional education system provided inadequate preparation for students against the challenges of the modern world.\"\n\n那个假设是，传统的教育系统没有为学生提供足够的准备，以应对现代世界的挑战。"},{"text":"Long gone are the days when a boss could simply give an employee contractual notice.","explainMd":"### 1. 翻译\n\n那些老板可以简单地给员工发出合同通知（通常是解雇通知）的日子已经远去。\n\n### 2. 词汇和短语\n\n- Long gone: 长久以前，一去不复返\n- the days: 那些日子，过去的时光\n- a boss: 老板\n- could: 可以，能够（表示过去的能力）\n- simply: 简单地，仅仅\n- give: 给出，发出\n- an employee: 一个员工\n- contractual notice: 合同通知（通常是解雇通知）\n\n### 3. 句子结构\n\n这句话的主体是 \"the days\"，然后使用了倒装句的结构，将谓语 \"are\" 和表语 \"Long gone\" 提到主语前面，以强调这些日子已经过去。\"when\" 引导了一个定语从句 \"a boss could simply give an employee contractual notice\"，修饰 \"the days\"。\n\n对应的中文句子结构是：“那些（老板可以简单地给员工发出合同通知的）日子已经远去”。\n\n### 4. 语法\n\n这句话的语法没有错误。它使用了倒装句和定语从句的结构。\"could\" 是模态动词，表示过去的能力或可能性。\n\n### 5. 知识点总结\n\n这句话主要涉及到了以下几个知识点：\n\n1. 如何使用倒装句来强调句子中的某部分。\n2. 如何使用 \"when\" 引导定语从句。\n3. 如何在句子中使用 \"could\" 来表示过去的能力。\n\n### 6. 相似句子练习\n\n\"Long past are the times when students could learn everything just from textbooks.\"\n\n学生可以只通过课本学习所有内容的时代已经远去。"}]},{"sentences":[{"text":"But these provisions create difficulties for businesses when applied to highly paid managers and executives.","explainMd":"**1. 翻译**\n\n\"但是，当这些规定应用于高薪的经理和高管时，它们给企业带来了困难。\"\n\n**2. 词汇和短语**\n\n- provisions：规定，条款\n- create difficulties：带来困难，产生困难\n- businesses：企业，商业\n- applied to：应用于，适用于\n- highly paid：高薪的\n- managers and executives：经理和高管\n\n**3. 句子结构**\n\n这是一个复合句。主句是 \"These provisions create difficulties for businesses\"，条件状语从句是 \"when applied to highly paid managers and executives\"。\"when\" 引导的从句表示主句发生的条件或时间。\n\n**4. 语法**\n\n- 主句中使用了动词 \"create\"，表示 \"产生、带来（困难）\"。\n- 从句中使用了被动形式 \"applied to\"，表示规定被应用于某个群体。\n\n**5. 知识点总结**\n\n- \"provisions\" 通常用于法律、政策等场合，表示 \"规定、条款\"。\n- \"create difficulties for\" 是一个固定搭配，表示 \"给……带来困难\"。\n- \"applied to\" 是应用的被动形式，表示某物被应用于某个群体或场合。\n- \"highly paid managers and executives\" 是对高薪的经理和高管的描述。\n\n**6. 相似句子练习**\n\n英文：\"These regulations pose problems for companies when they are implemented on senior employees.\"\n\n中文：\"当这些规定实施于高级员工时，它们为公司带来了问题。\""},{"text":"As countless boards and business owners will attest, constraining firms from firing poorly performing, high-earning managers is a handbrake on boosting productivity and overall performance.","explainMd":"**1. 翻译**\n\n\"如无数的董事会和企业主们所证明的，限制公司解雇表现不佳且高薪的经理对于提高生产力和整体绩效构成了阻碍。\"\n\n**2. 词汇和短语**\n\n- `countless`（无数的）：一个形容词，用来描述一个非常大的或无法计数的数量。\n- `boards and business owners`（董事会和企业主）：特指公司的决策机构和拥有公司的人。\n- `attest`（证明）：一个动词，表示证明或确认某事的真实性或正确性。\n- `constraining`（限制）：一个动词，表示限制或阻止某事发生。\n- `firms`（公司）：一个名词，常用于商业语境中，指代公司或企业。\n- `firing`（解雇）：一个动词，表示终止某人的雇佣关系。\n- `poorly performing, high-earning managers`（表现不佳且高薪的经理）：描述这些经理在工作中的表现不好，但是收入很高。\n- `handbrake`（阻碍）：一个名词，原意是手刹，这里用来比喻阻碍或阻止某事的发展。\n- `boosting`（提高）：一个动词，表示增加或提高某事。\n- `productivity and overall performance`（生产力和整体绩效）：描述公司的工作效率和整体的工作表现。\n\n**3. 句子结构**\n\n这个句子的基本结构是“如无数的董事会和企业主们所证明的，A对B构成了阻碍。”其中，\"constraining firms from firing poorly performing, high-earning managers\"（限制公司解雇表现不佳且高薪的经理）是A，\"boosting productivity and overall performance\"（提高生产力和整体绩效）是B。\n\n**4. 语法**\n\n这个句子中使用了非限制性定语从句（as countless boards and business owners will attest），用来说明主句的内容是被广泛认可的。主句使用了现在分词（constraining）作为主语，表达一个正在进行的行为。\n\n**5. 知识点总结**\n\n这个句子是一个复杂句，主要包含了以下的知识点：\n\n- 非限制性定语从句的使用；\n- 现在分词作为主语的使用；\n- 一些商业相关的词汇和短语。\n\n**6. 相似句子练习**\n\n\"As numerous studies have shown, limiting schools from expelling poorly behaving students is a hindrance to improving educational quality and overall learning environment.\"\n\n“如众多研究所示，限制学校开除行为不佳的学生对于提高教育质量和整体学习环境构成了阻碍。”"},{"text":"The difference between C-grade and A-grade managers may very well be the difference between business success or failure.","explainMd":"**1. 翻译**\n\n\"C级和A级经理之间的差距可能正好就是企业成功与失败的差距。\"\n\n**2. 词汇和短语**\n\n- `difference`（差距）：一个名词，用来描述两个或更多事物之间的不同或差异。\n- `C-grade and A-grade managers`（C级和A级经理）：这是一种评级系统，用来评估经理的性能或能力，A级通常表示最高级别，而C级则表示较低的级别。\n- `may very well be`（可能正好是）：这是一个短语，用来表示可能性或可能的结果。\n- `business success or failure`（企业的成功或失败）：这是一个短语，用来描述企业的最终结果或状态，可以是成功也可以是失败。\n\n**3. 句子结构**\n\n这个句子的基本结构是“X可能就是Y。”其中，\"the difference between C-grade and A-grade managers\"（C级和A级经理之间的差距）是X，\"the difference between business success or failure\"（企业成功与失败的差距）是Y。\n\n**4. 语法**\n\n这个句子使用了简单句结构，主语是\"the difference between C-grade and A-grade managers\"，谓语是\"may very well be\"，宾语是\"the difference between business success or failure\"。\n\n**5. 知识点总结**\n\n这个句子是一个简单句，主要包含了以下的知识点：\n\n- 使用比较级表达差异或对比；\n- 描述可能性或可能结果的短语的使用；\n- 一些与商业和管理相关的词汇和短语。\n\n**6. 相似句子练习**\n\n\"The difference between an experienced and a novice teacher may very well be the difference between students' academic success or failure.\"\n\n“经验丰富的老师和新手老师之间的差距可能正好就是学生学术成功与失败的差距。”"},{"text":"Between preserving the jobs of ordinary workers or losing them.","explainMd":"**1. 翻译**\n\n\"这是在保留普通员工的工作还是失去他们之间的选择。\"\n\n**2. 词汇和短语**\n\n- `Between`（在...之间）：一个介词，用于表示在两个或多个不同的选项、位置、时间等之间的关系。\n- `preserving`（保留）：一个动词，表示保护、保存或保持某事物的状态。\n- `the jobs of ordinary workers`（普通员工的工作）：这是一个短语，用于表示普通员工的职位或工作。\n- `or`（或者）：一个连词，用于表示两个或多个选项之间的选择。\n- `losing them`（失去他们）：这是一个短语，用于表示失去之前提到的一些东西，这里指的是普通员工的工作。\n\n**3. 句子结构**\n\n这个句子的基本结构是“这是在A或者B之间的选择。”其中，\"preserving the jobs of ordinary workers\"（保留普通员工的工作）是A，\"losing them\"（失去他们）是B。\n\n**4. 语法**\n\n这个句子使用了简单句结构，以介词短语\"Between preserving the jobs of ordinary workers or losing them\"作为主体，表达了两个选项之间的选择。\n\n**5. 知识点总结**\n\n这个句子是一个简单句，主要包含了以下的知识点：\n\n- 使用介词`between`表达两个选项之间的关系；\n- 使用动词`preserving`表示保留或保护某事物；\n- 使用连词`or`表示两个选项之间的选择。\n\n**6. 相似句子练习**\n\n\"Between saving for the future or spending now.\"\n\n“这是在为未来储蓄还是现在消费之间的选择。”"},{"text":"Yet mediocrity is no longer enough to justify a dismissal.","explainMd":"**1. 翻译**\n\n\"然而，平庸的表现已经不足以成为解雇的理由了。\"\n\n**2. 词汇和短语**\n\n- `Yet`（然而）：一个副词，用于引出一个不同或相反的事实或观点。\n- `mediocrity`（平庸）：一个名词，用来描述平均水平或质量，或者没有特色、不出色的人或事物。\n- `is no longer`（已经不再是）：一个短语，用来表示某种情况或状态已经停止或不再存在。\n- `enough`（足够的）：一个形容词，表示充足或足够的数量或程度。\n- `to justify`（用来证明或证实）：一个动词短语，表示证明或证实某事的正确性或合理性。\n- `a dismissal`（解雇）：一个名词，表示终止某人的雇佣关系。\n\n**3. 句子结构**\n\n这个句子的基本结构是\"然而，A已经不再是B的理由了。\"其中，\"mediocrity\"（平庸）是A，\"a dismissal\"（解雇）是B。\n\n**4. 语法**\n\n这个句子使用了简单句结构，主语是\"mediocrity\"，谓语是\"is no longer enough\"，宾语是\"to justify a dismissal\"。\n\n**5. 知识点总结**\n\n这个句子是一个简单句，主要包含了以下的知识点：\n\n- 使用`yet`引出一个不同或相反的事实或观点；\n- 描述某种情况或状态已经停止或不再存在的短语的使用；\n- 使用动词短语`to justify`表示证明或证实某事的正确性或合理性。\n\n**6. 相似句子练习**\n\n\"Yet, a simple apology is no longer enough to mend the broken relationship.\"\n\n“然而，一个简单的道歉已经不足以修复破裂的关系了。”"}]},{"sentences":[{"text":"Consequently – and paradoxically – laws introduced to protect the jobs of ordinary workers may be placing those jobs at risk.","explainMd":"**1. 翻译**\n\n\"因此，甚至具有讽刺意味的是，为了保护普通工人的工作而制定的法律可能正在将这些工作置于风险之中。\"\n\n**2. 词汇和短语**\n\n- `Consequently`（因此）：一个副词，表示由于前面提到的原因或情况，所以产生了下面的结果或效果。\n- `and paradoxically`（并且具有讽刺意味的是）：一个短语，表示令人感到意外或与预期相反的事实。\n- `laws introduced to protect the jobs of ordinary workers`（为了保护普通工人的工作而制定的法律）：一个长短语，描述了这些法律的目的。\n- `may be placing those jobs at risk`（可能正在将这些工作置于风险之中）：一个短语，表示可能的情况或结果。\n\n**3. 句子结构**\n\n这个句子的基本结构是\"因此，甚至具有讽刺意味的是，A可能正在B。\"其中，\"laws introduced to protect the jobs of ordinary workers\"（为了保护普通工人的工作而制定的法律）是A，\"placing those jobs at risk\"（将这些工作置于风险之中）是B。\n\n**4. 语法**\n\n这个句子使用了简单句结构，主语是\"laws introduced to protect the jobs of ordinary workers\"，谓语是\"may be placing\"，宾语是\"those jobs at risk\"。\n\n**5. 知识点总结**\n\n这个句子是一个简单句，主要包含了以下的知识点：\n\n- 使用副词`consequently`表示原因和结果的关系；\n- 描述可能的情况或结果的短语的使用；\n- 一些与工作和法律相关的词汇和短语。\n\n**6. 相似句子练习**\n\n\"Consequently, and ironically, the policies designed to protect the environment may be causing more harm than good.\"\n\n“因此，具有讽刺意味的是，为保护环境而制定的政策可能正在带来更多的坏处而非好处。”"}]},{"sentences":[{"text":"If not placing jobs at risk, to the extent employment protection laws constrain business owners from dismissing under-performing managers, those laws act as a constraint on firm productivity and therefore on workers’ wages.","explainMd":"**1. 翻译**\n\n\"如果没有将工作岗位置于风险中，那么在某种程度上，就业保护法禁止企业主解雇表现不佳的经理，这些法律对公司的生产力以及因此对工人的工资形成了限制。\"\n\n**2. 词汇和短语**\n\n- `If not`（如果没有）：一个短语，用于引入一个可能的情况或条件。\n- `placing jobs at risk`（将工作岗位置于风险中）：一个短语，表示使工作岗位处于不稳定或可能失去的状态。\n- `to the extent`（在...的程度上）：一个短语，表示在某个程度或范围内。\n- `employment protection laws`（就业保护法）：指的是法律规定，旨在保护员工免受不公平解雇的法律。\n- `constrain`（限制）：一个动词，表示限制或阻止某事的发生。\n- `business owners`（企业主）：拥有和管理一个商业企业的人。\n- `dismissing under-performing managers`（解雇表现不佳的经理）：解雇表现不好的经理或领导。\n- `act as a constraint on`（对...形成限制）：对某事物施加限制或影响。\n- `firm productivity and therefore on workers’ wages`（公司的生产力以及因此对工人的工资）：这表示公司的生产力对工人的工资有直接影响。\n\n**3. 句子结构**\n\n这个句子的基本结构是\"如果没有A，那么B对C形成了限制。\"其中，\"placing jobs at risk\"（将工作岗位置于风险中）是A，\"employment protection laws constrain business owners from dismissing under-performing managers\"（就业保护法禁止企业主解雇表现不佳的经理）是B，\"firm productivity and therefore on workers’ wages\"（公司的生产力以及因此对工人的工资）是C。\n\n**4. 语法**\n\n这个句子使用了条件句的结构，\"If not placing jobs at risk\"是一个条件状语从句，主句是\"to the extent employment protection laws constrain business owners from dismissing under-performing managers, those laws act as a constraint on firm productivity and therefore on workers’ wages\"。\n\n**5. 知识点总结**\n\n这个句子是一个复杂句，主要包含了以下的知识点：\n\n- 条件状语从句的使用；\n- 描述程度或范围的短语的使用；\n- 一些与工作、法律和企业管理相关的词汇和短语。\n\n**6. 相似句子练习**\n\n\"If not causing financial loss, to the extent that high taxes discourage investment, those taxes act as a constraint on economic growth and therefore on improvement of living standards.\"\n\n\"如果没有引起财务损失，那么在高税负阻碍投资的程度上，这些税收对经济增长以及因此对生活标准的提高形成了限制。\""},{"text":"Indeed, in “An International Perspective on New Zealand’s Productivity Paradox” (2014), the Productivity Commission singled out the low quality of managerial capabilities as a cause of the country’s poor productivity growth record.","explainMd":"**1. 翻译**\n\n\"事实上，在《新西兰生产力悖论的国际视角》(2014)一文中，生产力委员会特别指出了管理能力的低质量是该国生产力增长记录不佳的原因。\"\n\n**2. 词汇和短语**\n\n- `Indeed`（事实上）：一个副词，用于强调前面的陈述或引入一个重要的事实。\n- `in “An International Perspective on New Zealand’s Productivity Paradox” (2014)`（在《新西兰生产力悖论的国际视角》(2014)一文中）：这是一个具体的文献引用。\n- `the Productivity Commission`（生产力委员会）：这是一个特定的组织或机构的名称。\n- `singled out`（特别指出）：一个动词短语，表示从许多事物中选择出一个特定的事物进行关注或处理。\n- `the low quality of managerial capabilities`（管理能力的低质量）：这是一个短语，用来描述管理能力的质量问题。\n- `as a cause of`（作为...的原因）：一个短语，表示引发或导致某种结果的因素。\n- `the country’s poor productivity growth record`（该国生产力增长记录不佳）：这是一个短语，描述了一个国家在生产力增长方面的不良记录。\n\n**3. 句子结构**\n\n这个句子的基本结构是\"事实上，在A中，B特别指出C是D的原因。\"其中，\"An International Perspective on New Zealand’s Productivity Paradox (2014)\"（《新西兰生产力悖论的国际视角》(2014)）是A，\"the Productivity Commission\"（生产力委员会）是B，\"the low quality of managerial capabilities\"（管理能力的低质量）是C，\"the country’s poor productivity growth record\"（该国生产力增长记录不佳）是D。\n\n**4. 语法**\n\n这个句子使用了简单句结构，主语是\"the Productivity Commission\"，谓语是\"singled out\"，宾语是\"the low quality of managerial capabilities as a cause of the country’s poor productivity growth record\"。\n\n**5. 知识点总结**\n\n这个句子是一个简单句，主要包含了以下的知识点：\n\n- 文献引用的表示方式；\n- 使用`indeed`强调前面的陈述或引入一个重要的事实；\n- 使用动词短语`single out`表示选择出一个特定的事物进行关注或处理；\n- 描述因果关系的短语的使用。\n\n**6. 相似句子练习**\n\n\"Indeed, in \"The Impact of Climate Change on Agriculture\" (2020), the Environmental Research Institute identified the increase in extreme weather events as a major threat to global food security.\"\n\n\"事实上，在《气候变化对农业的影响》(2020)一文中，环境研究所将极端天气事件的增加确定为对全球粮食安全的主要威胁。\""}]},{"sentences":[{"text":"Nor are highly paid managers themselves immune from the harm caused by the ERA’s unjustified dismissal procedures.","explainMd":"**1. 翻译**\n\n\"高薪经理们也不会免受 ERA 不正当解雇程序所造成的伤害。\"\n\n**2. 词汇和短语**\n\n- `Nor`（也不）：一个副词，用于引出一个否定的陈述，通常用在部分倒装句中。\n- `are...immune`（免受...）：一个动词短语，表示不被某事物影响或损害。\n- `highly paid managers`（高薪经理们）：描述收入非常高的经理或领导。\n- `themselves`（他们自己）：一个反身代词，用来强调主语是某个行动的接受者。\n- `from the harm caused by`（由...所造成的伤害）：一个短语，表示某事物的负面影响或结果。\n- `the ERA’s unjustified dismissal procedures`（ERA的不正当解雇程序）：指的是新西兰2000年就业关系法（ERA）中的不正当解雇程序。\n\n**3. 句子结构**\n\n这个句子的基本结构是\"也不是A免受B的伤害。\"其中，\"highly paid managers themselves\"（高薪经理们自身）是A，\"the harm caused by the ERA’s unjustified dismissal procedures\"（ERA不正当解雇程序所造成的伤害）是B。\n\n**4. 语法**\n\n这个句子使用了部分倒装句的结构，即把谓语动词放在主语之前以达到强调的效果。这里的副词`nor`用来引出一个否定的陈述，通常在这种情况下需要使用倒装句。\n\n**5. 知识点总结**\n\n这个句子是一个部分倒装句，主要包含了以下的知识点：\n\n- 部分倒装句的使用；\n- 使用`nor`引出一个否定的陈述；\n- 使用动词短语`are...immune`表示免受某事物的影响或损害；\n- 一些与工作、法律和企业管理相关的词汇和短语。\n\n**6. 相似句子练习**\n\n\"Nor are the small businesses themselves immune from the impact of the economic downturn.\"\n\n\"小型企业本身也不会免受经济衰退的影响。\""},{"text":"Because employment protection laws make it costlier to fire an employee, employers are more cautious about hiring new staff.","explainMd":"**1. 翻译**\n\n\"因为就业保护法使解雇员工成本更高，所以雇主在招聘新员工时更为谨慎。\"\n\n**2. 词汇和短语**\n\n- `Because`（因为）：一个连词，用来引入原因或理由。\n- `employment protection laws`（就业保护法）：指的是保护员工权益，防止不公平解雇的法律。\n- `make it costlier to`（使...的成本更高）：一个动词短语，表示增加某事的成本或费用。\n- `fire an employee`（解雇员工）：表示终止员工的雇佣关系。\n- `employers`（雇主）：拥有和管理一个商业企业的人，他们雇佣和支付员工的薪水。\n- `are more cautious about`（对...更为谨慎）：一个短语，表示对某事更加小心或谨慎。\n- `hiring new staff`（招聘新员工）：表示雇佣新的员工或人员。\n\n**3. 句子结构**\n\n这个句子的基本结构是\"因为A，所以B对C更为谨慎。\"其中，\"employment protection laws make it costlier to fire an employee\"（就业保护法使解雇员工成本更高）是A，\"employers\"（雇主）是B，\"hiring new staff\"（招聘新员工）是C。\n\n**4. 语法**\n\n这个句子使用了因果关系句型，以`because`引导原因状语从句，主句描述了这个原因所导致的结果或影响。\n\n**5. 知识点总结**\n\n这个句子是一个复合句，主要包含了以下的知识点：\n\n- 使用`because`引导的原因状语从句；\n- 描述可能的影响或结果的动词短语的使用；\n- 一些与工作、法律和企业管理相关的词汇和短语。\n\n**6. 相似句子练习**\n\n\"Because the new regulations make it costlier to pollute, companies are more cautious about their environmental impact.\"\n\n\"因为新的规定使污染的成本更高，所以公司对其环境影响更为谨慎。\""},{"text":"This makes it harder for the marginal manager to gain employment.","explainMd":"**1. 翻译**\n\n\"这使得处于边缘的经理更难找到工作。\"\n\n**2. 词汇和短语**\n\n- `This`（这）：一个代词，用于指代前面提到的情况或事物。\n- `makes it`（使得它）：一个短语，用于表达引起某种结果或效果。\n- `harder`（更难）：一个比较级形容词，用于比较两个或多个事物的难易程度。\n- `for the marginal manager`（对于处于边缘的经理）：一个短语，用于描述那些表现不佳或处在工作岗位边缘的经理。\n- `to gain employment`（找到工作）：一个动词短语，表示获得或找到工作。\n\n**3. 句子结构**\n\n这个句子的基本结构是\"这使得对A来说B更难。\"其中，\"the marginal manager\"（处于边缘的经理）是A，\"to gain employment\"（找到工作）是B。\n\n**4. 语法**\n\n这个句子使用了简单句结构，主语是\"This\"，谓语是\"makes it harder\"，宾语是\"for the marginal manager to gain employment\"。\n\n**5. 知识点总结**\n\n这个句子是一个简单句，主要包含了以下的知识点：\n\n- 使用代词`this`指代前面提到的情况或事物；\n- 描述引起某种结果或效果的短语的使用；\n- 使用比较级形容词`harder`表示难易程度；\n- 描述工作和就业情况的词汇和短语。\n\n**6. 相似句子练习**\n\n\"This makes it harder for the recent graduates to find a job.\"\n\n\"这使得新近毕业生更难找到工作。\""},{"text":"And firms pay staff less because firms carry the burden of the employment arrangement going wrong.","explainMd":"**1. 翻译**\n\n\"并且，因为公司承担了雇佣安排出错的负担，所以公司支付给员工的薪水较少。\"\n\n**2. 词汇和短语**\n\n- `And`（并且）：一个连词，用于连接两个或多个相同类型的词、短语或子句。\n- `firms`（公司）：一个名词，指的是进行商业活动的组织或实体。\n- `pay staff less`（支付给员工的薪水较少）：一个动词短语，表示支付给员工的工资或薪水比正常或预期的要少。\n- `because`（因为）：一个从属连词，用于引入原因或理由。\n- `firms carry the burden`（公司承担负担）：一个短语，表示公司承担了某种责任、负担或风险。\n- `of the employment arrangement going wrong`（雇佣安排出错）：一个名词短语，表示雇佣安排或协议的问题或失败。\n\n**3. 句子结构**\n\n这个句子的基本结构是\"并且，因为A，所以B。\"其中，\"firms carry the burden of the employment arrangement going wrong\"（公司承担了雇佣安排出错的负担）是A，\"firms pay staff less\"（公司支付给员工的薪水较少）是B。\n\n**4. 语法**\n\n这个句子使用了因果关系句型，以`because`引导原因状语从句，主句描述了这个原因所导致的结果或影响。\n\n**5. 知识点总结**\n\n这个句子是一个复合句，主要包含了以下的知识点：\n\n- 使用`because`引导的原因状语从句；\n- 描述因果关系的句子结构；\n- 一些与工作、法律和企业管理相关的词汇和短语。\n\n**6. 相似句子练习**\n\n\"And companies invest less in research and development because they carry the burden of the financial crisis.\"\n\n\"并且，因为公司承担了金融危机的负担，所以他们在研发上的投资较少。\""}]},{"sentences":[{"text":"Society also suffers from excessive employment protections.","explainMd":"**1. 翻译**\n\n\"社会也因过度的就业保护而受苦。\"\n\n**2. 词汇和短语**\n\n- `Society`（社会）：一个名词，指的是人们共同生活并遵循相同的规则和习俗的大集合。\n- `also`（也）：一个副词，表示除了已经提到的事物之外，还包括另一个或其他事物。\n- `suffers from`（因...而受苦）：一个短语，表示遭受某种不良情况或疾病的困扰。\n- `excessive employment protections`（过度的就业保护）：一个短语，描述的是过度或过分的就业保护措施。\n\n**3. 句子结构**\n\n这个句子的基本结构是\"A也因B而受苦。\"其中，\"Society\"（社会）是A，\"excessive employment protections\"（过度的就业保护）是B。\n\n**4. 语法**\n\n这个句子使用了简单句结构，主语是\"Society\"，谓语是\"also suffers from\"，宾语是\"excessive employment protections\"。\n\n**5. 知识点总结**\n\n这个句子是一个简单句，主要包含了以下的知识点：\n\n- 使用副词`also`表示除了已经提到的事物之外，还包括另一个或其他事物；\n- 描述遭受某种不良情况或疾病的困扰的短语的使用；\n- 一些与工作、法律和社会相关的词汇和短语。\n\n**6. 相似句子练习**\n\n\"The economy also suffers from excessive government regulations.\"\n\n\"经济也因过度的政府规定而受苦。\""},{"text":"Stringent job dismissal regulations adversely affect productivity growth and hamper both prosperity and overall well-being.","explainMd":"**1. 翻译**\n\n\"严格的解雇规定不利于生产力的增长，且阻碍了繁荣与整体福祉。\"\n\n**2. 词汇和短语**\n\n- `Stringent`（严格的）：一个形容词，表示严厉，严格或严密。\n- `job dismissal regulations`（解雇规定）：一个名词短语，指的是关于解雇员工的规定或法规。\n- `adversely affect`（不利地影响）：一个动词短语，表示某事物有负面影响或效果。\n- `productivity growth`（生产力的增长）：一个名词短语，指的是生产效率或产量的提高。\n- `hamper`（阻碍）：一个动词，表示妨碍，阻止或限制。\n- `both prosperity and overall well-being`（繁荣与整体福祉）：一个短语，表示经济的繁荣和人们的整体福祉。\n\n**3. 句子结构**\n\n这个句子的基本结构是\"A不利于B的增长，且阻碍了C。\"其中，\"Stringent job dismissal regulations\"（严格的解雇规定）是A，\"productivity growth\"（生产力的增长）是B，\"both prosperity and overall well-being\"（繁荣与整体福祉）是C。\n\n**4. 语法**\n\n这个句子使用了简单句结构，主语是\"Stringent job dismissal regulations\"，谓语是\"adversely affect...and hamper\"，宾语是\"productivity growth and both prosperity and overall well-being\"。\n\n**5. 知识点总结**\n\n这个句子是一个简单句，主要包含了以下的知识点：\n\n- 描述不利影响或效果的动词短语的使用；\n- 描述阻碍或限制的动词的使用；\n- 一些与工作、法律和社会福祉相关的词汇和短语。\n\n**6. 相似句子练习**\n\n\"High taxes adversely affect economic growth and hamper both investment and innovation.\"\n\n\"高税收不利于经济增长，且阻碍了投资和创新。\""}]},{"sentences":[{"text":"Across the Tasman Sea, Australia deals with the unjustified dismissal paradox by excluding employees earning above a specified “high-income threshold” from the protection of its unfair dismissal laws.","explainMd":"**1. 翻译**\n\n\"横跨塔斯曼海，澳大利亚通过排除那些收入超过指定'高收入阈值'的员工，来处理不合理解雇的悖论，这些员工无法享有其不公平解雇法的保护。\"\n\n**2. 词汇和短语**\n\n- `Across the Tasman Sea`（横跨塔斯曼海）：一个地理短语，指的是在塔斯曼海的另一边，通常指的是新西兰和澳大利亚之间。\n- `Australia`（澳大利亚）：一个名词，表示澳大利亚这个国家。\n- `deals with`（处理）：一个动词短语，表示处理或应对某种情况或问题。\n- `the unjustified dismissal paradox`（不合理解雇的悖论）：一个名词短语，表示不合理解雇带来的矛盾问题。\n- `by excluding`（通过排除）：一个介词短语，表示通过排除或不包括某些事物的方式。\n- `employees earning above a specified “high-income threshold”`（收入超过指定'高收入阈值'的员工）：一个短语，表示收入超过某个特定水平的员工。\n- `from the protection of its unfair dismissal laws`（无法享有其不公平解雇法的保护）：一个短语，表示不在某种特定法律保护的范围内。\n\n**3. 句子结构**\n\n这个句子的基本结构是\"A通过B来处理C，其中D无法享有E的保护。\"其中，\"Australia\"（澳大利亚）是A，\"excluding employees earning above a specified 'high-income threshold'\"（排除那些收入超过指定'高收入阈值'的员工）是B，\"the unjustified dismissal paradox\"（不合理解雇的悖论）是C，\"employees earning above a specified 'high-income threshold'\"（收入超过指定'高收入阈值'的员工）是D，\"the protection of its unfair dismissal laws\"（其不公平解雇法的保护）是E。\n\n**4. 语法**\n\n这个句子使用了复合句结构，其中包含一个主句和一个非限制性定语从句。主句的主语是\"Australia\"，谓语是\"deals with\"，宾语是\"the unjustified dismissal paradox\"。非限制性定语从句的引导词是\"by\"，主语是\"employees earning above a specified 'high-income threshold'\"，谓语是\"be excluded\"，宾语是\"from the protection of its unfair dismissal laws\"。\n\n**5. 知识点总结**\n\n这个句子是一个复合句，主要包含了以下的知识点：\n\n- 使用介词短语`by excluding`表示通过某种方式处理或应对某种情况；\n- 描述一种矛盾或悖论的名词短语的使用；\n- 一些与工作、法律和地理位置相关的词汇和短语。\n\n**6. 相似句子练习**\n\n\"Across the Atlantic Ocean, Europe deals with the immigration issue by excluding immigrants who do not meet certain criteria from the benefits of its social welfare programs.\"\n\n\"横跨大西洋，欧洲通过排除不符合某些标准的移民，来处理移民问题，这些移民无法享受其社会福利计划的福利。\""},{"text":"In New Zealand, a 2016 private members’ Bill tried to permit firms and high-income employees to contract out of the unjustified dismissal regime.","explainMd":"**1. 翻译**\n\n\"在新西兰，2016年一项私人议员提出的法案试图允许公司和高收入员工从不合理解雇制度中签约退出。\"\n\n**2. 词汇和短语**\n\n- `In New Zealand`（在新西兰）：一个短语，表示在新西兰这个国家。\n- `a 2016 private members’ Bill`（2016年一项私人议员提出的法案）：一个名词短语，指的是由个别议员（而非政府）提出的立法提案。\n- `tried to`（试图）：一个动词短语，表示尝试或企图做某事。\n- `permit`（允许）：一个动词，表示给予许可或允许某事发生。\n- `firms and high-income employees`（公司和高收入员工）：一个名词短语，指的是商业公司和收入较高的员工。\n- `to contract out of`（从...中签约退出）：一个动词短语，表示通过合同或协议退出或终止某种安排或制度。\n- `the unjustified dismissal regime`（不合理解雇制度）：一个名词短语，指的是不合理或不公平解雇员工的制度或规定。\n\n**3. 句子结构**\n\n这个句子的基本结构是\"A中的B试图允许C从D中签约退出。\"其中，\"New Zealand\"（新西兰）是A，\"a 2016 private members’ Bill\"（2016年一项私人议员提出的法案）是B，\"firms and high-income employees\"（公司和高收入员工）是C，\"the unjustified dismissal regime\"（不合理解雇制度）是D。\n\n**4. 语法**\n\n这个句子使用了简单句结构，主语是\"a 2016 private members’ Bill\"，谓语是\"tried to permit\"，宾语是\"firms and high-income employees to contract out of the unjustified dismissal regime\"。\n\n**5. 知识点总结**\n\n这个句子是一个简单句，主要包含了以下的知识点：\n\n- 使用动词短语`tried to`表示尝试或企图做某事；\n- 描述通过合同或协议退出或终止某种安排的动词短语的使用；\n- 一些与工作、法律和地理位置相关的词汇和短语。\n\n**6. 相似句子练习**\n\n\"In the United States, a 2020 state bill tried to allow students and teachers to opt out of the standardized testing system.\"\n\n\"在美国，2020年一项州立法案试图允许学生和教师从标准化测试系统中选择退出。\""},{"text":"However, the mechanisms proposed were unwieldy and the Bill was voted down following the change in government later that year.","explainMd":"**1. 翻译**\n\n\"然而，提出的机制过于繁琐，导致该法案在那年晚些时候政府变动后被投票否决。\"\n\n**2. 词汇和短语**\n\n- `However`（然而）：一个副词，用于引入对前面陈述的对比或反驳。\n- `the mechanisms proposed`（提出的机制）：一个名词短语，表示被提出的方法、系统或过程。\n- `were unwieldy`（过于繁琐）：一个形容词，表示难以管理或使用，因为过于复杂或大。\n- `and`（并且）：一个连词，用于连接两个或多个相同类型的词、短语或子句。\n- `the Bill was voted down`（法案被否决）：一个被动语态的动词短语，表示法案在投票中被否决或拒绝。\n- `following the change in government later that year`（那年晚些时候政府变动后）：一个短语，表示在那年晚些时候政府发生变化后的情况。\n\n**3. 句子结构**\n\n这个句子的基本结构是\"然而，A过于繁琐，并且B在C后被否决。\"其中，\"the mechanisms proposed\"（提出的机制）是A，\"the Bill\"（法案）是B，\"following the change in government later that year\"（那年晚些时候政府变动后）是C。\n\n**4. 语法**\n\n这个句子使用了复合句结构，包含了两个并列的分句，分别是\"the mechanisms proposed were unwieldy\"和\"the Bill was voted down following the change in government later that year\"。这两个分句通过连词`and`连接，前一个分句用到了过去时的被动语态，后一个分句用到了过去时的主动语态。\n\n**5. 知识点总结**\n\n这个句子是一个复合句，主要包含了以下的知识点：\n\n- 使用副词`however`引入对前面陈述的对比或反驳；\n- 描述事物特性的形容词的使用；\n- 使用连词`and`连接两个并列的分句；\n- 描述时间和事件的短语的使用。\n\n**6. 相似句子练习**\n\n\"However, the solutions proposed were impractical, and the plan was abandoned following the budget cut later that year.\"\n\n\"然而，提出的解决方案不切实际，并且在那年晚些时候预算削减后，该计划被放弃。\""}]}],"title":""}