{"translate":"","paragraphs":[{"sentences":[{"text":"It's easy to dismiss as absurd the Trump administration's ideas for plugging the chronic funding gap of our national parks.","explainMd":"\n\n**1. 翻译**\n\n联邦政府填补国家公园长期资金缺口的想法很容易被认为是荒谬的。\n\n**2. 重难点词汇和短语**\n\n- `dismiss as`: 视为，认为\n- `absurd`: 荒谬的\n- `administration's`: 行政当局的，政府的\n- `ideas`: 想法\n- `plugging`: 填补\n- `the chronic funding gap`: 长期的资金缺口\n- `national parks`: 国家公园\n\n**3. 句子结构**\n\n这是一个简单句。句子的主语是\"It\"，谓语是\"is easy to dismiss\"，宾语是\"the Trump administration's ideas for plugging the chronic funding gap of our national parks\"，这个长宾语中存在一个\"for\"引导的目的状语从句。\n\n**4. 语法**\n\n- `dismiss as`是一个短语动词，表示将某物视为某种特定的方式或特性。在这里，\"dismiss as absurd\"表示将某事视为荒谬。\n- `It's easy to`是一个常用的表达方式，表示某事是容易做的，后面通常接动词不定式形式。\n\n**5. 知识点总结**\n\n- `dismiss as`是一个重要的动词短语，表示对某事的看法或评价。\n- `It's easy to`是一个常见的表达方式，表示某事容易做。\n\n**6. 相似句子练习**\n\n\"It's easy to dismiss as unrealistic the company's plan for rapid expansion.\"\n\n\"很容易将公司的快速扩张计划视为不切实际。\"\n"},{"text":"Can anyone really think it's a good idea to allow Amazon deliveries to your tent in Yosemite or food trucks to line up under the redwood trees at Sequoia National Park?","explainMd":"**1. 翻译**\n\n真的有人认为在优胜美地的帐篷里允许亚马逊送货，或者让食品车在红杉国家公园的红杉树下排队是个好主意吗？\n\n**2. 重难点词汇和短语**\n\n- `Can anyone really think`: 真的有人会认为\n- `it's a good idea`: 这是个好主意\n- `allow`: 允许\n- `Amazon deliveries`: 亚马逊送货\n- `to your tent`: 到你的帐篷\n- `Yosemite`: 优胜美地（美国国家公园）\n- `food trucks`: 食品车\n- `line up`: 排队\n- `under the redwood trees`: 在红杉树下\n- `Sequoia National Park`: 红杉国家公园（美国国家公园）\n\n**3. 句子结构**\n\n这是一个疑问句，主要由两部分构成：`Can anyone really think it's a good idea` 和 `to allow Amazon deliveries to your tent in Yosemite or food trucks to line up under the redwood trees at Sequoia National Park?`。第二部分是一个并列结构，分别描述了两种可能的情况。\n\n**4. 语法**\n\n- `Can anyone really think` 是一个询问观点的疑问句结构。\n- `it's a good idea to` 是一个表示提议或建议的常见表达。\n- `allow` 后面接动名词形式作为宾语。\n- `or` 连接并列的两个动词短语。\n\n**5. 知识点总结**\n\n- `Can anyone really think` 是一个询问观点的疑问句结构。\n- `it's a good idea to` 是一个表示提议或建议的表达方式。\n- `allow` 后面接动名词形式作为宾语。\n\n**6. 相似句子练习**\n\n\"Can anyone really think it's a good idea to allow children to play video games for hours every day?\"\n\n\"真的有人认为让孩子们每天玩数小时的电子游戏是个好主意吗？\""}]},{"sentences":[{"text":"But the administration is right about one thing: U.S. national parks are in crisis.","explainMd":"**1. 翻译**\n\n但是，政府在一点上是对的：美国的国家公园正面临危机。\n\n**2. 重难点词汇和短语**\n\n- `But`: 但是，表示转折\n- `the administration`: 政府\n- `is right about`: 在...上是正确的\n- `one thing`: 一件事\n- `U.S. national parks`: 美国的国家公园\n- `are in crisis`: 正面临危机\n\n**3. 句子结构**\n\n这是一个简单句，由主语（`the administration`）和谓语（`is right about one thing`）以及宾语（`U.S. national parks are in crisis`）构成。宾语部分是一个完整的句子，用来详细说明政府在什么事情上是对的。\n\n**4. 语法**\n\n- `But` 是一个转折连词，用来表示对前一句话或观点的转折或对比。\n- `is right about` 是一个常用短语，用来表示某人在某件事情上是正确的。\n- `U.S. national parks are in crisis` 是一个简单句，用来详细说明政府在什么事情上是对的。\n\n**5. 知识点总结**\n\n- `But` 用作转折连词，表示对前一句话或观点的转折或对比。\n- `is right about` 是一个常用短语，表示某人在某件事情上是正确的。\n- 宾语部分可以是一个完整的句子，用来详细说明主语。\n\n**6. 相似句子练习**\n\n\"But the teacher is right about one thing: The students need more practice.\"\n\n\"但是，老师在一点上是对的：学生们需要更多的练习。\""},{"text":"Collectively, they have a maintenance backlog of more than $12 billion.","explainMd":"**1. 翻译**\n\n总的来说，它们的维护积压超过120亿美元。\n\n**2. 重难点词汇和短语**\n\n- `Collectively`: 总的来说，整体上\n- `they have a maintenance backlog`: 他们有一项维护积压\n- `of more than $12 billion`: 超过120亿美元\n\n**3. 句子结构**\n\n这是一个简单句，由主语（`they`）和谓语（`have a maintenance backlog`）以及宾语（`of more than $12 billion`）构成。在这里，`Collectively` 是一个副词，用来修饰整个句子，表示整体的情况。\n\n**4. 语法**\n\n- `Collectively` 是一个副词，用来修饰整个句子，表示整体的情况。\n- `they have a maintenance backlog` 是一个简单句，`they` 是主语，`have` 是谓语，`a maintenance backlog` 是宾语。\n- `of more than $12 billion` 是一个介词短语，用来修饰 `maintenance backlog`，表示维护积压的金额。\n\n**5. 知识点总结**\n\n- `Collectively` 是一个副词，可以用来修饰整个句子，表示整体的情况。\n- `they have a maintenance backlog` 是一个简单句，可以用来表达某人或某物拥有或存在某物。\n- `of more than $12 billion` 是一个介词短语，可以用来修饰名词，表示数量或金额。\n\n**6. 相似句子练习**\n\n\"Collectively, they have a debt of more than $500 million.\"\n\n总的来说，他们的债务超过了5亿美元。"},{"text":"Roads, trails, restrooms, visitor centers and other infrastructure are crumbling.","explainMd":"**1. 翻译**\n\n道路、小径、洗手间、游客中心和其他基础设施都在破败。\n\n**2. 重难点词汇和短语**\n\n- `Roads, trails, restrooms, visitor centers and other infrastructure`: 道路、小径、洗手间、游客中心和其他基础设施\n- `are crumbling`: 在破败\n\n**3. 句子结构**\n\n这是一个简单句，由主语（`Roads, trails, restrooms, visitor centers and other infrastructure`）和谓语（`are crumbling`）构成。\n\n**4. 语法**\n\n- `Roads, trails, restrooms, visitor centers and other infrastructure` 是一个并列结构，由多个名词组成，表示多个主语。并列结构在英语中是常见的，可以用来列举多个事物。\n- `are crumbling` 是一个动词短语，`are` 是助动词，`crumbling` 是现在分词，用来表示主语的状态。在这里，`crumbling` 表示的状态是正在破败。\n\n**5. 知识点总结**\n\n- 并列结构可以用来列举多个事物，使句子内容丰富。\n- 助动词加现在分词可以用来表示主语的状态，这是英语中的进行时态。\n\n**6. 相似句子练习**\n\n\"Bridges, tunnels, airports, and other transportation infrastructure are aging.\"\n\n桥梁、隧道、机场和其他交通基础设施都在老化。"}]},{"sentences":[{"text":"But privatizing and commercializing the campgrounds would not be a cure- all.","explainMd":"**1. 翻译**\n\n但是，将露营地私有化和商业化并不能解决所有问题。\n\n**2. 重难点词汇和短语**\n\n- `privatizing and commercializing`: 私有化和商业化\n- `the campgrounds`: 露营地\n- `would not be a cure-all`: 并不能解决所有问题\n\n**3. 句子结构**\n\n这是一个复合句，主句是`privatizing and commercializing the campgrounds would not be a cure-all`，其中的`privatizing and commercializing the campgrounds`作为主语，`would not be a cure-all`作为谓语。\n\n**4. 语法**\n\n- `privatizing and commercializing the campgrounds`是动名词短语作主语，动名词短语在句中可以作主语、宾语等成分，这是英语中的一种常见句式。\n- `would not be a cure-all`中的`would`是情态动词，表示对未来的推测，后面接动词原形`be`，`a cure-all`是固定搭配，指的是万能解决方案。\n\n**5. 知识点总结**\n\n- 动名词短语在句中可以作主语，宾语等成分，增加了句子的灵活性。\n- 情态动词`would`可以用来表达对未来的推测，后接动词原形。\n\n**6. 相似句子练习**\n\n\"Building more highways and bridges is not a silver bullet for traffic congestion.\"\n\n建设更多的公路和桥梁并不是解决交通堵塞的灵丹妙药。"},{"text":"Campgrounds are a tiny portion of the overall infrastructure backlog, and concessionaires in the parks hand over, on average, only about 5% of their revenues to the National Park Service.","explainMd":"**1. 翻译**\n\n露营地只占总体基础设施滞后的一小部分，公园的特许权经营者平均只将他们的收入的大约5%上交给国家公园服务部门。\n\n**2. 重难点词汇和短语**\n\n- `Campgrounds`: 露营地\n- `a tiny portion of the overall infrastructure backlog`: 总体基础设施滞后的一小部分\n- `concessionaires`: 特许权经营者\n- `on average`: 平均 \n- `5% of their revenues`: 他们收入的5%\n- `the National Park Service`: 国家公园服务部门\n\n**3. 句子结构**\n\n这是一个复合句子，由两个并列的简单句构成：“露营地是总体基础设施滞后的一小部分”和“公园的特许权经营者平均只将他们的收入的大约5%上交给国家公园服务部门”。\n\n**4. 语法**\n\n- `Campgrounds are a tiny portion of the overall infrastructure backlog`这个句子中的`are`是系动词，`a tiny portion of the overall infrastructure backlog`是表语。\n- `concessionaires in the parks hand over, on average, only about 5% of their revenues to the National Park Service`这是一个主谓宾结构的句子，`concessionaires in the parks`是主语，`hand over`是谓语，`only about 5% of their revenues to the National Park Service`是宾语。`on average`是副词短语，用来修饰谓语动词`hand over`。\n\n**5. 知识点总结**\n\n- 系动词后接名词作表语，用来对主语进行描述或解释。\n- 主谓宾结构是英语句子的基本结构，谓语动词后接宾语来补充或详细说明动作的内容。\n\n**6. 相似句子练习**\n\nStudents only spend, on average, about 10% of their time on physical exercise.\n\n学生们平均只花费他们的时间的大约10%来进行体育锻炼。"}]},{"sentences":[{"text":"Moreover, increased privatization would certainly undercut one of the major reasons why 300 million visitors come to the parks each year: to enjoy nature and get a break from the commercial drumbeat that overwhelms daily life.","explainMd":"**1. 翻译**\n\n而且，增加的私有化肯定会削弱每年有3亿游客来公园的主要原因之一：享受大自然和从日常生活中的商业鼓动中获得休息。\n\n**2. 重难点词汇和短语**\n\n- `Moreover`: 而且\n- `increased privatization`: 增加的私有化\n- `would certainly undercut`: 肯定会削弱\n- `one of the major reasons`: 主要原因之一\n- `300 million visitors`: 3亿游客\n- `come to the parks each year`: 每年来公园\n- `to enjoy nature and get a break from`: 享受大自然并从...中获得休息\n- `the commercial drumbeat that overwhelms daily life`: 日常生活中的商业鼓动\n\n**3. 句子结构**\n\n这是一个复杂句，主句是 \"increased privatization would certainly undercut one of the major reasons why 300 million visitors come to the parks each year\"，其中包含一个定语从句 \"why 300 million visitors come to the parks each year\" 用来修饰 \"the major reasons\"。\n\n**4. 语法**\n\n- \"increased privatization would certainly undercut one of the major reasons\" 是一个主谓宾句型，主语是 \"increased privatization\"，谓语是 \"would certainly undercut\"，宾语是 \"one of the major reasons\"。\n- \"why 300 million visitors come to the parks each year\" 是一个定语从句，修饰 \"the major reasons\"，其中 \"why\" 是关系副词，引导原因状语从句。\n\n**5. 知识点总结**\n\n- 定语从句是复杂句的一种形式，常用来修饰某个名词或代词，提供更多信息。定语从句中的关系词 (如 who, which, that, whose, whom, where, when 和 why) 起到了连接主句和从句的作用，并在从句中担任一定的语法成分。\n- \"one of the + 复数名词\" 是一个常见的表达方式，用来表示某一类物中的一个。\n\n**6. 相似句子练习**\n\nMoreover, the decrease in physical activities would certainly harm one of the primary reasons why students go to school: to learn and get a break from the digital distractions that overwhelm daily life.\n\n而且，减少体育活动肯定会损害学生上学的主要原因之一：学习并从日常生活中的数字干扰中获得休息。"}]},{"sentences":[{"text":"The real problem is that the parks have been chronically starved of funding.","explainMd":"**1. 翻译**\n\n真正的问题在于，公园一直处于长期的资金匮乏之中。\n\n**2. 重难点词汇和短语**\n\n- `The real problem is`: 真正的问题在于\n- `the parks`: 公园\n- `have been chronically starved of`: 一直处于长期的...之中\n- `funding`: 资金\n\n**3. 句子结构**\n\n这是一个简单句，由主语 `The real problem`，谓语 `is`，以及宾语 `that the parks have been chronically starved of funding` 组成。\n\n**4. 语法**\n\n这句话使用了 `have been + past participle` 的被动语态结构，表示公园一直处于被动接受状态，即长期的资金匮乏。\n\n**5. 知识点总结**\n\n- `The real problem is` 是一个常见的表达方式，用来引出问题的实质或核心。\n- `have been + past participle` 是现在完成进行时的被动语态，表示某种状态或行为从过去开始一直持续到现在，强调过程或效果。\n\n**6. 相似句子练习**\n\nThe real issue is that the education system has been chronically lacking in resources.\n\n真正的问题是，教育系统一直处于长期的资源匮乏之中。"},{"text":"We conducted a comprehensive survey examining how U.S. residents view their national parks, and we found that Americans place a very high value on them— whether or not they actually visit them.","explainMd":"**1. 翻译**\n\n我们进行了一项全面的调查，研究了美国居民如何看待他们的国家公园，我们发现美国人非常重视他们——无论他们是否真的去过这些公园。\n\n**2. 重难点词汇和短语**\n\n- `conducted`: 进行\n- `comprehensive survey`: 全面调查\n- `examining`: 研究\n- `U.S. residents`: 美国居民\n- `national parks`: 国家公园\n- `found`: 发现\n- `Americans`: 美国人\n- `place a very high value on`: 非常重视\n- `whether or not`: 无论是否\n\n**3. 句子结构**\n\n这是一个复合句，由两个并列的主从复合句组成：\n\n1) 我们进行了一项全面的调查，研究了美国居民如何看待他们的国家公园。\n2) 我们发现美国人非常重视他们——无论他们是否真的去过这些公园。\n\n**4. 语法**\n\n1) 第一部分用了一般过去时的被动语态`conducted`表示调查被进行了。\n2) 第二部分用的是一般过去时的主动语态`found`表示我们发现了某事。\n\n**5. 知识点总结**\n\n- `conducted`作为过去时的被动语态，表示某事被进行了，而不强调是谁进行的。\n- `found`作为一般过去时的主动语态，表示发现某事。此处的`found`后接的是宾语从句，说明了被发现的具体内容。\n- `whether or not`是一个常见的连词短语，表示\"无论是否\"。\n\n**6. 相似句子练习**\n\nWe conducted a detailed study on how students view their school curriculum, and we discovered that students highly appreciate it—whether or not they actually enjoy studying it.\n\n我们进行了一项详细的研究，探讨学生如何看待他们的学校课程，我们发现学生们非常重视它——无论他们是否真正喜欢学习它。"},{"text":"The peer-reviewed economic survey of 700 U. S. taxpayers, conducted by mail and internet, also found that people would be willing to pay a significant amount of money to make sure the parks and their programs are kept intact.","explainMd":"**1. 翻译**\n\n这项经过同行评审的对700名美国纳税人进行的经济调查（通过邮件和互联网进行）也发现，人们愿意支付一大笔钱来确保公园及其项目得以保持完整。\n\n**2. 重难点词汇和短语**\n\n- `peer-reviewed`: 同行评审的\n- `economic survey`: 经济调查\n- `taxpayers`: 纳税人\n- `conducted by mail and internet`: 通过邮件和互联网进行的\n- `found`: 发现\n- `be willing to`: 愿意\n- `significant amount of money`: 一大笔钱\n- `make sure`: 确保\n- `kept intact`: 保持完整\n\n**3. 句子结构**\n\n这是一个主从复合句，主句是\"这项经济调查也发现\"，从句是\"人们愿意支付一大笔钱来确保公园及其项目得以保持完整\"。\n\n**4. 语法**\n\n1) 这个句子的时态是一般过去时，主语\"这项经济调查\"和谓语动词\"发现\"构成主句。\n2) \"人们愿意支付一大笔钱来确保公园及其项目得以保持完整\"是一个表示结果的宾语从句。\n\n**5. 知识点总结**\n\n- `peer-reviewed`是一个形容词，指的是由同行或专业人士进行评估的。\n- `be willing to`是一个表示愿意做某事的短语，后面通常接动词的原形。\n- `make sure`是一个固定短语，表示确保某事发生。\n\n**6. 相似句子练习**\n\nThe peer-reviewed research on the effects of pollution, conducted through various surveys and studies, also found that people would be willing to pay a considerable amount of money to ensure a cleaner environment.\n\n这项经过同行评审的对污染影响进行的研究（通过各种调查和研究进行）也发现，人们愿意支付一大笔钱来确保环境更加清洁。"},{"text":"Some 81% of respondents said they would be willing to pay additional taxes for the next 10 years to avoid any cuts to the national parks.","explainMd":"**1. 翻译**\n\n有81%的受访者表示，他们愿意在接下来的10年里支付额外的税款，以避免对国家公园进行任何削减。\n\n**2. 重难点词汇和短语**\n\n- `respondents`: 受访者\n- `be willing to`: 愿意\n- `pay additional taxes`: 支付额外的税款\n- `for the next 10 years`: 在接下来的10年里\n- `avoid`: 避免\n- `any cuts to`: 任何削减\n- `national parks`: 国家公园\n\n**3. 句子结构**\n\n这是一个简单句，主句是\"有81%的受访者表示他们愿意在接下来的10年里支付额外的税款，以避免对国家公园进行任何削减\"。\n\n**4. 语法**\n\n1) 这个句子的时态是一般过去时，主语\"81%的受访者\"和谓语动词\"表示\"构成主句。\n2) \"他们愿意在接下来的10年里支付额外的税款，以避免对国家公园进行任何削减\"是一个表示结果的宾语从句。\n\n**5. 知识点总结**\n\n- `be willing to`是一个表示愿意做某事的短语，后面通常接动词的原形。\n- `for the next 10 years`是一个时间短语，表示在接下来的10年里。\n- `avoid`是一个动词，表示避免。\n\n**6. 相似句子练习**\n\nSome 70% of participants stated they would be willing to contribute extra funds for the next 5 years to prevent any reductions to the local library services.\n\n有70%的参与者表示，他们愿意在接下来的5年里提供额外的资金，以防止对当地图书馆服务进行任何削减。"}]},{"sentences":[{"text":"The national parks provide great value to U.S. residents both as places to escape and as symbols of nature.","explainMd":"**1. 翻译**\n\n国家公园为美国居民提供了巨大的价值，既是他们逃离现实的场所，也是自然的象征。\n\n**2. 重难点词汇和短语**\n\n- `national parks`: 国家公园\n- `provide`: 提供\n- `great value`: 巨大的价值\n- `U.S. residents`: 美国居民\n- `both as`: 既作为\n- `places to escape`: 逃离现实的场所\n- `symbols of nature`: 自然的象征\n\n**3. 句子结构**\n\n\"国家公园为美国居民提供了巨大的价值，既是他们逃离现实的场所，也是自然的象征。\"这是一个简单句，主句是\"国家公园为美国居民提供了巨大的价值\"，然后使用并列连词\"both...and...\"连接了两个并列的宾补成分\"逃离现实的场所\"和\"自然的象征\"。\n\n**4. 语法**\n\n1) 主谓宾结构。主语\"国家公园\"，谓语\"为美国居民提供了巨大的价值\"。\n2) \"both...and...\"表示\"既…又…\"，用来连接两个并列的成分。\n\n**5. 知识点总结**\n\n- `provide`是一个动词，表示提供。\n- `both...and...`是一个并列连词，表示\"既...又...\"。\n- `places to escape`：逃离现实的场所，这里的`to escape`是动词不定式作定语，修饰`places`。\n\n**6. 相似句子练习**\n\nThe local library offers immense value to city residents both as a source of knowledge and as a community hub.\n\n本地图书馆为城市居民提供了巨大的价值，既是知识的源泉，也是社区的中心。"},{"text":"On top of this, they produce value from their extensive educational programs, their positive impact on the climate through carbon sequestration, their contribution to our cultural and artistic life, and of course through tourism.","explainMd":"**1. 翻译**\n\n在此之上，他们通过广泛的教育项目，对气候的积极影响（通过碳封存），对我们的文化和艺术生活的贡献，当然还有旅游业，创造了价值。\n\n**2. 重难点词汇和短语**\n\n- `On top of this`: 在此之上\n- `produce value`: 创造价值\n- `extensive educational programs`: 广泛的教育项目\n- `positive impact on the climate`: 对气候的积极影响\n- `carbon sequestration`: 碳封存\n- `contribution to our cultural and artistic life`: 对我们的文化和艺术生活的贡献\n- `through tourism`: 通过旅游业\n\n**3. 句子结构**\n\n此句是一个复合句，主句是\"他们创造了价值\"，之后使用并列连词\"and\"连接了四个并列的方式状语\"通过广泛的教育项目\"，\"通过碳封存对气候的积极影响\"，\"对我们的文化和艺术生活的贡献\"和\"通过旅游业\"。\n\n**4. 语法**\n\n1) 主谓宾结构。主语\"他们\"，谓语\"创造了价值\"。\n2) 逗号和\"and\"用于连接并列的成分。\n\n**5. 知识点总结**\n\n- `On top of this` 是一个短语，表示\"除此之外\"或\"在此之上\"。\n- `produce value` 是一个动词短语，表示\"创造价值\"。\n- `through` 是一个介词，表示通过某种方式或手段。\n\n**6. 相似句子练习**\n\nOn top of this, the school generates value through its comprehensive academic courses, its positive impact on the community, its contribution to the sports culture, and of course, through the various events organized.\n\n在此之上，学校通过其全面的学术课程，对社区的积极影响，对体育文化的贡献，当然还有通过组织的各种活动，创造了价值。"},{"text":"The parks also help keep America's past alive, working with thousands of local jurisdictions around the country to protect historical sites—including Ellis Island and Gettysburg一and to bring the stories of these places to life.","explainMd":"**1. 翻译**\n\n公园还帮助保持美国的历史活力，与全国数千个地方司法管辖区一起保护历史遗址，包括艾利斯岛和葛底斯堡，并使这些地方的故事活灵活现。\n\n**2. 重难点词汇和短语**\n\n- `keep...alive`: 保持...活着\n- `working with`: 与...一起工作\n- `local jurisdictions`: 地方司法管辖区\n- `protect`: 保护\n- `historical sites`: 历史遗址\n- `bring...to life`: 使...活灵活现\n\n**3. 句子结构**\n\n此句是一个复合句，主句是\"公园帮助保持美国的历史活着\"，之后的部分是状语从句描述公园如何做到这一点，即\"与全国数千个地方司法管辖区一起保护历史遗址，并使这些地方的故事活灵活现\"。\n\n**4. 语法**\n\n1) 主谓宾结构。主语\"公园\"，谓语\"帮助\"，宾语\"保持美国的历史活着\"。\n2) \"working with\"，\"including\"和\"and\"连接了并列的状语。\n\n**5. 知识点总结**\n\n- `keep...alive` 是一个短语，表示保持...活着，继续存在。\n- `working with` 是一个短语，表示与...一起工作。\n- `bring...to life` 是一个短语，表示使...活灵活现，使...生动。\n\n**6. 相似句子练习**\n\nThe museum also helps keep the city's history alive, working with numerous local communities to protect historical relics, including ancient manuscripts and artifacts, and to bring the stories of these items to life.\n\n博物馆也帮助保持城市的历史活着，与许多本地社区一起保护历史遗物，包括古代手稿和文物，并使这些物品的故事活灵活现。"}]},{"sentences":[{"text":"The parks do all this on a shoestring.","explainMd":"**1. 翻译**\n\n公园以极少的预算完成了所有这些工作。\n\n**2. 重难点词汇和短语**\n\n- `do all this`: 完成所有这些\n- `on a shoestring`: 以极少的预算，经费有限\n\n**3. 句子结构**\n\n该句是一个简单句，主语是\"公园(The parks)\"，谓语动词是\"做(do)\"，宾语是\"所有这些(all this)\"，状语是\"以极少的预算(on a shoestring)\"。\n\n**4. 语法**\n\n- 这个句子使用了简单的主谓宾结构。主语是\"The parks\"，谓语是\"do\"，宾语是\"all this\"。\n- \"on a shoestring\"是一个短语，作为状语，描述公园是如何做到这一切的。\n\n**5. 知识点总结**\n\n- `do all this` 是一个短语，表示完成所有这些。\n- `on a shoestring` 是一个习语，表示在经济紧张或预算有限的情况下操作。\n\n**6. 相似句子练习**\n\nThe organization manages to do all this on a shoestring.\n\n这个组织设法以极少的预算完成了所有这些工作。"},{"text":"Congress allocates only $3 billion a year to the national park system—an amount that has been flat since 2001 (in inflation-adjusted dollars) with the exception of a onetime boost in 2009 as part of the Obama stimulus package.","explainMd":"**1. 翻译**\n\n国会每年只为国家公园系统拨款30亿美元——这个数额自2001年以来（以通胀调整后的美元计）一直保持不变，唯一的例外是2009年的一次增加。\n\n**2. 重难点词汇和短语**\n\n- `allocates`: 拨款\n- `flat`: 不变的\n- `inflation-adjusted dollars`: 通胀调整后的美元\n- `with the exception of`: 除...之外\n- `onetime boost`: 一次性增加\n- `stimulus package`: 刺激计划\n\n**3. 句子结构**\n\n这是一个复合句，主句是\"Congress allocates only $3 billion a year to the national park system\"，修饰主句的定语从句是\"an amount that has been flat since 2001 (in inflation-adjusted dollars) with the exception of a onetime boost in 2009 as part of the Obama stimulus package\"。\n\n**4. 语法**\n\n- 主句使用了基本的主谓宾结构（\"Congress allocates only $3 billion a year to the national park system\"）。\n- 定语从句\"an amount that has been flat since 2001 (in inflation-adjusted dollars) with the exception of a onetime boost in 2009 as part of the Obama stimulus package\"使用了关系代词\"that\"连接，用来修饰\"an amount\"。\n\n**5. 知识点总结**\n\n- `allocates` 是一个动词，表示分配或拨款。\n- `flat` 在这里是一个形容词，表示不变的或平坦的。\n- `inflation-adjusted dollars` 是一个短语，表示通胀调整后的美元。\n- `with the exception of` 是一个短语，表示除...之外。\n- `onetime boost` 是一个短语，表示一次性的增加或提升。\n- `stimulus package` 是一个名词短语，表示经济刺激计划。\n\n**6. 相似句子练习**\n\nThe university allocates only a small amount of funds to the research department—an amount that has been flat for the past five years, with the exception of a onetime boost last year as part of a special grant.\n\n大学每年只为研究部门分配一小部分资金——过去五年来这个数额一直保持不变，唯一的例外是去年作为特殊资助的一部分提供的一次性增加。"},{"text":"Meanwhile, the number of annual visitors has increased by more than 50% since 1980, and now stands at 330 million visitors per year.","explainMd":"**1. 翻译**\n\n与此同时，自1980年以来，每年的游客数量已经增加了50%以上，现在每年的游客数量已经达到3.3亿。\n\n**2. 重难点词汇和短语**\n\n- `Meanwhile`: 与此同时\n- `annual visitors`: 每年的游客\n- `has increased by`: 增加了\n- `stands at`: 达到\n\n**3. 句子结构**\n\n该句子是一个简单句，包括两个独立的句子，通过并列连词 \"and\" 连接在一起。\n\n第一句子：\"Meanwhile, the number of annual visitors has increased by more than 50% since 1980\"，主语是 \"the number of annual visitors\"，谓语是 \"has increased by more than 50% since 1980\"。\n\n第二句子：\"now stands at 330 million visitors per year\"，主语是 \"the number of annual visitors\"（省略），谓语是 \"now stands at 330 million visitors per year\"。\n\n**4. 语法**\n\n- `Meanwhile` 是一个副词，用于在叙述中引入一个新的、与之前相关的事实或观点。\n- `has increased by` 这个短语表示了一种增长或提升，使用了现在完成时的形式，表示从过去某一时间点开始一直持续到现在的动作或状态。\n- `stands at` 是一个表示当前状态或位置的短语。\n\n**5. 知识点总结**\n\n- `Meanwhile` 是一个副词，表示同时发生的情况。\n- `has increased by` 使用现在完成时，表示从过去到现在的持续改变。\n- `stands at` 表示当前的状态或位置。\n\n**6. 相似句子练习**\n\nMeanwhile, the population of the city has increased by more than 20% since 1990, and now stands at 5 million.\n\n与此同时，自1990年以来，该城市的人口已经增加了20%以上，现在已经达到500万。"}]}],"title":""}