{"translate":"","paragraphs":[{"sentences":[{"text":"Communities throughout New England have been attempting to regulate short-term rentals since sites like Airbnb took off in the 2010s.","explainMd":"## 1. 翻译\n\n\"自从Airbnb等网站在2010年代兴起以来，新英格兰各社区一直在尝试对短期租赁进行管制。\"\n\n## 2. 词汇和短语\n\n- **Communities throughout New England**: 新英格兰各社区\n- **Have been attempting to regulate**: 一直在尝试管制\n- **Short-term rentals**: 短期租赁\n- **Since sites like Airbnb took off in the 2010s**: 自从Airbnb等网站在2010年代兴起以来\n\n## 3. 句子结构\n\n这是一个复合句，主句是\"Communities throughout New England have been attempting to regulate short-term rentals\"，其中包含一个时间状语从句\"since sites like Airbnb took off in the 2010s\"。\n\n## 4. 语法\n\n这个句子使用了现在完成进行时态（\"have been attempting\"），表示从过去某一时间点开始持续到现在的动作或状态。\"Since\"引导的时间状语从句用来表达这个动作或状态开始的时间。\n\n## 5. 知识点总结\n\n- **使用现在完成进行时态**：这个句子中的\"have been attempting\"使用了现在完成进行时态，用来表达从过去某一时间点开始持续到现在的动作或状态，这是一种在英文中常用的时态。\n- **描述尝试或努力**：这个句子中的\"have been attempting to regulate\"用来描述社区一直在尝试管制短期租赁，这是一种在英文中常用的表达方式。\n\n## 6. 练习相似句子\n\n\"Countries around the world have been trying to reduce carbon emissions since the Paris Agreement was signed in 2016.\"\n\n\"自从2016年巴黎协定签署以来，全球各国一直在尝试减少碳排放。\""},{"text":"Now, with record-high home prices and historically low inventory, there's an increased urgency in such regulation, particularly among those who worry that developers will come in and buy up swaths of housing to flip for a fortune on the short-term rental market.","explainMd":"## 1. 翻译\n\n\"现在，由于房价创历史新高，而库存历史新低，对这种规定的紧迫性增加，特别是那些担心开发商会进来购买大片房产，然后在短租市场上大赚一笔\"\n\n## 2. 词汇和短语\n\n- **Now, with record-high home prices and historically low inventory**: 现在，由于房价创历史新高，而库存历史新低\n- **There's an increased urgency in such regulation**: 对这种规定的紧迫性增加\n- **Particularly among those who worry that developers will come in and buy up swaths of housing**: 特别是那些担心开发商会进来购买大片房产的人\n- **To flip for a fortune on the short-term rental market**: 然后在短租市场上翻手为云覆手为雨\n\n## 3. 句子结构\n\n这是一个复合句，主句是\"There's an increased urgency in such regulation\"，其中包含一个时间状语\"Now, with record-high home prices and historically low inventory\"和一个特别状语\"particularly among those who worry that developers will come in and buy up swaths of housing to flip for a fortune on the short-term rental market\"。\n\n## 4. 语法\n\n这个句子使用了现在时态（\"is\"），表示的是一种持续存在的状态。\n\n## 5. 知识点总结\n\n- **描述紧迫性或重要性**：这个句子中的\"There's an increased urgency in such regulation\"用来描述对短租市场规定的紧迫性增加，这是一种在英文中常用的表达方式。\n- **使用\"with\"引导的时间状语**：这个句子中的\"With record-high home prices and historically low inventory\"用来表达由于房价创历史新高，而库存历史新低这样的背景条件，这是一种在英文中常用的句型。\n\n## 6. 练习相似句子\n\n\"Now, with increasing pollution and declining air quality, there's an increased urgency in such regulation, particularly among those who worry that industries will continue to discharge pollutants without control.\"\n\n\"现在，随着污染加剧和空气质量下降，对这种规定的紧迫性增加，特别是那些担心工业会继续无控制地排放污染物的人更是深感如此。\""}]},{"sentences":[{"text":"In New Hampshire, where the rental vacancy rate has dropped below 1 percent, housing advocates fear unchecked short-term rentals will put further pressure on an already strained market.","explainMd":"## 1. 翻译\n\n\"在新罕布什尔州，由于租房空置率已经下降到1%以下，住房倡导者们担心，未经监管的短期租赁将对已经紧张的市场施加进一步的压力。\"\n\n## 2. 词汇和短语\n\n- **In New Hampshire, where the rental vacancy rate has dropped below 1 percent**: 在新罕布什尔州，由于租房空置率已经下降到1%以下\n- **Housing advocates**: 住房倡导者们\n- **Fear**: 担心\n- **Unchecked short-term rentals**: 未经检查的短期租赁\n- **Will put further pressure on**: 将对...施加进一步的压力\n- **An already strained market**: 已经紧张的市场\n\n## 3. 句子结构\n\n这是一个复合句，主句是\"Housing advocates fear unchecked short-term rentals will put further pressure on an already strained market\"。其中包含一个地点状语从句\"In New Hampshire, where the rental vacancy rate has dropped below 1 percent\"。\n\n## 4. 语法\n\n这个句子使用了将来时态（\"will put\"），表示的是未来可能发生的情况。\"Where\"引导的地点状语从句用来描述这个情况发生的地方。\n\n## 5. 知识点总结\n\n- **描述担忧或恐惧**：这个句子中的\"fear\"用来描述住房倡导者们对未经检查的短期租赁可能带来的影响的担忧，这是一种在英文中"},{"text":"The state Legislature recently voted against a bill that would've made it illegal for towns to create legislation restricting short-term rentals.","explainMd":"## 1. 翻译\n\n\"该州立法机关最近投票反对一项法案，该法案将使城镇制定限制短期租赁的立法变为非法。\"\n\n## 2. 词汇和短语\n\n- **The state Legislature**: 该州立法机关\n- **Recently voted against**: 最近投票反对\n- **A bill that would've made it illegal for**: 一项将...变为非法的法案\n- **Towns to create legislation restricting short-term rentals**: 城镇制定限制短期租赁的立法\n\n## 3. 句子结构\n\n这是一个简单句，主语是\"The state Legislature\"，谓语是\"recently voted against\"，宾语是\"a bill that would've made it illegal for towns to create legislation restricting short-term rentals\"。\n\n## 4. 语法\n\n这个句子使用了过去时态（\"voted\"），表示的是已经发生的动作。\"That\"引导的定语从句用来修饰\"a bill\"。\n\n## 5. 知识点总结\n\n- **描述过去的动作**：这个句子中的\"recently voted against\"用来描述立法机关最近的投票行为，这是一种在英文中常用的表达方式。\n- **使用\"That\"引导的定语从句**：这个句子中的\"that would've made it illegal for towns to create legislation restricting short-term rentals\"是一个定语从句，用来修饰\"a bill\"，这是一种在英文中常用的句型。\n\n## 6. 练习相似句子\n\n\"The city council recently voted against a proposal that would've made it illegal for businesses to operate after midnight.\"\n\n\"市议会最近投票反对一项提案，该提案将使商家在午夜后运营变为非法。\""}]},{"sentences":[{"text":"\"We are at a crisis level on the supply of rental housing,” said Nick Taylor, executive director of the Workforce Housing Coalition of the Greater Seacoast.","explainMd":"## 1. 翻译\n\n\"Nick Taylor，大海滨劳动力住房联盟的执行董事说：“我们在租赁住房供应上已经达到了危机级别。”\"\n\n## 2. 词汇和短语\n\n- **\"We are at a crisis level on the supply of rental housing”**: \"我们在租赁住房供应上已经达到了危机级别\"\n- **Said Nick Taylor, executive director of the Workforce Housing Coalition of the Greater Seacoast**: Nick Taylor，大海滨劳动力住房联盟的执行董事说\n\n## 3. 句子结构\n\n这是一个简单句，主语是\"We\"，谓语是\"are\"，宾语是\"at a crisis level on the supply of rental housing\"。引述的人是\"Nick Taylor, executive director of the Workforce Housing Coalition of the Greater Seacoast\"。\n\n## 4. 语法\n\n这个句子使用了现在时态（\"are\"），表示的是当前存在的状态。\n\n## 5. 知识点总结\n\n- **描述当前状态**：这个句子中的\"are at a crisis level\"用来描述当前的状态，这是一种在英文中常用的表达方式。\n- **引述**：这个句子中的\"said Nick Taylor, executive director of the Workforce Housing Coalition of the Greater Seacoast\"用来引述Nick Taylor的话，这是一种在英文中常用的句型。\n\n## 6. 练习相似句子\n\n\"We are at a critical stage in the fight against climate change,\" said John Smith, director of the Environmental Protection Agency.\n\n\"约翰·史密斯，环境保护署的主任说：“我们在对抗气候变化的斗争中已经达到了关键阶段。”\""},{"text":"Without enough affordable housing in southern New Hampshire towns, “ employers are having a hard time attracting employees, and workers are having a hard time finding a place to live,” Taylor said.","explainMd":"## 1. 翻译\n\n\"Taylor说，由于南部新罕布什尔镇没有足够的可负担住房，“雇主们难以吸引员工，而工人们也难以找到住所。”\n\n## 2. 词汇和短语\n\n- **Without enough affordable housing in southern New Hampshire towns**: 在南部新罕布什尔镇没有足够的可负担住宅\n- **Employers are having a hard time attracting employees**: 雇主们难以吸引员工\n- **And workers are having a hard time finding a place to live**: 而工人们也难以找到住所\n- **Taylor said**: Taylor说\n\n## 3. 句子结构\n\n这是一个复合句，主句是\"Employers are having a hard time attracting employees, and workers are having a hard time finding a place to live\"。其中包含一个前置状语\"Without enough affordable housing in southern New Hampshire towns\"。\n\n## 4. 语法\n\n这个句子使用了现在进行时态（\"are having\"），表示的是当前正在发生的情况。\"Without\"引导的状语从句用来描述这个情况发生的条件。\n\n## 5. 知识点总结\n\n- **描述当前正在发生的情况**：这个句子中的\"are having a hard time\"用来描述当前正在发生的情况，这是一种在英文中常用的时态。\n- **描述条件**：这个句子中的\"Without enough affordable housing in southern New Hampshire towns\"用来描述这个情况发生的条件，"}]},{"sentences":[{"text":"However, short-term rentals also provide housing for tourists, pointed out Ryan Castle, CEO of a local association of realtors.","explainMd":"## 1. 翻译\n\n\"然而，短期租赁也为游客提供住宿，这是当地房地产经纪人协会的首席执行官Ryan Castle指出的。\"\n\n## 2. 词汇和短语\n\n- **However**: 然而\n- **Short-term rentals**: 短期租赁\n- **Also provide housing for tourists**: 也为游客提供住宿\n- **Pointed out Ryan Castle, CEO of a local association of realtors**: 当地房地产经纪人协会的首席执行官Ryan Castle指出\n\n## 3. 句子结构\n\n这是一个简单句，主语是\"Short-term rentals\"，谓语是\"also provide\"，宾语是\"housing for tourists\"。引述的人是\"Ryan Castle, CEO of a local association of realtors\"。\n\n## 4. 语法\n\n这个句子使用了现在时态（\"provide\"），表示的是一种客观事实。\n\n## 5. 知识点总结\n\n- **描述客观事实**：这个句子中的\"also provide\"用来描述短期租赁也为游客提供住宿这样一种客观事实，这是一种在英文中常用的表达方式。\n- **引述**：这个句子中的\"pointed out Ryan Castle, CEO of a local association of realtors\"用来引述Ryan Castle的话，这是一种在英文中常用的句型。\n\n## 6. 练习相似句子\n\n\"However, online platforms also provide opportunities for remote work, pointed out Jane Smith, CEO of a local tech company.\"\n\n\"然而，在线平台也为远程工作提供了机会，这是当地一家科技公司的首席执行官Jane Smith指出的。"},{"text":"\"A lot of workers are servicing the tourist industry, and the tourism industry is serviced by those people coming in short term,\" Castle said, \"and so it's a cyclical effect.\"","explainMd":"## 1. 翻译\n\n\"Castle说，“有很多工人在为旅游业提供服务，而短期入住的人们也在为旅游业提供服务，所以这是一个周期性效应。”\"\n\n## 2. 词汇和短语\n\n- **A lot of workers are servicing the tourist industry**: 有很多工人在为旅游业提供服务\n- **And the tourism industry is serviced by those people coming in short term**: 而短期入住的人们也在为旅游业提供服务\n- **Castle said, \"and so it's a cyclical effect.\"**: Castle说，“所以这是一个循环效应。”\n\n## 3. 句子结构\n\n这是一个复合句，主句是\"A lot of workers are servicing the tourist industry, and the tourism industry is serviced by those people coming in short term\"。引述的人是\"Castle\"。\n\n## 4. 语法\n\n这个句子使用了现在进行时态（\"are servicing\"， \"is serviced\"），表示的是当前正在发生的情况。\n\n## 5. 知识点总结\n\n- **描述当前正在发生的情况**：这个句子中的\"are servicing\"和\"is serviced\"用来描述当前正在发生的情况，这是一种在英文中常用的时态。\n- **引述**：这个句子中的\"said\"用来引述Castle的话，这是一种在英文中常用的句型。\n\n## 6. 练习相似句子\n\n\"A lot of companies are investing in renewable energy, and the renewable energy sector is boosted by these investments,\" Smith said, \"and so it's a reinforcing cycle.\"\n\n\"Smith说：“有很多公司正在投资可再生能源，而这些投资也在推动可再生能源行业的发展，所以这是一个互相促进的循环。”\""}]},{"sentences":[{"text":"Short-term rentals themselves are not the crux of the issue, said Keren Hom, an expert on affordable housing policy. \"","explainMd":"## 1. 翻译\n\n\"Keren Hom，一位可负担住房政策的专家说，短期租赁本身并不是问题的关键所在。\"\n\n## 2. 词汇和短语\n\n- **Short-term rentals themselves**: 短期租赁本身\n- **Are not the crux of the issue**: 并不是问题的核心所在\n- **Said Keren Hom, an expert on affordable housing policy**: Keren Hom，一位可负担住房政策的专家说\n\n## 3. 句子结构\n\n这是一个简单句，主语是\"Short-term rentals themselves\"，谓语是\"are not\"，宾语是\"the crux of the issue\"。引述的人是\"Keren Hom, an expert on affordable housing policy\"。\n\n## 4. 语法\n\n这个句子使用了现在时态（\"are\"），表示的是一种客观事实。\n\n## 5. 知识点总结\n\n- **描述客观事实**：这个句子中的\"are not the crux of the issue\"用来描述短期租赁本身并不是问题的核心所在这样一种客观事实，这是一种在英文中常用的表达方式。\n- **引述**：这个句子中的\"said\"用来引述Keren Hom的话，这是一种在英文中常用的句型。\n\n## 6. 练习相似句子\n\n\"Online learning itself is not the main challenge, said John Smith, an expert on education policy.\"\n\n\"John Smith，一位教育政策专家说，网络学习本身并不是主要的挑战。\""},{"text":"I think individuals being able to rent out their second home is a good thing.","explainMd":"## 1. 翻译\n\n\"我认为个人能够出租他们的第二套房子是一件好事。\"\n\n## 2. 词汇和短语\n\n- **I think**: 我认为\n- **Individuals being able to rent out their second home**: 个人能够出租他们的第二套房子\n- **Is a good thing**: 是一件好事\n\n## 3. 句子结构\n\n这是一个简单句，主语是\"Individuals being able to rent out their second home\"，谓语是\"is\"，宾语是\"a good thing\"。\n\n## 4. 语法\n\n这个句子使用了现在时态（\"is\"），表示的是一种客观事实。句中的\"being able to rent out their second home\"是一个动名词短语，作为主语。\n\n## 5. 知识点总结\n\n- **描述客观事实**：这个句子中的\"is a good thing\"用来描述个人能够出租他们的第二套房子是一件好事这样一种客观事实，这是一种在英文中常用的表达方式。\n- **使用动名词短语作为主语**：这个句子中的\"Individuals being able to rent out their second home\"是一个动名词短语，作为主语，这是一种在英文中常用的句型。\n\n## 6. 练习相似句子\n\n\"I think companies investing in renewable energy is a positive trend.\"\n\n\"我认为公司投资可再生能源是一种积极的趋势。\""},{"text":"If ifs their vacation home anyway, and it's just empty, why can't you make money off it Hom said.","explainMd":"## 1. 翻译\n\n\"Hom说，如果那是他们的度假屋，反正就是空着的，那么他们为什么不能从中赚钱呢？\"\n\n## 2. 词汇和短语\n\n- **If ifs their vacation home anyway**: 如果那是他们的度假屋，反正就是空着的\n- **And it's just empty**: (这里与上文重复，可能是原文的笔误)\n- **Why can't you make money off it**: 那么他们为什么不能从中赚钱呢\n- **Hom said**: Hom说\n\n## 3. 句子结构\n\n这是一个复合句，主句是\"Why can't you make money off it\"，前面的\"If ifs their vacation home anyway, and it's just empty\"是一个条件状语从句。引述的人是\"Hom\"。\n\n## 4. 语法\n\n这个句子使用了情态动词（\"can't\"），表示的是一种可能性。\"If\"引导的条件状语从句用来描述这个可能性出现的条件。\n\n## 5. 知识点总结\n\n- **描述可能性**：这个句子中的\"can't\"用来描述他们为什么不能从中赚钱这样一种可能性，这是一种在英文中常用的情态动词。\n- **描述条件**：这个句子中的\"If ifs their vacation home anyway, and it's just empty\"用来描述这个可能性出现的条件，这是一种在英文中常用的句型。\n\n## 6. 练习相似句子\n\n\"If it's their old car anyway, and it's just idle, why can't they sell it,\" John said.\n\n\"John说，如果那是他们的旧车，反正就是闲置的，那么他们为什么不能卖掉呢？\""},{"text":"Issues arise, however, when developers attempt to create large-scale short-term rental facilities—de facto hotels—to bypass taxes and regulations. \"","explainMd":"## 1. 翻译\n\n\"然而，当开发商尝试创建大规模的短期租赁设施——实际上就是酒店——以规避税收和监管时，问题就出现了。\"\n\n## 2. 词汇和短语\n\n- **Issues arise**: 问题就出现了\n- **However**: 然而\n- **When developers attempt to create large-scale short-term rental facilities—de facto hotels**: 当开发商尝试创建大规模的短期租赁设施——实际上就是酒店\n- **To bypass taxes and regulations**: 以规避税收和监管\n\n## 3. 句子结构\n\n这是一个复合句，主句是\"Issues arise\"，其中\"When developers attempt to create large-scale short-term rental facilities—de facto hotels—to bypass taxes and regulations\"是一个时间状语从句。\n\n## 4. 语法\n\n这个句子使用了现在时态（\"arise\"），表示的是一种客观事实。\"When\"引导的时间状语从句用来描述这个事实出现的条件。\n\n## 5. 知识点总结\n\n- **描述客观事实**：这个句子中的\"Issues arise\"用来描述问题出现这样一种客观事实，这是一种在英文中常用的表达方式。\n- **描述条件**：这个句子中的\"When developers attempt to create large-scale short-term rental facilities—de facto hotels—to bypass taxes and regulations\"用来描述这个事实出现的条件，这是一种在英文中常用的句型。\n\n## 6. 练习相似句子\n\n\"Issues emerge, however, when companies try to exploit loopholes in the law to evade taxes,\" the lawyer said.\n\n\"律师说，然而，当公司试图利用法律的漏洞来逃避税收时，问题就出现了。\""},{"text":"I think the question is, shouldn't a developer who's really building a hotel, but disguising it as not a hotel, be treated and taxed and regulated like a hotel?","explainMd":"## 1. 翻译\n\n\"我认为问题在于，实际上正在建设酒店的开发商，但是假装不是酒店，他们是否应该像酒店一样被对待、纳税和接受监管？\"\n\n## 2. 词汇和短语\n\n- **I think the question is**: 我认为问题在于\n- **Shouldn't a developer who's really building a hotel, but disguising it as not a hotel**: 实际上正在建设酒店的开发商，但是假装不是酒店\n- **Be treated and taxed and regulated like a hotel?**: 是否应该像酒店一样被对待、纳税和接受监管\n\n## 3. 句子结构\n\n这是一个复合句，主句是\"Shouldn't a developer who's really building a hotel, but disguising it as not a hotel, be treated and taxed and regulated like a hotel?\"，前面的\"I think the question is\"是一个插入语。\n\n## 4. 语法\n\n这个句子使用了情态动词（\"shouldn't\"），表示的是一种推测或建议。句中的\"who's really building a hotel, but disguising it as not a hotel\"是一个定语从句，修饰\"developer\"。\n\n## 5. 知识点总结\n\n- **描述推测或建议**：这个句子中的\"shouldn't\"用来描述一种推测或建议，这是一种在英文中常用的情态动词。\n- **使用定语从句修饰名词**：这个句子中的\"who's really building a hotel, but disguising it as not a hotel\"是一个定语从句，修饰\"developer\"，这是一种在英文中常用的句型。\n\n## 6. 练习相似句子\n\n\"I think the question is, shouldn't a company who's really polluting the environment, but pretending not to, be punished and fined like other polluters?\" \n\n\"我认为问题在于，实际上正在污染环境的公司，但是假装不是，他们是否应该像其他污染者一样被惩罚和罚款？\""},{"text":"Hom said.","explainMd":"Hom 说"}]},{"sentences":[{"text":"At the end of 2018, Governor Charlie Baker of Massachusetts signed a bill to rein in those potential investor-buyers.","explainMd":"## 1. 翻译\n\n\"在2018年底，马萨诸塞州的州长Charlie Baker签署了一项法案，以遏制那些潜在的投资买家。\"\n\n## 2. 词汇和短语\n\n- **At the end of 2018**: 在2018年底\n- **Governor Charlie Baker of Massachusetts**: 马萨诸塞州的州长Charlie Baker\n- **Signed a bill**: 签署了一项法案\n- **To rein in those potential investor-buyers**: 以遏制那些可能的投资买家\n\n## 3. 句子结构\n\n这是一个简单句，主语是\"Governor Charlie Baker of Massachusetts\"，谓语是\"signed\"，宾语是\"a bill\"，\"to rein in those potential investor-buyers\"是动词\"signed\"的目的状语。\n\n## 4. 语法\n\n这个句子使用了一般过去时（\"signed\"），表示的是过去的情况。句中的\"to rein in those potential investor-buyers\"是一个不定式短语，用来表示动词\"signed\"的目的。\n\n## 5. 知识点总结\n\n- **描述过去的情况**：这个句子中的\"signed\"用来描述过去的情况，这是一种在英文中常用的时态。\n- **使用不定式短语表示动词的目的**：这个句子中的\"to rein in those potential investor-buyers\"是一个不定式短语，用来表示动词\"signed\"的目的，这是一种在英文中常用的句型。\n\n## 6. 练习相似句子\n\n\"At the beginning of 2020, President John Smith signed a law to control the rising pollution levels.\"\n\n\"在2020年初，总统John Smith签署了一项法律，以控制上升的污染水平。\""},{"text":"The bill requires every rental host to register with the state, mandates they carry insurance, and opens the potential for local taxes on top of a new state levy.","explainMd":"## 1. 翻译\n\n\"这项法案要求每个租赁主体向州政府注册，强制他们必须购买保险，并为新的州税之上开启了地方税的可能性。\"\n\n## 2. 词汇和短语\n\n- **The bill requires**: 这项法案要求\n- **Every rental host**: 每个租赁主体\n- **To register with the state**: 向州政府注册\n- **Mandates they carry insurance**: 强制他们必须购买保险\n- **And opens the potential for local taxes**: 并为地方税开启可能性\n- **On top of a new state levy**: 在新的州税之上\n\n## 3. 句子结构\n\n这是一个复合句，主句是\"The bill requires every rental host to register with the state, mandates they carry insurance, and opens the potential for local taxes on top of a new state levy\"，其中有三个并列的动词短语：\"requires every rental host to register with the state\"，\"mandates they carry insurance\"，和\"opens the potential for local taxes on top of a new state levy\"。\n\n## 4. 语法\n\n这个句子使用了现在时态（\"requires\", \"mandates\", \"opens\"），表示的是一种客观事实。句中用到了动词不定式（\"to register\"）和宾语从句（\"they carry insurance\"）。\n\n## 5. 知识点总结\n\n- **描述客观事实**：这个句子中的\"requires\", \"mandates\", \"opens\"用来描述一种客观事实，这是一种在英文中常用的表达方式。\n- **使用动词不定式和宾语从句**：这个句子中的\"to register\"和\"they carry insurance\"是两种不同类型的宾语结构，分别是动词不定式和宾语从句，这两种结构在英文中都是常见的。\n\n## 6. 练习相似句子\n\n\"The regulation requires every car owner to have insurance, mandates they pass the emission test, and opens the potential for fines for those who violate the rules.\"\n\n\"该规定要求每个车主必须有保险，强制他们必须通过排放测试，并为违规者设定了罚款的可能性。\""},{"text":"Boston took things even further, requiring renters to register with the city's Inspectional Services Department.","explainMd":"## 1. 翻译\n\n\"波士顿进一步加强了这一点，要求租客必须向城市的检查服务部门注册。\"\n\n## 2. 词汇和短语\n\n- **Boston took things even further**: 波士顿进一步加强了这一点\n- **Requiring renters**: 要求租客\n- **To register with the city's Inspectional Services Department**: 向城市的检查服务部门注册\n\n## 3. 句子结构\n\n这是一个复合句，主句是\"Boston took things even further\"，其中\"requiring renters to register with the city's Inspectional Services Department\"是一个非限制性定语从句，修饰\"Boston\"。\n\n## 4. 语法\n\n这个句子使用了一般过去时（\"took\"），表示的是过去的情况。句中的\"requiring renters to register with the city's Inspectional Services Department\"是一个非限制性定语从句，用来修饰\"Boston\"。\n\n## 5. 知识点总结\n\n- **描述过去的情况**：这个句子中的\"took\"用来描述过去的情况，这是一种在英文中常用的时态。\n- **使用非限制性定语从句修饰名词**：这个句子中的\"requiring renters to register with the city's Inspectional Services Department\"是一个非限制性定语从句，修饰\"Boston\"，这是一种在英文中常用的句型。\n\n## 6. 练习相似句子\n\n\"New York went a step further, requiring all restaurants to display calorie counts.\"\n\n\"纽约进一步加强了这一点，要求所有餐馆必须显示卡路里计数。\""}]},{"sentences":[{"text":"Hom said similar registration requirements could benefit struggling cities and towns, but \"if we want to make a change in the housing market, the main one is we have to build a lot more.","explainMd":"## 1. 翻译\n\n\"Hom表示，类似的注册要求可能会对正在苦苦挣扎的城市和城镇有所帮助，但是，如果我们想在房地产市场上做出改变，首要的就是我们必须建造更多的房屋。\"\n\n## 2. 词汇和短语\n\n- **Hom said**: Hom表示\n- **Similar registration requirements**: 类似的注册要求\n- **Could benefit struggling cities and towns**: 可能会对正在苦苦挣扎的城市和城镇有所帮助\n- **But \"if we want to make a change in the housing market, the main one is we have to build a lot more\"**: 但是，如果我们想在房地产市场上做出改变，首要的就是我们必须建造更多的房屋\n\n## 3. 句子结构\n\n这是一个复合句，主句是\"Hom said similar registration requirements could benefit struggling cities and towns\"，其中\"if we want to make a change in the housing market, the main one is we have to build a lot more\"是一个并列的分句。\n\n## 4. 语法\n\n这个句子使用了情态动词（\"could\"），表示的是一种可能性。\"If we want to make a change in the housing market, the main one is we have to build a lot more\"是一个条件句，描述了实现某个目标（改变房地产市场）的条件。\n\n## 5. 知识点总结\n\n- **描述可能性**：这个句子中的\"could\"用来描述一种可能性，这是一种在英文中常用的情态动词。\n- **使用条件句描述目标和条件**：这个句子中的\"If we want to make a change in the housing market, the main one is we have to build a lot more\"是一个条件句，描述了实现某个目标（改变房地产市场）的条件，这是一种在英文中常用的句型。\n\n## 6. 练习相似句子\n\n\"John said similar environmental regulations could help endangered species, but if we want to truly save them, we need to protect their habitats more effectively.\"\n\n\"John表示，类似的环保规定可能会帮助濒危物种，但是，如果我们真的想要拯救它们，我们需要更有效地保护它们的栖息地。\""}]}],"title":""}