{"translate":"","paragraphs":[{"sentences":[{"text":"Scientific papers are the recordkeepers of progress in research.","explainMd":"**1. 翻译**：\n\n\"科学论文是研究进展的记录者。\"\n\n**2. 词汇和短语**：\n\n- Scientific papers: 科学论文\n- are: 是\n- the recordkeepers: 记录者\n- of progress: 进步的\n- in research: 在研究中\n\n**3. 句子结构**：\n\n这是一个简单句，主语是 \"Scientific papers\"，谓语是 \"are\"，宾语是 \"the recordkeepers of progress in research\"。\n\n**4. 语法**：\n\n- \"are\"：这是一个链接动词，用来连接主语和表语。\n- \"the recordkeepers of progress in research\"：这是一个名词短语，作为表语描述主语的状态或性质。\n\n**5. 知识点总结**：\n\n- 当我们想要描述某物的状态或性质时，我们可以使用 \"be\" 作为链接动词，连接主语和表语。\n- 在描述某物的功能或属性时，我们可以使用 \"of\" 来构成名词短语。\n\n**6. 练习相似句子**：\n\n\"Books are the carriers of civilization and culture.\"\n\"书籍是文明和文化的承载者。\""},{"text":"Each year researchers publish millions of papers in more than 30,000 journals.","explainMd":"**1. 翻译(结合全文整体意思)**：\n\n\"每年，研究人员在超过30,000本期刊中发表数百万篇论文。\"\n\n**2. 词汇和短语**：\n\n- Each year: 每年\n- researchers: 研究人员\n- publish: 发表\n- millions of papers: 数百万篇论文\n- in more than 30,000 journals: 在超过30,000本期刊中\n\n**3. 句子结构**：\n\n这是一个简单句，主语是 \"researchers\"，谓语是 \"publish\"，宾语是 \"millions of papers\"，然后有一个介词短语 \"in more than 30,000 journals\" 作为地点状语。\n\n**4. 语法**：\n\n- \"publish\"：这是一个一般现在时态的动词，表示习惯性或经常发生的动作。\n- \"in more than 30,000 journals\"：这是一个介词短语，表示动作发生的地点。\n\n**5. 知识点总结**：\n\n- 当我们想要表达习惯性或经常发生的动作时，我们可以使用一般现在时态。\n- 在描述动作发生的地点时，我们可以使用 \"in\" 作为介词。\n\n**6. 练习相似句子(英文加中文翻译，一句)**：\n\n\"Every day, students read thousands of pages in more than 100 libraries.\"\n\"每天，学生们在超过100个图书馆阅读数千页。\""},{"text":"The scientific community measures the quality of those papers in a number of ways, including the perceived quality of the journal (as reflected by the title's impact factor) and the number of citations a specific paper accumulates.","explainMd":"**1. 翻译**：\n\n\"科学社区通过多种方式评估这些论文的质量，包括期刊的感知质量（如标题的影响因子所反映的）和特定论文积累的引用数量。\"\n\n**2. 词汇和短语**：\n\n- The scientific community: 科学社区\n- measures: 评估\n- the quality of those papers: 这些论文的质量\n- in a number of ways: 通过多种方式\n- including: 包括\n- the perceived quality of the journal: 期刊的感知质量\n- as reflected by the title's impact factor: 如标题的影响因子所反映的\n- and the number of citations a specific paper accumulates: 和特定论文积累的引用数量\n\n**3. 句子结构**：\n\n这是一个复合句，主句是 \"The scientific community measures the quality of those papers in a number of ways\"，接着是两个并列的介词短语 \"including the perceived quality of the journal (as reflected by the title's impact factor)\" 和 \"and the number of citations a specific paper accumulates\"。\n\n**4. 语法**：\n\n- \"measures\"：这是一个一般现在时态的动词，表示习惯性或经常发生的动作。\n- \"including\"：这是一个介词，引导并列的详细内容。\n- \"as reflected by the title's impact factor\"：这是一个短语，用于解释 \"the perceived quality of the journal\"。\n\n**5. 知识点总结**：\n\n- 当我们想要表达习惯性或经常发生的动作时，我们可以使用一般现在时态。\n- \"including\" 是一个常用的介词，用来引导并列的详细内容。\n- \"as reflected by\" 是一个短语，用于解释或说明前面的内容。\n\n**6. 练习相似句子**：\n\n\"The school evaluates the performance of students in a number of ways, including the grades in exams (as represented by the GPA) and the number of awards a specific student receives.\"\n\"学校通过多种方式评估学生的表现，包括考试成绩（如GPA所代表的）和特定学生获得的奖项数量。\""},{"text":"The careers of scientists and the reputation of their institutions depend on the number and prestige of the papers they produce, but even more so on the citations attracted by these papers.","explainMd":"**1. 翻译**：\n\n\"科学家的职业生涯和他们所在机构的声誉取决于他们产出的论文数量和声望，而更重要的是这些论文所吸引的引用次数。\"\n\n**2. 词汇和短语**：\n\n- The careers of scientists: 科学家的职业生涯\n- and the reputation of their institutions: 和他们所在机构的声誉\n- depend on: 取决于\n- the number and prestige of the papers they produce: 他们产出的论文的数量和声望\n- but even more so: 但更重要的是\n- on the citations attracted by these papers: 这些论文所吸引的引用次数\n\n**3. 句子结构**：\n\n这是一个复杂句。主句是 \"The careers of scientists and the reputation of their institutions depend on the number and prestige of the papers they produce\"，然后有一个转折并列句 \"but even more so on the citations attracted by these papers\"。\n\n**4. 语法**：\n\n- \"depend on\"：这是一个短语动词，表示依赖或取决于。\n- \"but even more so\"：这是一个转折并列连词，表示尽管有前面的情况，但更重要的是后面的情况。\n\n**5. 知识点总结**：\n\n- 当我们想要表达依赖或取决于的意思时，我们可以使用 \"depend on\"。\n- \"but even more so\" 是一个常用的转折并列连词，用来表示尽管有前面的情况，但更重要的是后面的情况。\n\n**6. 练习相似句子**：\n\n\"The success of students and the reputation of their schools depend on the grades they get, but even more so on the knowledge they acquire.\"\n\"学生的成功和他们学校的声誉取决于他们获得的成绩，但更重要的是他们所获得的知识。\""}]},{"sentences":[{"text":"Citation cartels, where journals, authors, and institutions conspire to inflate citation numbers, have existed for a long time.","explainMd":"**1. 翻译**：\n\n\"引文联盟，即期刊、作者和机构共谋以夸大增加引用次数，已经存在了很长时间了。\"\n\n**2. 词汇和短语**：\n\n- Citation cartels: 引用集团\n- where: 在哪里，这里指的是在什么情况下\n- journals, authors, and institutions: 期刊、作者和机构\n- conspire to: 共谋做...\n- inflate citation numbers: 增加引用次数\n- have existed for a long time: 已经存在很长时间了\n\n**3. 句子结构**：\n\n这是一个复合句。主句是 \"Citation cartels have existed for a long time\"，然后 \"where journals, authors, and institutions conspire to inflate citation numbers\" 是一个定语从句，修饰 \"Citation cartels\"。\n\n**4. 语法**：\n\n- \"have existed for a long time\"：这是一个现在完成时，表示从过去到现在的状态或行为。\n- \"where\"：这是一个引导定语从句的关系副词，用来指代地点或情况。\n\n**5. 知识点总结**：\n\n- 当我们想要表达从过去到现在的状态或行为时，我们可以使用现在完成时。\n- 当我们想要修饰名词并表达地点或情况时，我们可以使用 \"where\" 引导定语从句。\n\n**6. 练习相似句子**：\n\n\"Trade alliances, where countries cooperate to enhance trade relations, have existed for a long time.\"\n\"贸易联盟，即各国合作以增强贸易关系，已经存在了很长时间。\""},{"text":"In 2016, researchers developed an algorithm to recognize suspicious citation patterns, including groups of authors that disproportionately cite one another and groups of journals that cite each other frequently to increase the impact factors of their publications.","explainMd":"**1. 翻译**：\n\n\"2016年，研究人员开发了一种算法来识别可疑的引用模式，包括过度互相引用的作者群体和频繁互相引用以提高出版物影响因子的期刊群体。\"\n\n**2. 词汇和短语**：\n\n- In 2016: 在2016年\n- researchers: 研究人员\n- developed: 开发\n- an algorithm: 一种算法\n- to recognize: 识别\n- suspicious citation patterns: 可疑的引用模式\n- including: 包括\n- groups of authors: 作者群体\n- that disproportionately cite one another: 过度互相引用\n- and groups of journals: 和期刊群体\n- that cite each other frequently: 频繁互相引用\n- to increase the impact factors of their publications: 以提高他们的出版物的影响因子\n\n**3. 句子结构**：\n\n这是一个复合句。主句是 \"In 2016, researchers developed an algorithm to recognize suspicious citation patterns\"，然后是一个并列的介词短语 \"including groups of authors that disproportionately cite one another and groups of journals that cite each other frequently to increase the impact factors of their publications\"，用来进一步解释 \"suspicious citation patterns\"。\n\n**4. 语法**：\n\n- \"developed\"：这是一个一般过去时，表示过去发生的动作。\n- \"including\"：这是一个介词，引导并列的详细内容。\n\n**5. 知识点总结**：\n\n- 当我们想要表达过去发生的动作时，我们可以使用一般过去时。\n- \"including\" 是一个常用的介词，用来引导并列的详细内容。\n\n**6. 练习相似句子**：\n\n\"In 2020, engineers developed a system to monitor abnormal traffic patterns, including groups of vehicles that disproportionately use one road and groups of roads that are frequently used to increase the traffic flow of the city.\"\n\"2020年，工程师们开发了一个系统，用于监控异常的交通模式，包括过度使用一条道路的车辆群体，以及经常被用来增加城市交通流量的道路群体。\""},{"text":"Recently, another expression of this predatory behavior has emerged: so-called support service consultancies that provide language and other editorial support to individual authors and to journals sometimes advise contributors to add a number of citations to their articles.","explainMd":"**1. 翻译(结合全文整体意思)**：\n\n\"最近，这种掠夺性行为的另一种表现形式已经出现：所谓的支持服务咨询机构，它们为个别作者和期刊提供语言和其他编辑支持，有时会建议投稿者向他们的文章中添加一些引用。\"\n\n**2. 词汇和短语**：\n\n- Recently: 最近\n- another expression of this predatory behavior: 这种掠夺性行为的另一种表现形式\n- has emerged: 已经出现\n- so-called: 所谓的\n- support service consultancies: 支持服务咨询机构\n- that provide language and other editorial support: 它们提供语言和其他编辑支持\n- to individual authors and to journals: 给个别作者和期刊\n- sometimes advise contributors: 有时会建议投稿者\n- to add a number of citations to their articles: 在他们的文章中添加一些引用\n\n**3. 句子结构**：\n\n这是一个复杂句。主句是 \"Recently, another expression of this predatory behavior has emerged\"。然后有一个定语从句 \"so-called support service consultancies that provide language and other editorial support to individual authors and to journals sometimes advise contributors to add a number of citations to their articles\"，修饰 \"another expression\"。\n\n**4. 语法**：\n\n- \"has emerged\"：这是一个现在完成时，表示过去发生的动作对现在造成的影响。\n- \"that provide ... and ... sometimes advise ...\"：这是一个定语从句，用来修饰 \"support service consultancies\"。\n\n**5. 知识点总结**：\n\n- 当我们想要表达过去发生的动作对现在造成的影响时，我们可以使用现在完成时。\n- 当我们想要修饰名词并提供更详细的信息时，我们可以使用定语从句。\n\n**6. 练习相似句子(英文加中文翻译，一句)**：\n\n\"Recently, another trend in this competitive market has emerged: so-called marketing agencies that provide branding and other promotional strategies to companies and products sometimes advise clients to add more advertisements to their campaigns.\"\n\"最近，这个竞争激烈的市场中出现了另一种趋势：所谓的营销机构，它们为公司和产品提供品牌和其他推广策略，有时会建议客户在他们的活动中增加更多的广告。\""}]},{"sentences":[{"text":"The advent of electronic publishing and authors9 need to find outlets for their papers resulted in thousands of new journals.","explainMd":"**1. 翻译**：\n\n\"电子出版的出现和作者寻找发表论文的渠道的需求导致了数以千计新期刊的诞生。\"\n\n**2. 词汇和短语**：\n\n- The advent of: ……的出现\n- electronic publishing: 电子出版\n- and: 和\n- authors' need: 作者的需要\n- to find outlets for their papers: 寻找发表论文的渠道\n- resulted in: 导致了\n- thousands of new journals: 数以千计的新期刊\n\n**3. 句子结构**：\n\n这是一个简单句，主语是 \"The advent of electronic publishing and authors' need to find outlets for their papers\"，谓语是 \"resulted in\"，宾语是 \"thousands of new journals\"。\n\n**4. 语法**：\n\n- \"resulted in\"：这是一个短语动词，表示导致……结果。\n- \"The advent of electronic publishing and authors' need to find outlets for their papers\"：这是一个并列的名词短语，作为句子的主语。\n\n**5. 知识点总结**：\n\n- 当我们想要表达导致某种结果时，我们可以使用 \"result in\" 这个短语。\n- 当我们想要同时表达两个或多个并列的主语时，我们可以使用 \"and\" 来连接。\n\n**6. 练习相似句子**：\n\n\"The rise of social media and people's desire to share their lives have resulted in millions of new blogs.\"\n\"社交媒体的崛起和人们分享生活的愿望导致了数以百万计的新博客的诞生。\""},{"text":"The birth of predatory journals wasn't far behind.","explainMd":"**1. 翻译(结合全文整体意思)**：\n\n\"掠夺性期刊的出现紧随其后。\"\n\n**2. 词汇和短语**：\n\n- The birth of: ……的出现，这里指的是新的事物或观念的诞生\n- predatory journals: 掠夺性期刊\n- wasn't far behind: 紧随其后\n\n**3. 句子结构**：\n\n这是一个简单句，主语是 \"The birth of predatory journals\"，谓语是 \"wasn't far behind\"。\n\n**4. 语法**：\n\n- \"wasn't far behind\"：这是一个一般过去时，表示过去发生的动作或状态。这个短语常用来表示某件事情紧随另一件事情发生。\n\n**5. 知识点总结**：\n\n- 当我们想要表达过去发生的动作或状态时，我们可以使用一般过去时。\n- \"wasn't far behind\" 是一个常用的短语，用来表示某件事情紧随另一件事情发生。\n\n**6. 练习相似句子(英文加中文翻译，一句)**：\n\n\"The introduction of smartphones wasn't far behind the advent of the internet.\"\n\"智能手机的推出紧随互联网的出现之后。\""},{"text":"These journals can act as milk cows where every single article in an issue may cite a specific paper or a series of papers.","explainMd":"**1. 翻译**：\n\n\"这些期刊可以作为'摇钱树'，其中每一篇文章可能会引用特定的一篇或一系列论文。\"\n\n**2. 词汇和短语**：\n\n- These journals: 这些期刊\n- can act as: 可以作为\n- milk cows: 摇钱树，这里的含义是一种可持续产生利益的资源\n- where: 在哪里，这里是引导一个定语从句\n- every single article in an issue: 每一期中的每一篇文章\n- may cite: 可能会引用\n- a specific paper or a series of papers: 特定的一篇或一系列论文\n\n**3. 句子结构**：\n\n这是一个复合句。主句是 \"These journals can act as milk cows\"，接着是一个由 \"where\" 引导的定语从句 \"where every single article in an issue may cite a specific paper or a series of papers\"，这个定语从句修饰 \"milk cows\"。\n\n**4. 语法**：\n\n- \"can act as\"：这是一个模态动词短语，表示可能性或能力。\n- \"where\"：这是一个引导定语从句的关系副词，用来指代地点或情况。\n\n**5. 知识点总结**：\n\n- 当我们想要表达可能性或能力时，我们可以使用模态动词 \"can\"。\n- 当我们想要修饰名词并表达地点或情况时，我们可以使用 \"where\" 引导定语从句。\n\n**6. 练习相似句子**：\n\n\"These websites can act as platforms where every single user can share a specific idea or a series of ideas.\"\n\"这些网站可以作为平台，每一个用户都可以分享特定的一个或一系列的想法。\""},{"text":"In some instances, there is absolutely no relationship between the content of the article and the citations.","explainMd":"**1. 翻译**：\n\n\"在某些情况下，文章的内容和引用之间完全没有关系。\"\n\n**2. 词汇和短语**：\n\n- In some instances: 在某些情况下\n- there is: 存在\n- absolutely: 完全地\n- no relationship: 没有关系\n- between: 在……之间\n- the content of the article: 文章的内容\n- and the citations: 和引用\n\n**3. 句子结构**：\n\n这是一个简单句，主语是 \"there\"，谓语是 \"is\"，宾语是 \"no relationship between the content of the article and the citations\"。\n\n**4. 语法**：\n\n- \"there is\"：这是一个存在句型，用来表示某物存在的状态。\n- \"no relationship between ... and ...\"：这是一个表示两者之间没有联系或关系的结构。\n\n**5. 知识点总结**：\n\n- 当我们想要表达某物存在的状态时，我们可以使用存在句型 \"there is\"。\n- 当我们想要表达两者之间没有联系或关系时，我们可以使用 \"no relationship between ... and ...\" 结构。\n\n**6. 练习相似句子**：\n\n\"In some cases, there is absolutely no connection between the price of a product and its quality.\"\n\"在某些情况下，产品的价格和其质量之间完全没有关系。\""},{"text":"The peculiar part is that the journal that the editor is supposedly working for is not profiting at all—it is just providing citations to other journals.","explainMd":"**1. 翻译**：\n\n\"奇特的是，编辑所在的期刊并未从中获利，它只是为其他期刊提供引用。\"\n\n**2. 词汇和短语**：\n\n- The peculiar part is: 奇特的是\n- that the journal: 那个期刊\n- that the editor is supposedly working for: 编辑应该为之工作的那个\n- is not profiting at all: 并未从中获利\n- it is just providing citations to other journals: 它只是为其他期刊提供引用\n\n**3. 句子结构**：\n\n这是一个复杂句。主句是 \"The peculiar part is that the journal that the editor is supposedly working for is not profiting at all\"，然后有一个并列的句子 \"it is just providing citations to other journals\"。\n\n**4. 语法**：\n\n- \"that the journal that the editor is supposedly working for is not profiting at all\"：这是一个宾语从句，用来解释 \"The peculiar part is\"。\n- \"it is just providing citations to other journals\"：这是一个一般现在时的句子，用以描述正在进行的动作或状态。\n\n**5. 知识点总结**：\n\n- 当我们想要解释或描述某个特定事物时，我们可以使用宾语从句。\n- 当我们想要描述正在进行的动作或状态时，我们可以使用一般现在时。\n\n**6. 练习相似句子**：\n\n\"The surprising part is that the company that the manager is supposedly working for is not making any profit—it is just providing services to other companies.\"\n\"令人惊讶的是，经理所在的公司并未盈利，它只是为其他公司提供服务。\""},{"text":"Such practices can lead an article to accrue more than 150 citations in the same year that it was published.","explainMd":"**1. 翻译**：\n\n\"这样的做法可能导致一篇文章在发表的同一年内累积超过150次引用。\"\n\n**2. 词汇和短语**：\n\n- Such practices: 这样的做法\n- can lead: 可以导致\n- an article: 一篇文章\n- to accrue: 累积\n- more than 150 citations: 超过150次引用\n- in the same year that it was published: 在它发表的同一年\n\n**3. 句子结构**：\n\n这是一个简单句，主语是 \"Such practices\"，谓语是 \"can lead\"，宾语是 \"an article to accrue more than 150 citations in the same year that it was published\"。\n\n**4. 语法**：\n\n- \"can lead\"：这是一个模态动词短语，表示可能性或能力。\n- \"to accrue\"：这是一个不定式，用来表达目的或结果。\n\n**5. 知识点总结**：\n\n- 当我们想要表达可能性或能力时，我们可以使用模态动词 \"can\"。\n- 当我们想要表达目的或结果时，我们可以使用不定式 \"to\"。\n\n**6. 练习相似句子**：\n\n\"Such strategies can lead a company to gain more than 1000 new customers in the same year that it was established.\"\n\"这样的策略可能导致一家公司在成立的同一年内获得超过1000个新客户。\""}]},{"sentences":[{"text":"How insidious is this type of citation manipulation?","explainMd":"**1. 翻译**：\n\n\"这种类型的引文操纵有多么隐蔽？\"\n\n**2. 词汇和短语**：\n\n- How: 多么，用于疑问句中询问程度或情况\n- insidious: 隐蔽的，狡猾的\n- is: 是，助动词\n- this type of: 这种类型的\n- citation manipulation: 引文操纵\n\n**3. 句子结构**：\n\n这是一个疑问句，主语是 \"this type of citation manipulation\"，谓语是 \"is\"，\"How insidious\" 用来询问主语的程度或情况。\n\n**4. 语法**：\n\n- \"How\"：在这里是一个疑问代词，用来询问程度或情况。\n- \"is\"：这是助动词，用于构成现在时态。\n\n**5. 知识点总结**：\n\n- 当我们想要询问程度或情况时，我们可以使用 \"How\"。\n- 当我们想要构成现在时态时，我们可以使用助动词 \"is\"。\n\n**6. 练习相似句子**：\n\n\"How widespread is this type of online fraud?\"\n\"这种类型的在线欺诈有多么普遍？\""},{"text":"In one example, an individual—acting as author, editor, and consultant—was able to use at least 15 journals as citation providers to articles published by five scientists at three universities.","explainMd":"**1. 翻译**：\n\n\"在一个例子中，一个既是作者、编辑又是顾问的个人，能够利用至少15个期刊作为引文来源，为三所大学的五位科学家发表的文章提供引用。\"\n\n**2. 词汇和短语**：\n\n- In one example: 在一个例子中\n- an individual: 一个个人\n- acting as: 扮演着……角色\n- author, editor, and consultant: 作者、编辑和顾问\n- was able to: 能够\n- use: 使用\n- at least 15 journals: 至少15个期刊\n- as citation providers: 作为引文来源\n- to articles: 对文章\n- published by: 由……发表\n- five scientists at three universities: 三所大学的五位科学家\n\n**3. 句子结构**：\n\n这是一个简单句，主语是 \"an individual\"，谓语是 \"was able to use at least 15 journals as citation providers\"，宾语是 \"to articles published by five scientists at three universities\"。\n\n**4. 语法**：\n\n- \"was able to\"：这是一个模态动词短语，表示能力。\n- \"use ... as ... \"：这是一个常用结构，表示\"使用...作为...\"。\n\n**5. 知识点总结**：\n\n- 当我们想要表达能力时，我们可以使用 \"be able to\"。\n- 当我们想要表示\"使用...作为...\"时，我们可以使用 \"use ... as ... \" 结构。\n\n**6. 练习相似句子**：\n\n\"In one case, a student—serving as a team leader and coordinator—was able to use at least 10 resources as reference materials for the project conducted by five group members.\"\n\"在一个案例中，一个既是团队领导又是协调员的学生，能够利用至少10个资源作为五位小组成员进行的项目的参考材料。\""},{"text":"The problem is rampant in Scopus, a citation database, which includes a high number of the new \"international\" journals.","explainMd":"**1. 翻译**：\n\n\"这个问题在Scopus中非常猖獗，Scopus是一个引文数据库，包含了大量新的“国际”期刊。\"\n\n**2. 词汇和短语**：\n\n- The problem: 这个问题\n- is rampant: 非常猖獗\n- in Scopus: 在Scopus中\n- a citation database: 一个引文数据库\n- which includes: 它包含了\n- a high number of: 大量的\n- the new \"international\" journals: 新的“国际”期刊\n\n**3. 句子结构**：\n\n这是一个复杂句。主句是 \"The problem is rampant in Scopus\"，然后有一个由 \"which\" 引导的定语从句 \"which includes a high number of the new \"international\" journals\"，这个定语从句修饰 \"Scopus\"。\n\n**4. 语法**：\n\n- \"is rampant\"：这是一个一般现在时，表示现在进行的动作或状态。“rampant”是形容词，表示事物非常猖獗，无法控制。\n- \"which includes\"：这是一个定语从句，用来对前面的名词进行陈述或解释。\n\n**5. 知识点总结**：\n\n- 当我们想要表达现在进行的动作或状态时，我们可以使用一般现在时。\n- 当我们想要对前面的名词进行陈述或解释时，我们可以使用定语从句。\n\n**6. 练习相似句子**：\n\n\"The pollution is severe in City X, a large industrial city, which includes a high number of factories.\"\n\"在X城市，这是一个大型的工业城市，污染非常严重，它包含了大量的工厂。\""},{"text":"In fact, a listing in Scopus seems to be a criterion to be targeted in this type of citation manipulation.","explainMd":"**1. 翻译**：\n\n\"实际上，被列入Scopus似乎是成为这种引用操纵目标的一个标准。\"\n\n**2. 词汇和短语**：\n\n- In fact: 实际上\n- a listing in Scopus: 被列入Scopus\n- seems to be: 似乎是\n- a criterion: 一个标准\n- to be targeted: 成为目标\n- in this type of citation manipulation: 在这种引用操纵中\n\n**3. 句子结构**：\n\n这是一个简单句，主语是 \"a listing in Scopus\"，谓语是 \"seems to be a criterion to be targeted in this type of citation manipulation\"。\n\n**4. 语法**：\n\n- \"seems to be\"：这是一个表示似乎是或看起来像的结构。\n- \"to be targeted\"：这是一个被动语态的不定式结构，表示成为目标。\n\n**5. 知识点总结**：\n\n- 当我们想要表示似乎是或看起来像的意思时，我们可以使用 \"seems to be\"。\n- 当我们想要表示被动的意思时，我们可以使用被动语态的不定式 \"to be + 过去分词\"。\n\n**6. 练习相似句子**：\n\n\"In fact, a listing in the directory seems to be a requirement to be considered for this type of job application.\"\n\"实际上，被列入目录似乎是被考虑用于这种类型的工作申请的要求。\""}]},{"sentences":[{"text":"Scopus itself has all the data necessary to detect this malpractice.","explainMd":"**1. 翻译**：\n\n\"Scopus本身就拥有检测这种恶行所需的所有数据。\"\n\n**2. 词汇和短语**：\n\n- Scopus itself: Scopus本身\n- has: 拥有\n- all the data: 所有数据\n- necessary: 所需的\n- to detect: 以检测\n- this malpractice: 这种恶行\n\n**3. 句子结构**：\n\n这是一个简单句，主语是 \"Scopus itself\"，谓语是 \"has\"，宾语是 \"all the data necessary to detect this malpractice\"。\n\n**4. 语法**：\n\n- \"has\"：这是一个一般现在时的动词，表示拥有。\n- \"necessary to detect\"：这是一个形容词短语，用来修饰 \"all the data\"。\n\n**5. 知识点总结**：\n\n- 当我们想要表达拥有的状态时，我们可以使用动词 \"has\"。\n- 当我们想要修饰名词时，我们可以使用形容词短语。\n\n**6. 练习相似句子**：\n\n\"The organization itself has all the resources necessary to solve this problem.\"\n\"该组织本身就拥有解决这个问题所需的所有资源。\""},{"text":"Red flags include a large number of citations to an article within the first year.","explainMd":"**1. 翻译**：\n\n\"警告的标志包括一篇文章在第一年内的引用数量大幅增加。\"\n\n**2. 词汇和短语**：\n\n- Red flags: 警告的标志\n- include: 包括\n- a large number of: 大量的\n- citations: 引用\n- to an article: 对一篇文章\n- within the first year: 在第一年内\n\n**3. 句子结构**：\n\n这是一个简单句，主语是 \"Red flags\"，谓语是 \"include\"，宾语是 \"a large number of citations to an article within the first year\"。\n\n**4. 语法**：\n\n- \"include\"：这是一个表示包含的动词。\n- \"a large number of\"：这是一个数量词组，用来描述数量多的事物。\n\n**5. 知识点总结**：\n\n- 当我们想要表示包含的意思时，我们可以使用动词 \"include\"。\n- 当我们想要描述数量多的事物时，我们可以使用 \"a large number of\"。\n\n**6. 练习相似句子**：\n\n\"Warning signs include a large number of complaints about a product within the first month.\"\n\"警告标志包括一个产品在第一个月内收到大量的投诉。\""},{"text":"And for authors who wish to steer clear of citation cartel activities: when an editor, a reviewer, or a support service asks you to add inappropriate references, do not oblige and do report the request to the journal.","explainMd":"**1. 翻译**：\n\n\"对于希望避开引文围攻活动的作者来说：当编辑、审稿人或支持服务要求你添加不适当的参考文献时，不要答应并向期刊报告此类请求。\"\n\n**2. 词汇和短语**：\n\n- And for authors: 对于作者\n- who wish to: 希望\n- steer clear of: 避开\n- citation cartel activities: 引文围攻活动\n- when: 当\n- an editor, a reviewer, or a support service: 一位编辑，审稿人，或支持服务\n- asks you to: 要求你\n- add: 添加\n- inappropriate references: 不适当的参考文献\n- do not oblige: 不要答应\n- and: 并且\n- do report: 报告\n- the request: 此类请求\n- to the journal: 给期刊\n\n**3. 句子结构**：\n\n这是一个复杂句。主句是 \"do not oblige and do report the request to the journal\"，然后有一个由 \"And for authors who wish to steer clear of citation cartel activities\" 的短语作为主句的前置定语，再有一个由 \"when\" 引导的时间状语从句 \"when an editor, a reviewer, or a support service asks you to add inappropriate references\"。\n\n**4. 语法**：\n\n- \"who wish to\"：这是一个由关系代词 \"who\" 引导的定语从句，用来修饰 \"authors\"。\n- \"when\"：这是一个引导时间状语从句的连词，表示当......时。\n\n**5. 知识点总结**：\n\n- 当我们想要修饰一个名词时，我们可以使用关系代词引导的定语从句。\n- 当我们想要表示当......时的概念时，我们可以使用 \"when\" 引导的时间状语从句。\n\n**6. 练习相似句子**：\n\n\"And for customers who wish to avoid online scams: when a seller asks you to make a payment outside the platform, do not comply and do report the request to the platform.\"\n\"对于希望避开网络诈骗的消费者来说：当卖家要求你在平台外进行付款时，不要答应并向平台报告此类请求。\""}]}],"title":""}